<!-- $XConsortium: glossary.sgm /main/10 1996/12/20 20:15:13 rws $ -->
<!-- (c) Copyright 1995 Digital Equipment Corporation. -->
<!-- (c) Copyright 1995 Hewlett-Packard Company. -->
<!-- (c) Copyright 1995 International Business Machines Corp. -->
<!-- (c) Copyright 1995 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1995 Novell, Inc. -->
<!-- (c) Copyright 1995 FUJITSU LIMITED. -->
<!-- (c) Copyright 1995 Hitachi. -->
<glossary id="UG.Gloss.div.1">
<title>Glossar</title>
<glossentry><glossterm>Abbrechen</glossterm> 
<glossdef>
<para>Eine Taste, die ein Fenster entfernt, ohne die vorgenommenen Ver&auml;nderungen
auf das Fenster anzuwenden.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Abfolge</glossterm>
<glossdef>
<para>Eine Liste der zuletzt verwendeten Befehle, Dateien, Ordner oder Hilfethemen.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Abk&uuml;rzung</glossterm> 
<glossdef>
<para>Allgemeiner Begriff f&uuml;r eine Aktion mit der Maus, die das Ausf&uuml;llen
eines Dialogfensters vereinfacht. Ein Beispiel: Als Abk&uuml;rzung kann der
Benutzer ein Element im Listenfeld 'Dateiname' doppelklicken, um es in einer
Aktion auszuw&auml;hlen und 'OK' auszuw&auml;hlen.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>abmelden</glossterm> 
<glossdef>
<para>Den Zugriff auf ein System oder eine Desktop-Session abschlie&szlig;en
oder beenden.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Abmeldung</glossterm> 
<glossdef>
<para>Das Beenden einer Desktop-Session.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Abschnitt</glossterm>
<glossdef>
<para>Eine einzelne Dokumentationseinheit, die innerhalb eines Anzeigemodul-Lesefensters
des Informationsmanagers angezeigt wird.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Addresse</glossterm> 
<glossdef>
<para>Die Position f&uuml;r die elektronische Post eines Benutzers.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Aktion</glossterm>
<glossdef>
<para>Ein Desktop-Konstrukt, das eine Methode anbietet, Anwendungen, Befehle
und andere Aktivit&auml;ten (beispielsweise das Drucken und Entfernen von
Dateien und Wechseln von Verzeichnissen) auszuf&uuml;hren. Aktionen sind als
eine Datenbank von Konfigurationsdateien definiert.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Aktion erstellen</glossterm>
<glossdef>
<para>Eine Anwendungs-Software, die es dem Benutzer erm&ouml;glicht, ein Symbol
einem Befehl zuzuordnen, so da&szlig; der Befehl durch Anklicken des Symbols
verwendet werden kann.</para>
<para>'Aktion erstellen' wird ebenfalls verwendet, um spezifische Datentypen
f&uuml;r die Datendateien einer Anwendung zu bestimmen und Symbole jenen Datentypen
zuzuordnen.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Aktionsbezeichnung</glossterm> 
<glossdef>
<para>Der Name, der unter einem Aktionssymbol angezeigt wird. Siehe <emphasis>Aktionsname</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Aktionsname</glossterm>
<glossdef>
<para>Der Name, der einer Aktion zugeordnet ist und standardm&auml;&szlig;ig
unter dem Symbol der Aktion angezeigt wird. Siehe <emphasis>Aktionsbezeichnung</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Aktionssymbol</glossterm>
<glossdef>
<para>Ein Symbol, das im Fenster eines Dateimanagers, Anwendungsmanagers oder
in einem Arbeitsbereich eine Aktion repr&auml;sentiert. Ein Aktionsymbol wird
dadurch erstellt, da&szlig; eine leere, ausf&uuml;hrbare Datei mit dem gleichen
Namen wie die Aktion, die es repr&auml;sentiert, erstellt wird.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>aktiv</glossterm>
<glossdef>
<para>Ein Fenster, Fensterelement oder Symbol, das aktuell von der Tastatur-
oder Mauseingabe aktiviert wird. Aktive Fenster werden von anderen Fenstern
im Arbeitsbereich dadurch unterschieden, da&szlig; sie eine andere Titelzeilenfarbe
oder -schattierung haben. Ein aktives Fensterelement wird durch eine Hervorhebung
oder einen Auswahl-Cursor angezeigt.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>aktives Fenster</glossterm>
<glossdef>
<para>Ein Fenster, das Tastatureingabe empf&auml;ngt.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>aktuelle Session</glossterm> 
<glossdef>
<para>Die Session, die von der Session-Steuerung beim Abmelden gespeichert
wird. Bei der n&auml;chsten Anmeldung wird diese Session, falls vom Benutzer
nicht anders festgelegt, automatisch wieder ge&ouml;ffnet, wodurch der Benutzer
an der Stelle mit der Arbeit fortsetzen kann, an der er abgebrochen hat. Gegensatz
zu <emphasis>Standardsitzung</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>aktueller Ordner</glossterm> 
<glossdef>
<para>Der gegenw&auml;rtig ge&ouml;ffnete Ordner in einem aktiven Dateimanagerfenster.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>aktuelles Element, aktuelle Auswahl</glossterm>
<glossdef>
<para>Das aktuell hervorgehobene Element in einer Liste.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Alias</glossterm>
<glossdef>
<para>Ein alternativer Name oder alternative Namen, der/die einem Programm
oder der Adresse der elektronischen Post zugewiesen wurde(n).</para>
<para>Im Bereich der elektronischen Post, eine Adresse, um Post an eine Gruppe
von Benutzern zu senden. Ein Alias kann erstellt werden, um elektronische
Post an eine kleine Gruppe von Benutzern oder an viele Benutzer zu senden.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>anhalten</glossterm>
<glossdef>
<para>Einen Proze&szlig; zeitweilig unterbrechen, ohne ihn zu beenden.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Anlage</glossterm>
<glossdef>
<para>(In Post) Ein Datenobjekt innerhalb einer elektronischen Nachricht,
das als Symbol in der Anlagenliste angezeigt wird. Eine Anlage kann Text,
Ton oder eine Grafik sein. Mehrere Nachrichten k&ouml;nnen einer einzigen
elektronischen Nachricht hinzugef&uuml;gt werden.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>anmelden</glossterm>
<glossdef>
<para>Einen Benutzernamen und ein Kennwort angeben, um Zugriff auf ein System
oder eine Desktop-Session zu erhalten.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Anmeldung</glossterm>
<glossdef>
<para>Der Vorgang, Zugriff auf ein System zu erhalten.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Anpassung</glossterm>
<glossdef>
<para>Der Proze&szlig; der &Auml;nderung von Einstellungen, um die Darstellung
und das Verhalten des Desktops und der auf ihm ausgef&uuml;hrten Anwendungen
zu &auml;ndern.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Anwenden</glossterm>
<glossdef>
<para>Eine Wahlm&ouml;glichkeit, die die Auswahl (oder die Auswahlgruppe)
eines Dialogfensters wirksam werden l&auml;&szlig;t.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Anwendung</glossterm> 
<glossdef>
<para>Siehe <emphasis>Anwendungs-Software.</emphasis></para>
</glossdef>
</glossentry>
<glossentry><glossterm>Anwendungsmanager</glossterm>
<glossdef>
<para>Ein Fenster, das Objekte enth&auml;lt, die die f&uuml;r den Benutzer
verf&uuml;gbaren Systemaktionen repr&auml;sentieren.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Anwendungs-Server</glossterm>
<glossdef>
<para>Ein Host-Computer, der den Zugriff auf eine Anwendungs-Software bietet.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Anwendungssmybol</glossterm>
<glossdef>
<para>Siehe <emphasis>Aktionssymbol</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Anwendungs-Software</glossterm> 
<glossdef>
<para>Ein Computerprogramm, das dem Benutzer Werkzeuge zum Arbeiten bereitstellt.
Umgebungsmanager, Texteditor und Dateimanager sind Beispiele f&uuml;r Anwendungs-Software.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>AppBuilder</glossterm>
<glossdef>
<para>Eine Anwendungs-Software, die zum Erstellen einer grafischen Benutzerschnittstelle
verwendet wird.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Arbeitsbereich</glossterm>
<glossdef>
<para>Die aktuelle Bildschirmanzeige, die in ihr enthaltenen Symbole und Fenster
und der nicht belegte Bildschirmbereich, auf dem Symbole plaziert werden k&ouml;nnen.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Arbeitsbereichsmanager</glossterm> 
<glossdef>
<para>Die Anwendungs-Software, die die Gr&ouml;&szlig;e, Plazierung und Fensteroperationen
innerhalb aller Arbeitsbereiche steuert.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Arbeitsbereichsmen&uuml;</glossterm>
<glossdef>
<para>Das Men&uuml;, das angezeigt wird, wenn auf einen nicht belegten Bereich
des Arbeitsbereichs gezeigt und Maustaste 3 geklickt wird.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Arbeitsbereichsobjekt</glossterm> 
<glossdef>
<para>Ein Objekt, das sich im Arbeitsbereich und nicht in einer Fensteransicht
befindet. Arbeitsbereichsobjekte sind Fenster, Symbole (auf Symbolgr&ouml;&szlig;e
verkleinerte Fenster) und Objekte, die aus dem Dateimanager und Anwendungsmanager
gezogen und an einen Arbeitsbereich &uuml;bergeben werden.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Arbeitsbereichssymbol</glossterm> 
<glossdef>
<para>Ein Symbol, das vom Dateimanager auf den Arbeitsbereich kopiert wurde.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Arbeitsbereichsumschalter</glossterm>
<glossdef>
<para>Ein Bedienelement, das dem Benutzer die Auswahl eines Arbeitsbereichs
aus mehreren Arbeitsbereichen erm&ouml;glicht.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Arbeitsfl&auml;che</glossterm>
<glossdef>
<para>Der Teil eines Fensters, in dem Bedienelemente und Text erscheinen.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ausf&uuml;hren</glossterm> 
<glossdef>
<para>Die Zugriffsberechtigung auf eine Datei oder einen Ordner (Verzeichnis).
Zugriffsberechtigungen auf Dateien erm&ouml;glichen es dem Benutzer, ein
Programm oder eine Shell-Prozedurdatei auszuf&uuml;hren. Zugriffsberechtigungen
auf Ordner (Verzeichnisse) erm&ouml;glichen es dem Benutzer, auf die Inhalte
des Ordners (des Verzeichnisses) zuzugreifen.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ausf&uuml;hren</glossterm> 
<glossdef>
<para>Eine Anwendung oder Aktion starten.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ausw&auml;hlen</glossterm> 
<glossdef>
<para>Die Hervorhebung oder ein anderes visuelles Zeichen einem Element oder
Objekt hinzuf&uuml;gen, so da&szlig; es bedient oder aktiviert werden kann.
Auswahl bedeutet nicht, da&szlig; eine Aktion ausgef&uuml;hrt wird, sondern
entspricht einer &Auml;nderung des Zustands, wie zum Beispiel das Hervorheben
eines Listenelements oder das Einschalten eines Markierungsfeldes.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Baumansicht</glossterm> 
<glossdef>
<para>Die Ansicht eines Ordners oder von Dateien, die alle tieferliegenden
Verzeichnisse im Suchpfad enth&auml;lt.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Bedienelement</glossterm>
<glossdef>
<para>Ein generischer Begriff f&uuml;r eine Vielzahl von Elementen (wie Tasten,
Markierungsfelder und Bildlaufleisten), die eine Aktion ausf&uuml;hren oder
eine Wahleinstellung anzeigen. Siehe <emphasis>Bedienelement im Bedienfeld.</emphasis></para>
</glossdef>
</glossentry>
<glossentry><glossterm>Bedienelement f&uuml;r Kontexthilfe</glossterm>
<glossdef>
<para>Ein Bedienelement des Bedienfeldes, das dazu verwendet wird, auf dem
Bedienfeld auf die Hilfeinformation zu einem Element zuzugreifen.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Bedienelement f&uuml;r Post(programm)</glossterm>
<glossdef>
<para>Ein Bedienelement des Bedienfeldes, das zum Starten der Anwendungs-Software
Post verwendet wird. Durch das &Uuml;bergeben einer Datei an dieses Bedienelement
wird die Datei in das Fenster 'Neue Nachricht' des Postprogramms geladen.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Bedienelement im Bedienfeld</glossterm> 
<glossdef>
<para>Ein Objekt im Bedienfeld, das als eine Schnittstelle zu grundlegenden
Systemdiensten und h&auml;ufig ausgef&uuml;hrten Aufgaben und Operationen
verwendet wird. Standardm&auml;&szlig;ig enth&auml;lt das Bedienfeld die folgenden
Bedienelemente: Uhr, Kalender, Post, Texteditor, Hilfeanzeige, Drucker, Umgebungsmanager,
Anwendungsmanager und Papierkorb.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Bedienfeld</glossterm>
<glossdef>
<para>Ein zentral positioniertes Fenster, das Bedienelemente f&uuml;r den
Zugriff auf Anwendungen und Dienstprogramme, einschlie&szlig;lich dem Arbeitsbereichsumschalter,
enth&auml;lt. Das Bedienfeld belegt alle Arbeitsbereiche.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Bedientafel</glossterm>
<glossdef>
<para>Eine Erweiterung des Bedienfeldes, das sich nach oben &ouml;ffnet, um
den Zugriff auf zus&auml;tzliche Elemente anzubieten. Bedientafeln enthalten
normalerweise Gruppen verkn&uuml;pfter Elemente.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Benutzer 'root'</glossterm>
<glossdef>
<para>Siehe <emphasis>Superuser</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Benutzername</glossterm> 
<glossdef>
<para>Eine Kennung, um einen Benutzer dem System bekannt zu machen. Auch Anmeldename
genannt. Zum Beispiel k&ouml;nnte ein Benutzer namens Otto Meier den Benutzernamen
omei besitzen. Der Anmeldebildschirm fordert zur Eingabe des Benutzernamens
auf.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Bereich des Arbeitsbereichsumschalters</glossterm>
<glossdef>
<para>Der rechteckige Bereich in der Mitte des Bedienfeldes, der den Arbeitsbereichsumschalter,
die Taste zum Sperren des Bildschirms, die Taste 'Exit' und die Betriebsanzeige
enth&auml;lt.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Betriebsanzeige</glossterm>
<glossdef>
<para>Ein Steuerelement, das bei einer aufgerufenen Bedienfeldaktion blinkt,
bevor ein Fenster angezeigt wird, oder das blinkt, wenn Aktionen erneut geladen
werden.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Bezeichnung</glossterm>
<glossdef>
<para>Der Text, der bei einem Symbol oder einem Bedienelement erscheint und
dieses Element benennt.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Bild durchlaufen</glossterm> 
<glossdef>
<para>Den Cursor durch Daten um jeweils ein Inkrement weiterbewegen. W&auml;hrend
das Bild durchl&auml;uft, werden die Daten innerhalb des Fensters verschoben,
um die aktuelle Position des Cursors anzuzeigen.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Bildlaufleiste</glossterm>
<glossdef>
<para>Ein Bedienelement, das sich rechts von oder unten in einem Fenster befindet
und es dem Benutzer erlaubt, den Fensterinhalt anzuzeigen, der gerade nicht
sichtbar ist.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Bildlaufpfeil</glossterm>
<glossdef>
<para>Das Element einer Bildlaufleiste, das verwendet wird, um ein Fenster
in kleinen Inkrementen zu durchbl&auml;ttern.</para>
<para>Ebenfalls ein Bedienelement im Bedienfeld, das dazu verwendet wird,
das Bedienfeld nach oben und nach unten zu verschieben.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Bildschirmschoner</glossterm> 
<glossdef>
<para>Eine Auswahl, die nach einem festgelegten Zeitraum die Anzeige der Datenstation
ausschaltet oder die Bilder, die angezeigt werden, ver&auml;ndert. Dadurch
wird die Lebensdauer des Bildschirms verl&auml;ngert.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Bildschirmsperre</glossterm>
<glossdef>
<para>Eine Funktion, die den Bildschirm der Datenstation sperrt und eine weitere
Eingabe so lange blockiert, bis das g&uuml;ltige Benutzerkennwort eingegeben
wird.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Bitmap</glossterm> 
<glossdef>
<para>Ein Bild, das in einem Rasterformat gespeichert wurde. Normalerweise
bezieht sich der Begriff auf ein Bild, das auf zwei Farben begrenzt ist (eine
Vordergrund- und eine Hintergrundfarbe). Gegensatz zu <structname role="typedef">Pixmap</structname>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bl&auml;ttern</glossterm>
<glossdef>
<para>In einem Text, der in einem Fenster angezeigt wird, eine volle Bildschirmseite
vorr&uuml;cken. Normalerweise geschieht dies &uuml;ber die Verwendung einer
Bildlaufleiste.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Buch</glossterm>
<glossdef>
<para>Ein elektronisches Buch. Siehe auch <emphasis>B&uuml;cherregal</emphasis>
und <emphasis>Informationsbibliothek</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>B&uuml;cherliste</glossterm>
<glossdef>
<para>Die Liste von B&uuml;cherregalen und B&uuml;chern, die im Informationsmanager
zur Verf&uuml;gung stehen.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>B&uuml;cherlistenfenster</glossterm>
<glossdef>
<para>Das Dialogfenster des Informationsmanagers, das Zugriff auf Informationen
bietet, die in einer Informationsbibliothek f&uuml;r die Online-Anzeige oder
den Druck gespeichert sind.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>B&uuml;cherregal</glossterm>
<glossdef>
<para>Eine Gruppe von elektronischen B&uuml;chern &uuml;ber verwandte Themen.
Ein logischer Satz von Informationen (vielleicht mehrere thematisch verwandte
B&uuml;cher), der von einen einzelnen Volltextindex begleitet wird. Ein B&uuml;cherregal
und Stil-Schablonen repr&auml;sentieren das Minimum an Informationen, das
in eine Informationsbibliothek eingebaut werden kann. Siehe auch <emphasis>Informationsbibliothek</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>CDE</glossterm>
<glossdef>
<para>Ein Akronym f&uuml;r Common Desktop Environment, eine grafische Benutzerschnittstelle,
die unter UNIX ausgef&uuml;hrt wird.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Client</glossterm>
<glossdef>
<para>Ein System oder eine Anwendungs-Software, das/die Dienste einer anderen
Anwendung anfordert, normalerweise &uuml;ber ein Netzwerk.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Container</glossterm>
<glossdef>
<para>Ein Bedienelement, das dazu verwendet wird, Objekte oder Daten aufzunehmen.
Ein Ordner oder ein Notizbuch sind Beispiele f&uuml;r Container.</para>
<para>(In Post) Der elektronische Briefkasten und das Dateiablagesystem, das
alle elektronischen Nachrichten enth&auml;lt. Sobald eine Nachricht in den
Container gelegt wird, kann der Benutzer sie anzeigen, ver&auml;ndern, l&ouml;schen,
drucken, einschlie&szlig;en, weiterleiten oder beantworten.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Cursor</glossterm>
<glossdef>
<para>Ein grafisches Ger&auml;t, das den Bereich anzeigt, der Tastatur- oder
Zeigeger&auml;teingabe empf&auml;ngt.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Datei</glossterm>
<glossdef>
<para>Eine Dateneinheit, wie beispielsweise ein Text, ein Programm, ein Bild,
etc., die in einem Ordner (Verzeichnis) gespeichert ist.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Dateierweiterung</glossterm> 
<glossdef>
<para>Eine Erweiterung, die dem Ende eines Dateinamens hinzugef&uuml;gt wird.
Sie wird oft zur Dateitypisierung oder zur Kategorisierung von Dateien f&uuml;r
den Benutzer verwendet.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Dateimanager</glossterm> 
<glossdef>
<para>Die Anwendungs-Software, die die Dateien und Verzeichnisse des Systems
verwaltet.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Dateiname</glossterm> 
<glossdef>
<para>Der Name der Datei, mit dem diese in einem Ordner (Verzeichnis) oder
einer Speichereinheit gespeichert ist. Ein Dateiname besteht aus einem Dateinamen
ohne Pfad und Erweiterungen. Ein vollst&auml;ndig qualifizierter Name enth&auml;lt
auch den Pfad.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Dateiname ohne Pfad</glossterm> 
<glossdef>
<para>Der Dateiname einer Symboldatei ohne die Dateinamenserweiterungen f&uuml;r
die Gr&ouml;&szlig;e (<filename>.l</filename>, <filename>.m</filename>, <filename>.s</filename>, <filename>.t</filename>) und den Typ (<filename>.bm</filename>, <filename>.pm</filename>). Beispielsweise ist <filename>myicon</filename> der Dateiname
ohne Pfad einer Symboldatei namens <filename>myicon.m.pm</filename>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Datei-Server</glossterm>
<glossdef>
<para>Ein Host-Computer, der Datendateien, die von Anwendungen verwendet werden,
speichert.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Dateityp</glossterm>
<glossdef>
<para>Die Merkmale einer Datei, die festlegen, wie sie verwendet wird. Der
Typ einer Datei kann durch einen Abschnitt ihres Namens (beispielsweise der
Dateierweiterung) oder durch ihren Inhalt bestimmt sein.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Datentyp</glossterm>
<glossdef>
<para>Ein Mechanismus, der besondere Datendateien den entsprechenden Anwendungen
oder Aktionen zuordnet. Datentypen k&ouml;nnen den Typ einer Datei festlegen,
basierend auf Dateibenennungskonventionen (beispielsweise einen besonderen
Erweiterungsnamen) oder auf dem Inhalt der Datei.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Desktop</glossterm> 
<glossdef>
<para>Siehe <emphasis>Arbeitsbereich.</emphasis></para>
</glossdef>
</glossentry>
<glossentry><glossterm>Dialogfenster</glossterm>
<glossdef>
<para>Ein von einer Anwendung angezeigtes Fenster, das Benutzereingabe erfordert.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Doppelklicken/ Auswahl durch Doppelklicken</glossterm>
<glossdef>
<para>Eine Maustaste schnell zweifach anklicken, ohne den Mauszeiger zu verschieben.
Falls nicht anders angegeben, wird Maustaste 1 verwendet. Doppelklicken kann
oftmals als Alternative zum Ausw&auml;hlen eines Men&uuml;elements verwendet
werden.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Drucker ausw&auml;hlen</glossterm>
<glossdef>
<para>Druckmanager: Wird benutzt, um Informationen &uuml;ber verf&uuml;gbare
Drucker zu erhalten und einen Drucker auszuw&auml;hlen.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Druckerbedienelement</glossterm>
<glossdef>
<para>Das Bedienelement im Bedienfeld, das dazu verwendet wird, die Anwendungs-Software
Drucker zu starten. Durch &Uuml;bergeben einer Datei auf dieses Bedienelement
wird ein Dialogfenster ge&ouml;ffnet, das dazu verwendet wird, die Datei auf
dem Standarddrucker auszudrucken.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Druckereinstellungen</glossterm>
<glossdef>
<para>Ein Dialogfenster, in dem Druckereinstellungen f&uuml;r den derzeit
ausgew&auml;hlten Drucker, wie zum Beispiel Seitenorientierung (Hoch- oder
Querformat), ein- oder zweiseitiges Drucken oder die Auswahl der Papierlade
angegeben werden k&ouml;nnen. Die Anwendungen Kalender, Informationsmanager,
Post und Text-Editor zeigen dieses Dialogfenster an, wenn auf die Taste 'Einstellungen'
in ihren jeweiligen Dialogfenstern 'Drucken' doppelt geklickt wird.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Druckerjobs</glossterm>
<glossdef>
<para>Eine Anwendungs-Software, die Informationen zu den Jobs eines einzigen
Druckers bietet.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Druckermanager</glossterm>
<glossdef>
<para>Eine Anwendungs-Software, die alle Drucker des Systems anzeigt.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Druck-Server</glossterm>
<glossdef>
<para>Ein Host-Computer, mit dem ein oder mehrere Drucker verbunden sind,
oder der UNIX-Proze&szlig;, der diese Drucker verwaltet.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Eigenschaften</glossterm>
<glossdef>
<para>Ein Men&uuml;element zum Einstellen von Merkmalen eines Elements, wie
zum Beispiel sein Datum oder Name, oder zum Anzeigen der zu identifizierenden
Merkmale eines Elements, wie zum Beispiel Schriften.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Einf&uuml;gemarke</glossterm>
<glossdef>
<para>Der Punkt, an dem Daten, die &uuml;ber eine Tastatur eingegeben oder
aus der Zwischenablage oder einer Datei eingef&uuml;gt werden, auf dem Bildschirm
angezeigt werden. Im Text, ein Synonym f&uuml;r <structname role="typedef">Cursor</structname>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Eingabeaufforderung</glossterm>
<glossdef>
<para>Ein Zeichen, normalerweise <filename>%</filename>, <filename>></filename>
oder <filename>$</filename>, das anzeigt, da&szlig; der Computer bereit ist,
Befehle entgegenzunehmen. In einem emulierten Terminal-Fenster wird die Eingabeaufforderung
durch Dr&uuml;cken der Eingabetaste angezeigt.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Eingangskorb</glossterm>
<glossdef>
<para>Der Hauptcontainer oder Standard-Container von Post. Der Eingangskorb
empf&auml;ngt alle hereinkommende elektronische Post. Nachrichten k&ouml;nnen
aus dem Eingangskorb verschoben und in verschiedene Container gestellt werden.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Einstellungen</glossterm>
<glossdef>
<para>Eine Taste in den Dialogfenstern 'Drucken' der Anwendungen Kalender,
Informationsmanager, Post und Text-Editor, die das Dialogfenster 'Druckereinstellungen'
aufruft. Siehe <emphasis>Druckereinstellungen</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Element</glossterm>
<glossdef>
<para>Ein generischer Begriff f&uuml;r ein beliebiges Objekt, das in einem
weiteren Zusammenhang als eigenst&auml;ndiges Element betrachtet werden kann,
beispielsweise das Element in einer Liste oder das Bedienelement in einem
Fenster.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Elemente</glossterm>
<glossdef>
<para>Elemente einer Liste oder eines Men&uuml;s.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>E-mail</glossterm> 
<glossdef>
<para>Abk&uuml;rzung f&uuml;r 'electronic mail' (elektronische Post). E-mail
beschreibt Textnachrichten, die elektronisch adressiert und gesendet werden
und im elektronischen Briefkasten empfangen werden. Manchmal wird sie einfach
'Post' genannt.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>erweiterte Auswahl</glossterm> 
<glossdef>
<para>Mehrere Elemente einer ausgew&auml;hlten Menge hinzuf&uuml;gen, indem
die Auswahltechnik vergr&ouml;&szlig;ert wird. Zum Beispiel kann ein Element
einer Auswahl hinzugef&uuml;gt werden, indem der Zeiger auf ein neues Element
verschoben und die Steuertaste und gleichzeitig die Auswahltaste mit Hilfe
der Maustaste gedr&uuml;ckt wird.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Erweiterung</glossterm>
<glossdef>
<para>Der Teil eines Dateinamens, der am Ende hinzugef&uuml;gt ist. Er wird
von anderen Erweiterungen oder dem Dateinamen ohne Pfad durch Zeichensetzung,
beispielsweise einen Punkt (.), getrennt.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Fehlermeldung</glossterm> 
<glossdef>
<para>Eine Meldung, die die sofortige Aufmerksamkeit des Benutzers erfordert.
Fehlermeldungen werden verwendet, um eine Meldung &uuml;ber Benutzerfehler
zu &uuml;bermitteln.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Fenster</glossterm> 
<glossdef>
<para>Ein rechteckiger Bereich in der Anzeige. Anwendungs-Software verf&uuml;gt
normalerweise &uuml;ber ein Hauptfenster, in dem Zusatzfenster, <emphasis>Dialogfenster</emphasis> genannt, ge&ouml;ffnet werden k&ouml;nnen.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Fenstermen&uuml;</glossterm>
<glossdef>
<para>Das Men&uuml;, das angezeigt wird, wenn die Fenstermen&uuml;taste ausgew&auml;hlt
wird. Das Men&uuml; verf&uuml;gt &uuml;ber Auswahlm&ouml;glichkeiten zum Bearbeiten
der Position oder Gr&ouml;&szlig;e des Fensters, wie zum Beispiel 'Verschieben',
'Gr&ouml;&szlig;e &auml;ndern', 'Symbolgr&ouml;&szlig;e' und 'Maximale Gr&ouml;&szlig;e'.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Fenstermen&uuml;taste</glossterm> 
<glossdef>
<para>Das Bedienelement in der oberen linken Ecke eines Fensters. Wird sie
ausgew&auml;hlt, dann wird das Fenstermen&uuml; angezeigt.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Fensterrahmen</glossterm>
<glossdef>
<para>Der sichtbare Teil eines Fensters, der die Anwendungs-Software umgibt.
Ein Fensterrahmen kann bis zu f&uuml;nf Bedienelemente enthalten: Titelleiste,
R&auml;nder zur Gr&ouml;&szlig;e&auml;nderung, Taste f&uuml;r Symbolgr&ouml;&szlig;e,
Taste f&uuml;r maximale Gr&ouml;&szlig;e und Fenstermen&uuml;taste.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Fenstersteuerung</glossterm>
<glossdef>
<para>Die Anwendungs-Software, die Benutzern die M&ouml;glichkeit zur Bearbeitung
von Fenstern (das &Ouml;ffnen, &Auml;ndern der Gr&ouml;&szlig;e, Verschieben
und Schlie&szlig;en von Fenstern) auf dem Arbeitsbereich bietet.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Fenstersymbol</glossterm>
<glossdef>
<para>Ein auf Symbolgr&ouml;&szlig;e verkleinertes Fenster.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Filter</glossterm>
<glossdef>
<para>Wird verwendet, um nur Objekte anzuzeigen, die bestimmte Kriterien erf&uuml;llen
(beispielsweise einen Namensmustervergleich), und alle anderen Objekte aus
der Ansicht zu verdecken.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Fokus</glossterm> 
<glossdef>
<para>Die Position, auf die eine Tastatureingabe geleitet wird. Sie wird durch
die Hervorhebung angezeigt.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Greiffl&auml;chen zum Verschieben des Bedienfeldes</glossterm> 
<glossdef>
<para>Ein Bereich an beiden Enden des Bedienfeldes, der dazu verwendet wird,
das Bedienfeld zu verschieben und es in den Vordergrund des Arbeitsbereichs
zu bringen.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Greifpunkte</glossterm>
<glossdef>
<para>Die kleinen Rechtecke an den Ecken und den Mittelpunkten eines ausgew&auml;hlten
grafischen Elements.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Gr&ouml;&szlig;e wiederherstellen</glossterm> 
<glossdef>
<para>Ein Men&uuml;element, um ein Fenster wieder in der Gr&ouml;&szlig;e
und Position anzuzeigen, die es besa&szlig;, bevor es vergr&ouml;&szlig;ert
oder als Symbol angezeigt wurde.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Gruppe</glossterm>
<glossdef>
<para>Eine Ansammlung von Benutzern, auf die durch einen gemeinsamen Namen
Bezug genommen wird.</para>
<para>Ebenfalls eine Berechtigungseinstellung, die die Zugriffsberechtigung
einer Gruppe auf Dateien festlegt.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Gruppe f&uuml;r Anwendungen</glossterm> 
<glossdef>
<para>Ein Ordner des Anwendungsmanagers, der eine spezifische Anwendungs-Software
oder eine Menge von Anwendungs-Software enth&auml;lt.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Gruppe zusammengeh&ouml;riger Hilfethemen</glossterm>
<glossdef>
<para>Eine Menge von <emphasis>Hilfeb&auml;nden</emphasis>, die dazu verwendet
wird, Online-Informationen &uuml;ber zugeh&ouml;rige Anwendungen bereitzustellen.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Gruppentermin</glossterm>
<glossdef>
<para>(In Kalender) Ein Termin f&uuml;r eine Gruppe von Personen, der mit
Hilfe des Editors f&uuml;r Gruppensitzungen geplant wurde.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Hauptanzeige</glossterm>
<glossdef>
<para>Der Bereich des Bedienfeldes, au&szlig;er den Bedientafeln.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>hervorheben/Hervorhebung</glossterm> 
<glossdef>
<para>(<emphasis>v</emphasis>) Etwas auf dem Bildschirm herausstellen, indem
es ausgew&auml;hlt oder gew&auml;hlt wird. Ebenfalls ( <symbol role="Variable">n</symbol>) die optische Anzeige daf&uuml;r, das etwas ausgew&auml;hlt ist.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>hierarchisches Dateisystem</glossterm> 
<glossdef>
<para>Der Weg, Daten auf Computersystem zu verwalten, indem eine Hierarchie
von Containern, oft Ordner (Verzeichnisse) und Dateien genannt, verwendet
werden. Bei dieser Vorgehensweise k&ouml;nnen Ordner andere Ordner und Dateien
enthalten. Dadurch, da&szlig; ein Ordner andere Ordner enth&auml;lt/enthalten
kann, werden die Verwaltungsebenen erstellt, die die Hierarchie darstellen.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Hilfe</glossterm>
<glossdef>
<para>Eine Taste oder ein Men&uuml;element, um auf Informationen &uuml;ber
Objekte, Wahlm&ouml;glichkeiten, Aufgaben und Fehlermeldungen zuzugreifen.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Hilfeanzeige</glossterm>
<glossdef>
<para>Die Anwendungs-Software, die die Online-Hilfe anzeigt.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Hilfeband</glossterm>
<glossdef>
<para>Eine vollst&auml;ndige Hilfetextsammlung zu einem Thema.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Hilfefenster</glossterm> 
<glossdef>
<para>Ein Zusatzfenster, das Hilfetext anzeigt.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Hilfeindex</glossterm> 
<glossdef>
<para>Eine alphabetische Auflistung von Hilfethemen.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Hilfemanager</glossterm>
<glossdef>
<para>Ein besonderer Hilfeband, der die gesamte, auf dem System registrierte
Online-Hilfe auflistet.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Hilfetaste</glossterm>
<glossdef>
<para>Eine dedizierte Taste, normalerweise die Taste F1, die verwendet wird,
um Online-Hilfe &uuml;ber das Objekt, auf dem sich der Cursor gerade befindet,
anzufordern. Einige Tastaturen verf&uuml;gen &uuml;ber eine dedizierte Hilfetaste,
die die Position von F1 einnehmen kann.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Hintergrund des Arbeitsbereichs</glossterm>
<glossdef>
<para>Der Teil der Anzeige, der nicht mit Fenstern oder Symbolen bedeckt ist.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Hintergrundmuster</glossterm> 
<glossdef>
<para>Das Muster, das den <citetitle>Hintergrund des Arbeitsbereichs</citetitle> bedeckt.
Der Hintergrund eines Fensters, auf dem Elemente, beispielsweise Tasten und
Listen, angezeigt werden.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Hintergrundmuster des Arbeitsbereichs</glossterm>
<glossdef>
<para>Siehe <emphasis>Hintergrundmuster</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Hinzuf&uuml;gen</glossterm>
<glossdef>
<para>Das Element einer Bedientafel, das dazu verwendet wird, Symbole mit
Hilfe von Ziehen und &Uuml;bergeben im Bedienfeld zu installieren.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Standardsitzung</glossterm> 
<glossdef>
<para>Die Auswahl beim Abmelden, um eine bestimmte Session festzulegen, die
nicht der aktuellen Session entspricht, zu der automatisch bei der n&auml;chsten
Anmeldung zur&uuml;ckgekehrt wird.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Standardverzeichnis</glossterm>
<glossdef>
<para>Das Verzeichnis, in dem sich die pers&ouml;nlichen Dateien und zus&auml;tzlichen
Verzeichnisse des Benutzers befinden. Standardm&auml;&szlig;ig sind das Dateimanagerfenster
und das Fenster des Terminal-Emulators auf das Standardverzeichnis eingestellt,
wenn sie zum ersten Mal ge&ouml;ffnet werden.</para>
</glossdef>
</glossentry>
<glossentry><glossterm><symbol>Standardverzeichnis</symbol></glossterm>
<glossdef>
<para>Symbolisiert das Standardverzeichnis des Benutzers. Ein Beispiel: Ist
das Standardverzeichnis <filename>/users/anna</filename>, dann repr&auml;sentiert <filename>/<symbol role="Variable">Standardverzeichnis</symbol>/bitmaps/smile.bm</filename> das Verzeichnis <filename>/users/anna/bitmaps/smile.bm</filename>.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Hyperlink</glossterm> 
<glossdef>
<para>(In Hilfetexten) Ein Text oder eine Grafik, der/die angeklickt werden
kann, um ein anderes Hilfethema anzuzeigen.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Infobiblio</glossterm>
<glossdef>
<para>Der Satz von Dateien, aus dem eine Informationsbibliothek zusammengesetzt
ist. Siehe <emphasis>Informationsbibliothek.</emphasis></para>
</glossdef>
</glossentry>
<glossentry><glossterm>Informationsbibliothek</glossterm>
<glossdef>
<para>Eine Sammlung von B&uuml;cherregalen.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Informationsmanager</glossterm>
<glossdef>
<para>Die Software-Anwendung, mit der Sie Sammlungen von Online-Dokumentation
durchsuchen k&ouml;nnen, die Informationsbibliotheken genannt werden.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ITE</glossterm>
<glossdef>
<para>Internal Terminal Emulator. ITE erlaubt die Verwendung einer Anzeige
im Bitmap-Format als ein Terminal (&uuml;ber den Befehlszeilenmodus des Anmeldungsbildschirms.)
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Kalender</glossterm>
<glossdef>
<para>Eine Anwendungs-Software, die es dem Benutzer erm&ouml;glicht, Termine
zu planen und eine Aufgabenliste zu erstellen.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Kalenderblatt</glossterm> 
<glossdef>
<para>Der Tag, die Woche, der Monat oder das Jahr, das im Hauptfenster vom
Kalender angezeigt wird.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Kennwort</glossterm>
<glossdef>
<para>Eine Zeichenfolge, die der Benutzer verwendet, um dem System seine Identit&auml;t
zu beweisen.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>klicken auf</glossterm> 
<glossdef>
<para>Eine Maustaste dr&uuml;cken und freigeben, ohne den Mauszeiger zu verschieben.
Falls nicht anders angegeben, wird Maustaste 1 verwendet.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Kombinationstaste</glossterm>
<glossdef>
<para>Eine Taste, die, gedr&uuml;ckt und mit einer weiteren Taste oder Maustaste
gehalten, die Bedeutung der zweiten Taste oder der Maustaste &auml;ndert.
Die Steuertaste, Taste Alt und Umschalttaste sind Beispiele.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Konfigurationsdatei</glossterm>
<glossdef>
<para>Eine Datei, die dazu verwendet wird, die Eigenschaften eine Anwendung
anzupassen.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Kontexthilfe</glossterm> 
<glossdef>
<para>Wenn 'Kontexthilfe' aus dem Hilfemen&uuml; ausgew&auml;hlt wird, &auml;ndert
sich der Cursor in ein Fragezeichen. Der Benutzer kann nun Informationen zu
einem bestimmten Befehl, einer Operation, einem Dialogfenster oder einem Bedienelement
erhalten, indem er dieses Objekt anklickt.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Kurzwahltasten</glossterm>
<glossdef>
<para>Eine Tastenfolge der Tastatur, die verwendet wird, um ein Men&uuml;element
zu aktivieren, normalerweise mit Hilfe eines besonderen Direktaufrufs. Ein
Beispiel: Die Tastenkombination Alt+D, dann O dr&uuml;cken, um im Fenster
des Dateimanagers 'Ordner erstellen' im Men&uuml; 'Datei' auszuw&auml;hlen.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Lesefenster</glossterm>
<glossdef>
<para>Das Fenster des Informationsmanagers, das die Texttabellen und Grafiken
eines Buches anzeigt.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Lesen</glossterm>
<glossdef>
<para>Die Berechtigung, die Inhalte einer Datei anzusehen, oder die Berechtigung,
Dateien und Ordner (Verzeichnisse) eines Ordners (Verzeichnisses) aufzulisten.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Liste</glossterm> 
<glossdef>
<para>Ein Bedienelement, das ausw&auml;hlbare Elemente enth&auml;lt. Auch
Auswahlliste genannt.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Markierungsfeld</glossterm> 
<glossdef>
<para>Ein Bedienelement, dessen Einstellung durch das Vorhandensein oder Nichtvorhandensein
eines Hakens angezeigt wird. Ein Markierungsfeld besitzt zwei Zust&auml;nde,
ein und aus.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Maus</glossterm> 
<glossdef>
<para>Ein Ger&auml;t, das zum Bewegen des Zeigers und zum Treffen einer Auswahl
verwendet wird.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Maustaste 1</glossterm> 
<glossdef>
<para>Die am weitesten links gelegene Taste einer Maus, wenn diese f&uuml;r
den rechth&auml;ndigen Gebrauch konfiguriert wurde. Die am weitesten rechts
gelegene Taste einer Maus, falls diese f&uuml;r den linksh&auml;ndigen Gebrauch
konfiguriert wurde. Maustaste 1 wird haupts&auml;chlich zum Treffen einer
Auswahl verwendet und ist die Standardtaste f&uuml;r die 'Anklick'-Anweisung.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Maustaste 2</glossterm> 
<glossdef>
<para>Auf einer Maus mit drei Tasten die mittlere Taste. Auf einer Maus mit
zwei Tasten die rechte Taste, falls f&uuml;r rechtsh&auml;ndigen Gebrauch
konfiguriert, oder die linke Taste, falls f&uuml;r linksh&auml;ndigen Gebrauch
konfiguriert. Maustaste 2 verf&uuml;gt &uuml;ber zwei Modi: &Uuml;bertragen
und Anpassen.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Maustaste 3</glossterm>
<glossdef>
<para>Die am weitesten rechts gelegene Taste, falls f&uuml;r rechtsh&auml;ndigen
Gebrauch konfiguriert. Die am weitesten links gelegene Taste, falls f&uuml;r
linksh&auml;ndigen Gebrauch konfiguriert. Maustaste 3 aktiviert tempor&auml;r
eingeblendete Men&uuml;s.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Maustaste</glossterm> 
<glossdef>
<para>Ein Mechanismus auf einer Maus, der gedr&uuml;ckt wird, um eine Auswahl
zu treffen.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Maximale Gr&ouml;&szlig;e</glossterm> 
<glossdef>
<para>Die Auswahl, die ein Fenster auf die gr&ouml;&szlig;tm&ouml;gliche Darstellung
vergr&ouml;&szlig;ert.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Men&uuml;</glossterm> 
<glossdef>
<para>Eine Liste von Elementen, aus der ausgew&auml;hlt werden kann, um eine
bestimmte Anwendungsaufgabe auszuf&uuml;hren. Siehe auch <emphasis>Untermen&uuml;.</emphasis></para>
<para>(Ebenfalls) Ein Men&uuml; verkn&uuml;pfter Wahlm&ouml;glichkeiten, das
eine erweiterte Auswahl bietet, wenn mit Hilfe von Maustaste 1 ein Element
einer Men&uuml;leiste oder die Fenstermen&uuml;taste angeklickt wird.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Men&uuml;element</glossterm> 
<glossdef>
<para>Ein Element des Men&uuml;s, das eine Auswahl repr&auml;sentiert (beispielsweise
das Men&uuml; 'Kopieren' oder 'Bearbeiten').</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Men&uuml;leiste</glossterm> 
<glossdef>
<para>Der Bereich zwischen Titelleiste und Arbeitsbereich des Anwendungsfensters,
in dem Men&uuml;namen aufgef&uuml;hrt sind.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>mnemonisches Zeichen</glossterm> 
<glossdef>
<para>Das einzige unterstrichene Zeichen in einem Befehl. Das mnemonische
Zeichen zeigt an, da&szlig; der Befehl durch Eingeben dieses Zeichens gew&auml;hlt
werden kann. Meistens werden mnemonische Zeichen in Men&uuml;befehlen verwendet.
Andere Tasten k&ouml;nnen m&ouml;glicherweise auch &uuml;ber mnemonische Zeichen
verf&uuml;gen.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>neu starten</glossterm> 
<glossdef>
<para>Einen Proze&szlig; stoppen und erneut starten.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Neue Nachricht</glossterm> 
<glossdef>
<para>(In Post) Das Fenster, das zur Erstellung von elektronischer Post verwendet
wird. Verschiedene Optionen zur Erstellung von Nachrichten sind &uuml;ber
die Men&uuml;leiste dieses Fensters verf&uuml;gbar.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Objekt</glossterm>
<glossdef>
<para>Ein beliebiges Datenst&uuml;ck, das &uuml;ber ein zugeordnetes Verhalten
verf&uuml;gt. Zum Beispiel werden im Dateimanager alle Dateien, Ordner, Aktionen
und Anwendungen als Objekte angesehen. Jeder Objekttyp verf&uuml;gt &uuml;ber
bestimmte zugeordnete Aktionen. Typischerweise wird jedes Objekt als Symbol
dargestellt.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Objekttyp</glossterm> 
<glossdef>
<para>Ein Desktop-Mechanismus, der verwendet wird, um bestimmten Datendateien
die entsprechenden Anwendungen oder Aktionen zuzuordnen. Durch die Festlegung
des Objekttyps werden die Kriterien f&uuml;r den Dateityp (wie zum Beispiel
Name und Inhalt), das Aussehen (das Symbol, das im Dateimanager verwendet
wird) und das Verhalten des Objekts (zum Beispiel, was passiert, wenn es doppelt
angeklickt wird) definiert.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>OK</glossterm> 
<glossdef>
<para>Eine Auswahl, die die Information in einem Fenster &uuml;bernimmt und
das Fenster schlie&szlig;t. Falls das Fenster ge&auml;nderte Informationen
enth&auml;lt, werden diese &Auml;nderungen vor dem Schlie&szlig;en des Fensters
angewendet.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Ordner</glossterm>
<glossdef>
<para>Ein Symbol, das ein <emphasis>Verzeichnis repr&auml;sentiert.</emphasis></para>
</glossdef>
</glossentry>
<glossentry><glossterm>Palette</glossterm> 
<glossdef>
<para>Ein Spektrum grafisch angezeigter Wahlm&ouml;glichkeiten, wie beispielsweise
Farben oder Werkzeugsammlungen, die in einer Anwendung ausgew&auml;hlt werden
k&ouml;nnen.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Papierkorb</glossterm> 
<glossdef>
<para>Ein Container f&uuml;r gel&ouml;schte Dateien und Ordner.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Pfad</glossterm> 
<glossdef>
<para>Eine Textkette, die die hierarchische Stellung eines Ordners (Verzeichnisses)
angibt.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Pfeiltasten</glossterm> 
<glossdef>
<para>Die vier Richtungstasten auf einer Tastatur. Siehe auch <emphasis>Positioniertasten.</emphasis></para>
</glossdef>
</glossentry>
<glossentry><glossterm>Pixmap</glossterm> 
<glossdef>
<para>Ein Bild, das in einem Rasterformat gespeichert wurde. Normalerweise
bezieht sich der Begriff auf ein Bild, das mehr als zwei Farben besitzen kann.
Gegensatz zu <emphasis>Bitmap</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Positioniertasten</glossterm>
<glossdef>
<para>Die Tastaturtasten, die dazu verwendet werden, die aktuelle Position
des Cursors zu ver&auml;ndern. Sie enthalten die Pfeiltasten (mit oder ohne
Steuertaste), die Taste Tab (mit oder ohne Steuer- und Umschalttasten), die
Taste Pos1 oder Ende (mit oder ohne Steuertaste) und die Tasten zum Vorw&auml;rts-
und Zur&uuml;ckbl&auml;ttern.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Post</glossterm> 
<glossdef>
<para>Eine Anwendung, die es erm&ouml;glicht, Nachrichten der elektronischen
Post zu senden, zu erhalten und zu erstellen.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Post-Container</glossterm> 
<glossdef>
<para>Der elektronische Briefkasten und das Dateiablagesystem, das alle elektronischen
Nachrichten enth&auml;lt. Sobald sich eine Nachricht in einem Container befindet,
kann sie angezeigt, ver&auml;ndert, gedruckt, eingeschlossen, weitergeleitet
oder beantwortet werden.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Programm</glossterm> 
<glossdef>
<para>Eine Folge von Anweisungen, die ein Computer interpretiert und ausf&uuml;hrt.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Rahmen zur Gr&ouml;&szlig;e&auml;nderung</glossterm> 
<glossdef>
<para>Ein Bedienelement, das zum &Auml;ndern der Gr&ouml;&szlig;e eines Fensters
oder eines Teilfensters (eines Fensters) verwendet wird.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Rechner</glossterm>
<glossdef>
<para>Ein Computersystem.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Regler</glossterm> 
<glossdef>
<para>Ein Bedienelement, das eine Spur und einen Plattenzugriffsarm verwendet,
um einen Wert aus den verf&uuml;gbaren Werten einzustellen. Die Position des
Plattenzugriffsarms (oder eine separate Anzeige) zeigt den aktuell eingestellten
Wert an.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Ressource</glossterm> 
<glossdef>
<para>Ein Mechanismus des X Window System<superscript>TM</superscript>, um
das Attribut (Darstellung oder Verhalten) eines Fensters oder einer Anwendung
anzugeben. Ressourcen werden gew&ouml;hnlich nach den Elementen benannt, die
sie steuern.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Schablone</glossterm>
<glossdef>
<para>(In Post) Eine ASCII-Datei, die ein Benutzer erstellen kann, um h&auml;ufig
eingegebene Informationen, wie den Namen und die Adresse f&uuml;r die elektronische
Post, zweckm&auml;&szlig;ig in die elektronische Nachricht einzuschlie&szlig;en.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Schiebefeld</glossterm> 
<glossdef>
<para>Der Teil einer Bildlaufleiste, der die Position der sichtbaren Information
relativ zur gesamten Informationsmenge, die im Fenster verf&uuml;gbar ist,
anzeigt. Der Benutzer kann das Schiebefeld anklicken, um Informationen anzusehen,
die gerade nicht sichtbar sind.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Schieber</glossterm> 
<glossdef>
<para>Ein K&auml;stchen auf einem Separator oder einer Trennleiste, das es
dem Benutzer erm&ouml;glicht, die Gr&ouml;&szlig;e eines Teilfensters mit
Hilfe der Maus zu vergr&ouml;&szlig;ern oder zu verringern. Mit der Tastatur
kann ebenfalls auf dem Schieber positioniert werden.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Schlie&szlig;en</glossterm> 
<glossdef>
<para>Ein Men&uuml;element, das dazu verwendet wird, ein Fenster und alle
mit ihm verbundenen Zusatzfenster aus allen Arbeitsbereichen zu entfernen.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Schreiben</glossterm> 
<glossdef>
<para>Die Berechtigung zum &Auml;ndern der Inhalte einer Datei oder eines
Ordners.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Schriftart</glossterm>
<glossdef>
<para>Ein vollst&auml;ndiger Zeichensatz (Buchstaben, Ziffern und Sonderzeichen)
einer Gr&ouml;&szlig;e und einer Schrift. 10 Punkt Helvetica fett ist ein
Beispiel f&uuml;r eine Schriftart.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>schw&auml;cher dargestellt</glossterm> 
<glossdef>
<para>Verringerter Kontrast einer Taste, um anzuzeigen, da&szlig; sie nicht
verf&uuml;gbar ist.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Server</glossterm> 
<glossdef>
<para>Ein System, das einem Kunden Dienste anbietet.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Session</glossterm> 
<glossdef>
<para>Die zwischen <emphasis>Anmeldung</emphasis> und <emphasis>Abmeldung</emphasis> des Benutzers verstrichene Zeit. Ebenfalls eine besondere Konfiguration
von Arbeitsbereichen, die die Einstellungen des Umgebungsmanagers, offene
Anwendungen und die Gr&ouml;&szlig;e und Position von Objekten enth&auml;lt.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Session-Server</glossterm> 
<glossdef>
<para>Ein System, das Netzwerk-Sessions anbietet. Session-Dateien sind auf
dem Session-Server verf&uuml;gbar und werden verwendet, wenn sich der Benutzer
auf einem System im Netzwerk anmeldet.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Session-Steuerung</glossterm> 
<glossdef>
<para>Eine Anwendungs-Software, die das Speichern von Sessions, Wiederherstellen
von Sessions, Sperren und Entsperren des Bildschirms und die Verwendung von
Bildschirmschonern steuert. Wenn eine Session gespeichert wird, wird der Status
der Desktop-Umgebung (Position der Symbole, Gr&ouml;&szlig;e und Position
ge&ouml;ffneter Fenster, offener/geschlossener Status von Anwendungen, die
aktuelle Farbpalette etc.) erhalten, soda&szlig; sie bei der n&auml;chsten
Anmeldung wiederhergestellt werden kann.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Stammverzeichnis</glossterm> 
<glossdef>
<para>In einem hierarchischen Dateisystem das Verzeichnis, das alle anderen
Verzeichnisse und Dateien enth&auml;lt. Auf UNIX-Systemen wird es durch einen
/ (Schr&auml;gstrich) dargestellt.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Standard</glossterm> 
<glossdef>
<para>Ein Wert, der automatisch von der Anwendung eingestellt wird.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Statusbereich</glossterm> 
<glossdef>
<para>Der Teil eines Fensters, in dem Informationen &uuml;ber den Status eines
Objekts oder den Status einer bestimmten Objektansicht angezeigt werden.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Stichwortverzeichnis</glossterm> 
<glossdef>
<para>In einem Hilfeband kann eine alphabetische Liste von W&ouml;rtern oder
Phrasen durchsucht werden, um Hilfe zu einem Thema zu durchsuchen. Das Hilfesystem
zeigt das Stichwortverzeichnis an, wenn die Taste 'Index' in einem Dialogfenster
der Hilfetaste gew&auml;hlt wird.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Superuser</glossterm> 
<glossdef>
<para>Eine Login-ID, die besondere Berechtigungen zum &Auml;ndern von Systemdateien
bereitstellt, zu deren &Auml;nderung die meisten Benutzer nicht die Berechtigung
besitzen. Der Superuser wird auch 'Benutzer root' genannt, da die Benutzer-ID
von Superusern <command>root</command> ist. Auf den meisten Computersystemen
verf&uuml;gen nur wenige Benutzer &uuml;ber die Berechtigung, Superuser zu
sein.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Symbol</glossterm> 
<glossdef>
<para>Die grafische Darstellung eines Objektes, bestehend aus einem Bild,
einem Bildhintergrund und einer Bezeichnung. Ein Symbol kann direkt bearbeitet
werden.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Symboleditor</glossterm> 
<glossdef>
<para>Die Anwendungs-Software, die dazu verwendet wird, neue Symbole zu erstellen
und vorhandene Symbole zu ver&auml;ndern.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Symbolgr&ouml;&szlig;e</glossterm> 
<glossdef>
<para>Ein Fenster als Symbol darstellen. Die Taste, die ein Fenster als Symbol
darstellt, ist in der oberen rechten Ecke des Fensterrahmens positioniert.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>symbolischer Verweis</glossterm> 
<glossdef>
<para>Ein Verweistyp, der in der Lage ist, auf eine Datei oder ein Verzeichnis
zu zeigen, die/das sich auf einer anderen physischen Speichereinheit oder
Partition befindet.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Taschenrechner</glossterm> 
<glossdef>
<para>Eine Anwendungs-Software, die die Funktion eines Taschenrechners nachahmt.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Taste 'Exit'</glossterm> 
<glossdef>
<para>Ein Bedienelement im Bedienfeld, das zum Abmelden vom Desktop verwendet
wird.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Taste</glossterm> 
<glossdef>
<para>Ein generischer Begriff f&uuml;r ein Bedienelement eines Fensters. Ein
Bedienelement, das sofort eine Aktion durch eine Anwendung startet. Normalerweise
f&uuml;hrt sie einen Befehl (wie 'Anwenden') aus und zeigt ein Fenster oder
ein Men&uuml; an.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Taste f&uuml;r maximale Gr&ouml;&szlig;e</glossterm> 
<glossdef>
<para>Eine Taste auf der Titelleiste eines Fensters, die ausgew&auml;hlt wird,
um das Fenster in seiner maximalen Gr&ouml;&szlig;e anzuzeigen.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Taste f&uuml;r Symbolgr&ouml;&szlig;e</glossterm> 
<glossdef>
<para>Eine Taste auf der Titelleiste eines Fensters, die gew&auml;hlt wird,
um ein Fenster als Symbol anzuzeigen.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Taste zum Sperren des Bildschirms</glossterm>
<glossdef>
<para>Ein Bedienelement des Bedienfeldes, das zum Sperren des Bildschirms
verwendet wird.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Terminal</glossterm> 
<glossdef>
<para>(Im Bedienfeld) Ein Element der Bedientafel 'Pers&ouml;nliche Anwendungen',
das verwendet wird, um ein Terminal-Fenster zu &ouml;ffnen.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Terminal-Emulator</glossterm> 
<glossdef>
<para>Ein Fenster, das eine besondere Art von Terminal emuliert, um Anwendungen,
die nicht in Fenstern ausgef&uuml;hrt werden, auszuf&uuml;hren. Emulierte
Terminal-Fenster werden haupts&auml;chlich dazu verwendet, um Befehle einzugeben,
&uuml;ber die mit dem Betriebsystem des Computers interagiert werden kann.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Termineditor</glossterm> 
<glossdef>
<para>(In Kalender) Ein Fenster zum Planen, &Auml;ndern oder L&ouml;schen
eines Termins.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Terminliste</glossterm> 
<glossdef>
<para>Eine chronologische Terminliste, die in Kalender angezeigt wird.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Text-Cursor</glossterm> 
<glossdef>
<para>Ein Cursor, der die Einf&uuml;gemarke f&uuml;r Texteingabe anzeigt.
Dieser Cursor wird normalerweise in Form eines I-Balkens dargestellt. Gegensatz
zu <emphasis>Cursor f&uuml;r Tastatureingabe</emphasis> und <emphasis>Zeiger</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Texteditor</glossterm> 
<glossdef>
<para>Die Anwendungs-Software, die zum Erstellen und Bearbeiten von Dokumenten
verwendet wird.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Textfeld</glossterm> 
<glossdef>
<para>Ein rechteckiger Bereich in einem Fenster, in dem Informationen eingegeben
werden. Textfelder mit Tastaturfokus besitzen einen blinkenden Texteingabe-Cursor.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Themenliste</glossterm> 
<glossdef>
<para>(In einem allgemeinen Hilfedialogfenster) Eine erweiter- und verk&uuml;rzbare
Themenliste, die ausgew&auml;hlt werden kann, um Hilfeinformationen anzuzeigen.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Titelleiste</glossterm> 
<glossdef>
<para>Der oberste Bereich eines Fensters, der die Fensterzeile, Fenstermen&uuml;taste
und die Tasten f&uuml;r maximale Gr&ouml;&szlig;e und Symbolgr&ouml;&szlig;e
enth&auml;lt. Siehe auch <emphasis>Fensterleiste.</emphasis></para>
</glossdef>
</glossentry>
<glossentry><glossterm>&Uuml;bergabebereich</glossterm> 
<glossdef>
<para>Ein Bereich innerhalb des Arbeitsbereichs, einschlie&szlig;lich der
Bedienelemente des Bedienfeldes f&uuml;r Papierkorb, Druckmanager und Post,
der ein &uuml;bergebenes Symbol akzeptiert. Symbole k&ouml;nnen in den Arbeitsbereich
&uuml;bergeben werden, damit der Benutzer einen schnellen Zugriff auf sie
hat.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>&Uuml;bergabeziel</glossterm> 
<glossdef>
<para>Eine rechteckige Grafik, die den &Uuml;bergabebereich in einer Anwendung
repr&auml;sentiert.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>&uuml;bergeben</glossterm> 
<glossdef>
<para>Der Vorgang des Freigebens der Maustaste, nachdem mit dem Ziehen eines
Objekts begonnen wurde. Falls das Objekt in einen entsprechenden Bereich &uuml;bergeben
wurde, wird eine Aktion gestartet.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>&uuml;bergeordneter Ordner</glossterm> 
<glossdef>
<para>Ein Ordner, der Unterordner und Dateien enth&auml;lt. Wird &uuml;ber
Aktivit&auml;ten auf der Befehlszeile gesprochen, kann er auch als <emphasis>&uuml;bergeordnetes Verzeichnis</emphasis> bezeichnet werden.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>&uuml;bergeordnetes Verzeichnis</glossterm> 
<glossdef>
<para>Ein Verzeichnis, das Unterverzeichnisse und Dateien enth&auml;lt. In
grafischen Benutzerschnittstellenanwendungen kann es auch als <emphasis>&uuml;bergeordneter
Ordner</emphasis> bezeichnet werden.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>&uuml;berschreiben</glossterm> 
<glossdef>
<para>Ersetzen.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Uhr</glossterm> 
<glossdef>
<para>Ein Bedienelement des Bedienfeldes, das die Ortszeit anzeigt.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Umgebungsmanager</glossterm> 
<glossdef>
<para>Die Anwendungs-Software, die dazu verwendet wird, einige der optischen
Elemente und des Systemger&auml;tverhaltens der Arbeitsbereichsumgebung anzupassen,
einschlie&szlig;lich der Farben und Schriftarten und dem Verhalten von Tastatur,
Maus, Fenster und Session-Startproze&szlig;.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Umgebungsvariablen</glossterm> 
<glossdef>
<para>UNIX-Standardvariablen, die von der Shell und den Anwendungen verwendet
werden.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>umschalten</glossterm> 
<glossdef>
<para>Den Zustand eines Bedienelements mit zwei Zust&auml;nden (beispielsweise
Wechselschalter oder Markierungsfeld) entweder mit Hilfe der Maus oder der
Tastatur &auml;ndern.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Umschlag</glossterm> 
<glossdef>
<para>(In Post) Die grundlegende Information &uuml;ber eine elektronische
Nachricht, die im Briefkasten angezeigt wird. Ein Umschlag zeigt den Namen
des Senders, das Thema, das Datum und die Zeit, zu der es empfangen wurde,
und die Gr&ouml;&szlig;e der Nachricht an.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Untermen&uuml;</glossterm> 
<glossdef>
<para>Ein Men&uuml;, das durch Ausw&auml;hlen eines Men&uuml;elements angezeigt
wird.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Unterordner</glossterm> 
<glossdef>
<para>Ein Ordner, der in einem anderen Ordner (&uuml;bergeordneter Ordner)
enthalten ist. Wenn Aktivit&auml;ten auf der Befehlszeile behandelt werden,
kann er auch <emphasis>Unterordner</emphasis> genannt werden.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Unterverzeichnis</glossterm> 
<glossdef>
<para>Ein Verzeichnis, das in einem anderen Verzeichnis (&uuml;bergeordnetes
Verzeichnis) enthalten ist. In grafischen Benutzerschnittstellenanwendungen
wird es manchmal auch <emphasis>Unterordner</emphasis> genannt.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Verschieben</glossterm> 
<glossdef>
<para>Eine Auswahl des Fenstermen&uuml;s, die verwendet wird, um ein Fenster
auf eine andere Position auf dem Bildschirm zu stellen.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Verweis</glossterm>
<glossdef>
<para>Synonym f&uuml;r <emphasis>symbolischer Verweis</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Verzeichnis</glossterm>
<glossdef>
<para>Eine Sammlung von Dateien oder Unterordnern. In grafischen Benutzerschnittstellenanwendungen
kann es Ordner genannt werden.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Vordergrund</glossterm> 
<glossdef>
<para>Der Inhalt eines Fensters und die Farbe oder Schattierung, die verwendet
werden, um ihn vom Fensterhintergrund zu unterscheiden.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>w&auml;hlen</glossterm>
<glossdef>
<para>Die Maus oder Tastatur dazu verwenden, ein Men&uuml;element, eine Taste
oder ein Symbol auszuw&auml;hlen, das/die einen Befehl oder eine Aktion startet.
Gegensatz zu <emphasis>ausw&auml;hlen.</emphasis></para>
</glossdef>
</glossentry>
<glossentry><glossterm>Warteschlange</glossterm> 
<glossdef>
<para>Eine geordnete Liste von Jobs, die darauf warten, ausgef&uuml;hrt zu
werden.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Wechselschalter</glossterm> 
<glossdef>
<para>Ein exklusives Bedienelement, dessen Einstellung durch die Anwesenheit
oder Abwesenheit einer grafischen Anzeige angezeigt werden. Normalerweise
ist er Teil einer Gruppe von Wechselschaltern. Ein Wechselschalter besitzt
zwei Zust&auml;nde, ein und aus.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>zeigen</glossterm> 
<glossdef>
<para>Eine Maus so lange bewegen, bis sich der Zeiger auf einem besonderen
Bildschirmelement oder -bereich befindet.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Zeiger</glossterm> 
<glossdef>
<para>Ein Cursor, der den Bereich zeigt, der von einer Zeigereinheit Eingabe
empf&auml;ngt. Der Zeiger kann als Pfeil, I-Balken, Kreuz oder andere Grafik
dargestellt werden. Siehe auch <structname role="typedef">Cursor</structname>.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Zeilenumbruch</glossterm>
<glossdef>
<para>1) Post: Fenster 'Erstellen einer Nachricht': Men&uuml; 'Format': Wird
benutzt, um zu veranlassen, da&szlig; der Text, den Sie im Fenster 'Erstellen
einer Nachricht' eingeben, automatisch in die n&auml;chste Zeile umgebrochen
wird, ohne da&szlig; die Eingabetaste gedr&uuml;ckt werden mu&szlig;.</para>
<para>2) Post: Dialogfenster 'Drucken': Wird verwendet, um das Abschneiden
von Zeilen zu verhindern, die zu lang sind, um auf eine gedruckte Seite zu
passen.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Zeilenvorschubzeichen</glossterm> 
<glossdef>
<para>Ein nicht sichtbares Zeichen, das das Ende einer Textzeile in einem
Dokument markiert. Dadurch erkennt ein Drucker oder ein Bildschirm, da&szlig;
eine Zeile umzubrechen und eine neue zu beginnen ist.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ziehen</glossterm> 
<glossdef>
<para>Eine beliebige Maustaste dr&uuml;cken und halten, w&auml;hrend der Zeiger
- und das Objekt unter dem Zeiger - auf dem Bildschirm verschoben werden.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ziehen und &uuml;bergeben</glossterm> 
<glossdef>
<para>Ein Symbol direkt manipulieren, indem ein Zeigeger&auml;t dazu verwendet
wird, das Symbol zu verschieben und an anderer Stelle zu positionieren.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Zugriffsberechtigungen</glossterm> 
<glossdef>
<para>Die einem Benutzer oder einer Benutzergruppe zugestandenen Berechtigungen,
verschiedene Operationen auf eine Datei oder einen Ordner (ein Verzeichnis)
anzuwenden. Siehe <emphasis>Berechtigung</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Zugriffsrecht</glossterm> 
<glossdef>
<para>Eine Einstellung, die festlegt, &uuml;ber welche Art von Zugriff ein
Benutzer oder eine Gruppe von Benutzern auf eine Datei oder einen Ordner (ein
Verzeichnis) verf&uuml;gt.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Zuordnung</glossterm> 
<glossdef>
<para>Die Methode, eine Aktion zum Ausf&uuml;hren einer anderen Aktion zu
verwenden. Auch das paarweise Anordnen von Objekten einer Menge mit denen
einer anderen Menge.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Zur&uuml;ck</glossterm> 
<glossdef>
<para>(Im Hilfemanager) Eine Taste und ein Element des Men&uuml;s 'Navigation',
das verwendet wird, um Hyperlinks r&uuml;ckw&auml;rts, in der umgekehrten
Reihenfolge ihrer Ausf&uuml;hrung, zu folgen.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Zur&uuml;cksetzen</glossterm> 
<glossdef>
<para>Eine Taste oder ein Men&uuml;element, die/das dazu verwendet wird, ein
Element in den Zustand zur&uuml;ckzuversetzen, in dem es zuletzt ge&ouml;ffnet
wurde, oder in den Zustand, in dem es sich befand, bevor die zuletzt vorgenommenen
Ver&auml;nderungen darauf angewendet wurden (abh&auml;ngig davon, was als
letztes ausgef&uuml;hrt wurde).</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Zwischenablage</glossterm> 
<glossdef>
<para>Ein Puffer, der zeitweilig die letzten ausgeschnittenen, kopierten oder
eingef&uuml;gten Daten speichert.</para>
</glossdef>
</glossentry>
</glossary>
<!--fickle 1.14 mif-to-docbook 1.7 01/02/96 14:12:09-->
<?Pub *0000094474>
