<!-- $XConsortium: ch01.sgm /main/3 1996/12/20 20:07:51 rws $ -->
<!-- (c) Copyright 1996 Digital Equipment Corporation. -->
<!-- (c) Copyright 1996 Hewlett-Packard Company. -->
<!-- (c) Copyright 1996 International Business Machines Corp. -->
<!-- (c) Copyright 1996 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1996 Novell, Inc. -->
<!-- (c) Copyright 1996 FUJITSU LIMITED. -->
<!-- (c) Copyright 1996 Hitachi. -->
<chapter id="INFOUG.Gstart.div.1">
<title id="INFOUG.Gstart.mkr.1">Informaci&oacute;n b&aacute;sica</title>
<para>Common Desktop Environment contiene un juego est&aacute;ndar de documentaci&oacute;n
en l&iacute;nea que abarca los componentes de CDE y Motif. El escritorio CDE
incluye Gestor de informaci&oacute;n que permite obtener acceso, leer y buscar
en la documentaci&oacute;n en l&iacute;nea. Tambi&eacute;n permite obtener
acceso a documentaci&oacute;n en l&iacute;nea suministrada por otras aplicaciones
instaladas en el escritorio.</para>
<para>En el resto de este cap&iacute;tulo se describe:</para>
<itemizedlist>
<listitem><para><xref linkend="INFOUG.Gstart.div.2"></para>
</listitem>
<listitem><para><xref linkend="INFOUG.Gstart.div.3"></para>
</listitem>
<listitem><para><xref linkend="INFOUG.Gstart.div.6"></para>
</listitem>
<listitem><para><xref linkend="INFOUG.Gstart.div.10"></para>
</listitem>
</itemizedlist>
<sect1 id="INFOUG.Gstart.div.2">
<title id="INFOUG.Gstart.mkr.2">Organizaci&oacute;n de la informaci&oacute;n<indexterm>
<primary>bibliotecas de informaci&oacute;n</primary><secondary>organizaci&oacute;n</secondary></indexterm></title>
<para>Cuando Gestor de informaci&oacute;n se encuentra en la pantalla, se
ver&aacute; una <firstterm>biblioteca de informaci&oacute;n</firstterm> (tambi&eacute;n
llamada "infolib"). Las bibliotecas de informaci&oacute;n est&aacute;n divididas
en uno o varios <firstterm>estantes para libros</firstterm>. Cada estante
para libros cuenta con uno o varios <firstterm>libros</firstterm> que contienen
la mayor&iacute;a de elementos que contienen los libros impresos.</para>
<para>Al igual que un libro impreso, un libro en l&iacute;nea cuenta con <firstterm>
secciones</firstterm> que contienen principalmente texto pero tambi&eacute;n
pueden incluir gr&aacute;ficos y tablas. La lista de libros muestra todas
sus secciones.</para>
<note>
<para>El sistema puede contar con varias bibliotecas de informaci&oacute;n.
</para>
</note>
<para>La figura a continuaci&oacute;n muestra la estructura de una biblioteca
de informaci&oacute;n.</para>
<figure>
<title id="InfoUGD.Gstart.infolib1">Biblioteca de informaci&oacute;n</title>
<graphic id="INFOUG.Gstart.igrph.1" entityref="INFOUG.Gstart.fig.1"></graphic>
</figure>
</sect1>
<sect1 id="INFOUG.Gstart.div.3">
<title id="INFOUG.Gstart.mkr.3">Activaci&oacute;n del Gestor de informaci&oacute;n<indexterm>
<primary>Gestor de informaci&oacute;n</primary><secondary>activaci&oacute;n</secondary></indexterm></title>
<para>Podr&aacute; activar el Gestor de informaci&oacute;n:</para>
<itemizedlist>
<listitem><para>Haciendo clic en el control Gestor de informaci&oacute;n del
Panel frontal.</para>
<sidebar>
<graphic id="INFOUG.Gstart.igrph.2" entityref="INFOUG.Gstart.fig.2"></graphic>
</sidebar>
</listitem>
<listitem><para>Haciendo clic en el icono Gestor de informaci&oacute;n del
subpanel Gestor de informaci&oacute;n.</para>
<sidebar>
<graphic id="INFOUG.Gstart.igrph.3" entityref="INFOUG.Gstart.fig.3"></graphic>
</sidebar>
</listitem>
<listitem><para>Arrastrando y soltando el icono Biblioteca de informaci&oacute;n
(que aparece en la ventana Gestor de archivos) en el control Gestor de informaci&oacute;n
del Panel frontal.</para>
<sidebar>
<graphic id="INFOUG.Gstart.igrph.4" entityref="INFOUG.Gstart.fig.4"></graphic>
</sidebar>
</listitem>
<listitem><para>Introduciendo el comando <command>dtinfo</command> desde la
ventana Terminal.</para>
</listitem>
</itemizedlist>
<para>Al activarse, Gestor de informaci&oacute;n pone en pantalla la ventana
Lista de libros que muestra las bibliotecas de informaci&oacute;n disponibles,
como lo indica la ilustraci&oacute;n a continuaci&oacute;n.</para>
<figure>
<title id="InfoUGD.Gstart.booklist1">Ventana Lista de libros</title>
<graphic id="INFOUG.Gstart.igrph.5" entityref="INFOUG.Gstart.fig.5"></graphic>
</figure>
<para>El contenido de las bibliotecas de informaci&oacute;n est&aacute; clasificado
de forma jer&aacute;rquica para trasladarse desde conjuntos de informaci&oacute;n
grandes a peque&ntilde;os. La jerarqu&iacute;a consta de estantes para libros,
libros, cap&iacute;tulos y secciones.</para>
<itemizedlist>
<listitem><para>Para abrir un elemento de la jerarqu&iacute;a, haga clic en
la flecha hacia la derecha que se encuentra al lado del mismo. Gestor de informaci&oacute;n
ampliar&aacute; el elemento para mostrar su contenido.</para>
</listitem>
<listitem><para>Para cerrar un elemento (cap&iacute;tulo, libro o estantes
para libros), haga clic en la flecha hacia abajo que se encuentra al lado
del mismo. Gestor de informaci&oacute;n colapsar&aacute; el elemento y quitar&aacute;
su contenido de la pantalla.</para>
</listitem>
<listitem><para>Para examinar una secci&oacute;n de un libro, seleccione el
nombre de la secci&oacute;n y haga clic en Ver (representado por el binocular)
o simplemente haga doble clic en el nombre de la secci&oacute;n. Gestor de
informaci&oacute;n abrir&aacute; la ventana de lectura en la que aparecer&aacute;
el contenido de la secci&oacute;n seleccionada. La figura a continuaci&oacute;n
muestra c&oacute;mo aparece el texto en la ventana de lectura.</para>
</listitem>
</itemizedlist>
<figure>
<title id="InfoUGD.Gstart.readwin1">Ventana de lectura</title>
<graphic id="INFOUG.Gstart.igrph.6" entityref="INFOUG.Gstart.fig.6"></graphic>
</figure>
<para>Una vez que la secci&oacute;n seleccionada est&eacute; en pantalla,
podr&aacute; hacer clic en los botones para examinar Secci&oacute;n anterior
y Pr&oacute;xima secci&oacute;n de la barra de herramientas para trasladarse
a secciones siguientes o anteriores.</para>
<graphic id="INFOUG.Gstart.igrph.7" entityref="INFOUG.Gstart.fig.7"></graphic>
<para>Haciendo clic en enlaces de hipertexto (que aparecen en negrita y subrayados)
podr&aacute; trasladarse a otras ubicaciones del libro.</para>
<note>
<para>Podr&aacute; mantener las ventanas de lista de libros y de lectura abiertas
para obtener acceso f&aacute;cilmente mientras trabaja. Tambi&eacute;n podr&aacute;
minimizarlas.</para>
</note>
<sect2 id="INFOUG.Gstart.div.4">
<title id="INFOUG.Gstart.mkr.4">C&oacute;mo abrir una biblioteca de informaci&oacute;n<indexterm>
<primary>Gestor de informaci&oacute;n</primary><secondary>comenzar con una
biblioteca de informaci&oacute;n espec&iacute;fica</secondary></indexterm><indexterm>
<primary>Biblioteca de informaci&oacute;n</primary><secondary>abrir</secondary>
</indexterm></title>
<para>Al activarse, Gestor de informaci&oacute;n abre una o varias bibliotecas
de informaci&oacute;n. Si el conjunto de bibliotecas de informaci&oacute;n
predeterminado no contiene la deseada, puede hacer que la active y abra efectuando
las siguientes operaciones:</para>
<itemizedlist>
<listitem><para>Arrastrando el icono de la biblioteca de informaci&oacute;n
desde la ventana de Gestor de archivos al control de Gestor de informaci&oacute;n
del panel frontal.</para>
</listitem>
<listitem><para>Haciendo doble clic en el icono de la biblioteca.</para>
</listitem>
<listitem><para>Introduciendo el comando <command>dtinfo</command> en la ventana
Terminal y especificando la ruta de la biblioteca para la opci&oacute;n <literal>-l</literal>.</para>
</listitem>
</itemizedlist>
<para>Si Gestor de informaci&oacute;n ya est&aacute; ejecut&aacute;ndose,
podr&aacute; cargar la biblioteca de informaci&oacute;n arrastrando su icono
a la ventana de la lista de libros o lectura. Tambi&eacute;n podr&aacute;
cargar la biblioteca de informaci&oacute;n haciendo clic en el bot&oacute;n
A&ntilde;adir biblioteca de informaci&oacute;n o seleccionando la opci&oacute;n
A&ntilde;adir del men&uacute; Editar de Lista de libros.</para>
</sect2>
</sect1>
<sect1 id="INFOUG.Gstart.div.5">
<title id="INFOUG.Gstart.mkr.5">C&oacute;mo salir de Gestor de informaci&oacute;n<indexterm>
<primary>Gestor de informaci&oacute;n</primary><secondary>salir</secondary>
</indexterm></title>
<para>Para salir de Gestor de informaci&oacute;n:</para>
<itemizedlist>
<listitem><para>En la ventana de lista de libros, seleccione la opci&oacute;n
Salir del men&uacute; Archivo.</para>
</listitem>
<listitem><para>En la ventana de lectura, seleccione Salir del men&uacute;
Examinador.</para>
</listitem>
</itemizedlist>
<para>Tambi&eacute;n podr&aacute; salir desde estas ventanas haciendo doble
clic en el bot&oacute;n del men&uacute; Ventana que se encuentra en la esquina
superior izquierda.</para>
</sect1>
<sect1 id="INFOUG.Gstart.div.6">
<title id="INFOUG.Gstart.mkr.6">Obtenci&oacute;n de ayuda<indexterm><primary>Gestor de informaci&oacute;n</primary><secondary>ayuda</secondary></indexterm><indexterm>
<primary>ayuda</primary></indexterm></title>
<para>Podr&aacute; solicitar ayuda:<indexterm><primary>selecci&oacute;n</primary>
<secondary>ayuda</secondary></indexterm></para>
<itemizedlist remap="Bullet1">
<listitem><para>Presionando F1 o la tecla Ayuda<indexterm><primary>tecla F1</primary></indexterm><indexterm><primary>tecla de Ayuda</primary></indexterm></para>
</listitem>
<listitem><para>Seleccionando una opci&oacute;n del men&uacute; Ayuda de Gestor
de informaci&oacute;n</para>
</listitem>
<listitem><para>Haciendo clic en el bot&oacute;n Ayuda de un cuadro de di&aacute;logo
</para>
</listitem>
</itemizedlist>
<para>La manera m&aacute;s r&aacute;pida y f&aacute;cil de obtener ayuda es
presionar la tecla F1. Cuando se presiona F1, el Gestor de informaci&oacute;n
pone en pantalla el tema de ayuda correspondiente a la operaci&oacute;n efectuada.
</para>
<para>Algunos teclados cuentan con una tecla de ayuda especial que reemplaza
la tecla F1.</para>
<sect2 id="INFOUG.Gstart.div.7">
<title id="INFOUG.Gstart.mkr.7">Men&uacute; Ayuda<indexterm><primary>men&uacute;
Ayuda</primary></indexterm></title>
<para>Gestor de informaci&oacute;n cuenta con el men&uacute; Ayuda que se
utiliza para solicitar tipos de ayuda espec&iacute;ficos.</para>
<sidebar>
<para><graphic id="INFOUG.Gstart.igrph.8" entityref="INFOUG.Gstart.fig.8"></graphic></para>
</sidebar>
<informaltable>
<tgroup cols="2" colsep="0" rowsep="0">
<colspec align="left" colwidth="138*">
<colspec align="left" colwidth="390*">
<tbody>
<row>
<entry align="left" valign="top"><para>Descripci&oacute;n general</para></entry>
<entry align="left" valign="top"><para>Pone en pantalla informaci&oacute;n
b&aacute;sica acerca de funciones de Gestor de informaci&oacute;n</para></entry>
</row>
<row>
<entry align="left" valign="top"><para>Tareas</para></entry>
<entry align="left" valign="top"><para>Muestra instrucciones correspondientes
a la utilizaci&oacute;n de Gestor de informaci&oacute;n</para></entry></row>
<row>
<entry align="left" valign="top"><para>Referencia</para></entry>
<entry align="left" valign="top"><para>Pone en pantalla informaci&oacute;n
resumida acerca de componentes de Gestor de informaci&oacute;n</para></entry>
</row>
<row>
<entry align="left" valign="top"><para>Sobre el tema</para></entry>
<entry align="left" valign="top"><para>Cambia el puntero por un signo de interrogaci&oacute;n.
Haga clic con el puntero en forma de signo de interrogaci&oacute;n sobre un
elemento para ver la descripci&oacute;n correspondiente<indexterm><primary>puntero en forma de signo de interrograci&oacute;n</primary></indexterm></para></entry>
</row>
<row>
<entry align="left" valign="top"><para>Uso de la ayuda</para></entry>
<entry align="left" valign="top"><para>Muestra informaci&oacute;n acerca de
la utilizaci&oacute;n de la ayuda</para></entry></row>
<row>
<entry align="left" valign="top"><para>Acerca de Gestor de informaci&oacute;n
</para></entry>
<entry align="left" valign="top"><para>Muestra la versi&oacute;n e informaci&oacute;n
acerca de derechos de copia de Gestor de informaci&oacute;n</para></entry>
</row></tbody></tgroup><?Pub Caret1></informaltable>
</sect2>
<sect2 id="INFOUG.Gstart.div.8">
<title id="INFOUG.Gstart.mkr.8">Mensajes QuickInfo<indexterm><primary>mensaje
QuickInfo</primary></indexterm></title>
<indexterm><primary>mensajes</primary><secondary>QuickInfo</secondary></indexterm>
<para>Los mensajes QuickInfo son descripciones breves de elementos de ventana.
A medida que se mueve el puntero sobre un elemento de ventana, aparecen los
mensajes QuickInfo correspondientes en el &aacute;rea de mensajes. El mensaje
describe el elemento y su utilizaci&oacute;n. Por ejemplo, si coloca el puntero
en el bot&oacute;n Secci&oacute;n anterior (flecha hacia arriba) de la barra
de herramientas de la ventana de lectura, aparecer&aacute; el siguiente mensaje
en el &aacute;rea de mensajes:</para>
<para><computeroutput>Ir a la secci&oacute;n anterior del documento</computeroutput></para>
</sect2>
<sect2 id="INFOUG.Gstart.div.9">
<title id="INFOUG.Gstart.mkr.9">Utilizaci&oacute;n de ventanas de ayuda<indexterm>
<primary>ventanas</primary><secondary>Ayuda</secondary></indexterm><indexterm>
<primary>Ayuda</primary><secondary>ventanas</secondary></indexterm></title>
<para>Al obtener acceso a la ayuda, Gestor de informaci&oacute;n pone en pantalla
una ventana que contiene el texto de la ayuda solicitada. Para obtener informaci&oacute;n
adicional acerca de una tarea descrita, haga clic en el bot&oacute;n M&aacute;s...
Para obtener ayuda acerca de la utilizaci&oacute;n de la ayuda, haga clic
en el bot&oacute;n Ayuda. Para cerrar la ventana Ayuda, haga clic en el bot&oacute;n
Cerrar.</para>
</sect2>
</sect1>
<sect1 id="INFOUG.Gstart.div.10">
<title id="INFOUG.Gstart.mkr.10">Utilizaci&oacute;n de atajos de teclado<indexterm>
<primary>teclado</primary><secondary>atajos</secondary></indexterm></title>
<para>El foco del teclado utiliza el realce para indicar el elemento de ventana,
men&uacute; o control que responder&aacute; al comando o datos introducidos.
Para activar el elemento de men&uacute; o control (como por ejemplo un bot&oacute;n
) seleccionado, presione la barra espaciadora.</para>
<para>Puede ser &uacute;til presionar F10 para colocar el foco en la barra
de men&uacute;s. De esta manera se puede navegar a trav&eacute;s de men&uacute;s
mediante las teclas de flecha o presionando la primera letra del nombre del
men&uacute;.</para>
</sect1>
</chapter>
<?Pub *0000032180>
