<!-- $XConsortium: ch02.sgm /main/2 1996/12/20 19:29:57 rws $ -->
<!-- (c) Copyright 1996 Digital Equipment Corporation. -->
<!-- (c) Copyright 1996 Hewlett-Packard Company. -->
<!-- (c) Copyright 1996 International Business Machines Corp. -->
<!-- (c) Copyright 1996 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1996 Novell, Inc. -->
<!-- (c) Copyright 1996 FUJITSU LIMITED. -->
<!-- (c) Copyright 1996 Hitachi. -->
<chapter id="INFOUG.Rdbooks.div.1">
<title id="INFOUG.Rdbooks.mkr.1">Lectura de libros</title>
<para>Podr&aacute; trasladarse a trav&eacute;s de una biblioteca de informaci&oacute;n
de varias maneras. La forma de comenzar m&aacute;s sencilla es considerar
una biblioteca de informaci&oacute;n como un conjunto de libros en l&iacute;nea
que poseen caracter&iacute;sticas similares a los impresos. Por ejemplo, los
libros en l&iacute;nea est&aacute;n organizados en cap&iacute;tulos y secciones
y cuentan con tablas de contenido. Tambi&eacute;n cuentan con elementos como
enlaces de hipertexto que no existen en libros impresos.</para>
<para>En este cap&iacute;tulo se describen las operaciones b&aacute;sicas
para leer libros y se explica c&oacute;mo:</para>
<itemizedlist>
<listitem><para><xref role="JumpText" linkend="INFOUG.Rdbooks.div.2"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Rdbooks.div.8"></para>
</listitem>
</itemizedlist>
<sect1 id="INFOUG.Rdbooks.div.2">
<title id="INFOUG.Rdbooks.mkr.2">Utilizaci&oacute;n de Gestor de informaci&oacute;n<indexterm>
<primary>ventanas</primary><secondary>utilizaci&oacute;n</secondary></indexterm></title>
<para>Cuando se activa Gestor de informaci&oacute;n, pone en pantalla la ventana
de lista de libros que contiene las bibliotecas de informaci&oacute;n del
sistema. Dicha ventana permite obtener acceso de forma tradicional a informaci&oacute;n
que se desea leer en Gestor de informaci&oacute;n. Desde la lista de libros
podr&aacute; abrir ventanas de lectura que mostrar&aacute;n el contenido de
libros de bibliotecas de informaci&oacute;n. Para verificar la ubicaci&oacute;n
del libro donde se encuentra, podr&aacute; configurar la lista de libros para
que efect&uacute;e un seguimiento de la ubicaci&oacute;n. Desde la lista de
libros tambi&eacute;n podr&aacute; imprimir secciones de libros.</para>
<para>La figura a continuaci&oacute;n muestra la ventana Lista de libros de
Gestor de informaci&oacute;n.</para>
<figure>
<title id="InfoUGD.Gstart.booklist2">Ventana Lista de libros</title>
<graphic id="INFOUG.Rdbooks.igrph.1" entityref="INFOUG.Rdbooks.fig.1"></graphic>
</figure>
<para>Al hacer doble clic en el t&iacute;tulo de la secci&oacute;n que desea
leer, Gestor de informaci&oacute;n abrir&aacute; una ventana que mostrar&aacute;
el texto de la secci&oacute;n seleccionada. En la ventana de lectura podr&aacute;
leer texto y obtener acceso a todas las dem&aacute;s funciones de Gestor de
informaci&oacute;n. Podr&aacute; ver texto y gr&aacute;ficos, imprimir, buscar
y utilizar marcas de libros y notas, configurar preferencias y obtener ayuda.
</para>
<para>La figura a continuaci&oacute;n muestra la ventana de lectura de Gestor
de informaci&oacute;n.</para>
<figure>
<title id="InfoUGD.Rdbooks.readwin2">Ventana de lectura</title>
<graphic id="INFOUG.Rdbooks.igrph.2" entityref="INFOUG.Rdbooks.fig.2"></graphic>
</figure>
<para>La mayor&iacute;a de las funciones de las ventanas de Gestor de informaci&oacute;n
son iguales a las de otras ventanas de CDE. Las secciones a continuaci&oacute;n
contienen consejos para utilizar ventanas de Gestor de informaci&oacute;n:
</para>
<itemizedlist>
<listitem><para><xref role="JumpText" linkend="INFOUG.Rdbooks.mkr.3"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Rdbooks.mkr.4"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Rdbooks.mkr.5"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Rdbooks.mkr.6"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Rdbooks.mkr.7"></para>
</listitem>
</itemizedlist>
<sect2 id="INFOUG.Rdbooks.div.3">
<title id="INFOUG.Rdbooks.mkr.3">Configuraci&oacute;n de la lista de libros
para efectuar el seguimiento<indexterm><primary>lista de libros</primary>
<secondary>configuraci&oacute;n para el seguimiento</secondary></indexterm><indexterm>
<primary>ventanas</primary><secondary>configuraci&oacute;n de la lista de
libros para efectuar el seguimiento</secondary></indexterm></title>
<para>Para verificar r&aacute;pidamente en qu&eacute; lugar de la jerarqu&iacute;a
de la biblioteca de informaci&oacute;n se encuentra, podr&aacute; configurar
la lista de libros para que indique dicha posici&oacute;n autom&aacute;ticamente.
</para>
<para>Cuando el seguimiento autom&aacute;tico est&aacute; activado, aparecer&aacute;
un icono en forma de dedo en la lista de libros que apuntar&aacute; hacia
el t&iacute;tulo de la secci&oacute;n que se est&aacute; leyendo. A medida
que se traslade a trav&eacute;s de la biblioteca de informaci&oacute;n, la
lista de libros se actualizar&aacute; autom&aacute;ticamente para indicar
la posici&oacute;n en la que se encuentra.</para>
<para>Si la secci&oacute;n actual es subordinada de una secci&oacute;n que
no est&aacute; expandida en la lista de libros, el icono en forma de dedo
estar&aacute; &ldquo;vac&iacute;o&rdquo; y apuntar&aacute; hacia el t&iacute;tulo
de la secci&oacute;n que contiene la subordinada.</para>
<para>Para activar y desactivar el seguimiento autom&aacute;tico, seleccione
la opci&oacute;n Seguimiento autom&aacute;tico del men&uacute; Opciones de
la ventana Lista de libros. El seguimiento autom&aacute;tico est&aacute; activado
cuando aparece una marca al lado de la opci&oacute;n Seguimiento autom&aacute;tico.
</para>
<para>Note que el icono de seguimiento aparecer&aacute; solamente cuando la
ventana de lectura est&aacute; abierta.</para>
</sect2>
<sect2 id="INFOUG.Rdbooks.div.4">
<title id="INFOUG.Rdbooks.mkr.4">Utilizaci&oacute;n de ventanas m&uacute;ltiples<indexterm>
<primary>ventanas</primary><secondary>sujetar</secondary></indexterm><indexterm>
<primary>ventanas</primary><secondary>utilizaci&oacute;n de <?Pub Caret>m&uacute;ltiples</secondary></indexterm></title>
<para>Gestor de informaci&oacute;n permite utilizar m&aacute;s de una ventana
de lectura simult&aacute;neamente. Por ejemplo, podr&aacute; mantener el texto
de una ventana mientras contin&uacute;a leyendo las secciones de otra. Para
efectuar esta operaci&oacute;n haga clic en la chinche de la barra de herramientas
de la ventana de lectura. Al hacer clic en la chinche, se sujeta y se suelta
la ventana.</para>
<para>Si una ventana est&aacute; sujeta, Gestor de informaci&oacute;n abre
otra ventana de lectura para ver la pr&oacute;xima secci&oacute;n que se desea
abrir. Si la ventana est&aacute; suelta, Gestor de informaci&oacute;n la actualiza
con el texto de la nueva secci&oacute;n.<indexterm><primary>chinche</primary>
</indexterm></para>
<para>Cuando una ventana est&aacute; sujeta, la chinche aparece en posici&oacute;n
vertical con una marca.</para>
<graphic id="INFOUG.Rdbooks.igrph.3" entityref="INFOUG.Rdbooks.fig.3"></graphic>
<note>
<para>Tambi&eacute;n podr&aacute; sujetar ventanas de resultados de b&uacute;squedas.
Si se sujeta una ventana de resultados de b&uacute;squedas, Gestor de informaci&oacute;n
no reemplazar&aacute; los resultados de la primera b&uacute;squeda por los
de las subsiguientes, es decir, los resultados de las nuevas b&uacute;squedas
aparecer&aacute;n en ventanas de resultados de b&uacute;squedas individuales.
</para>
</note>
<para>Seleccione Preferencias en el men&uacute; Opciones para especificar
si todas las nuevas ventanas de lectura estar&aacute;n sujetas o sueltas de
forma predeterminada. Tenga en cuenta que para contar con espacio en la pantalla,
es posible que deba limitar la cantidad de ventanas utilizadas simult&aacute;neamente.
</para>
<para>Puede ser &uacute;til sujetar la ventana de contenido si desea efectuar
el seguimiento de enlaces m&uacute;ltiples.</para>
</sect2>
<sect2 id="INFOUG.Rdbooks.div.5">
<title id="INFOUG.Rdbooks.mkr.5">Modificaci&oacute;n del tama&ntilde;o de
una ventana de lectura<indexterm><primary>ventanas</primary><secondary>ventana
de lectura</secondary><tertiary>modificaci&oacute;n del tama&ntilde;o</tertiary>
</indexterm><indexterm><primary>ventana de lectura</primary><secondary>modificaci&oacute;n
del tama&ntilde;o</secondary></indexterm></title>
<para>Para modificar el tama&ntilde;o de una ventana de lectura, utilice el
rat&oacute;n para arrastrar y estirar los bordes de la misma o use el bot&oacute;n
para minimizar que se encuentra en la esquina superior derecha de su marco.
El nuevo tama&ntilde;o de la ventana permanecer&aacute; en efecto durante
el resto de la sesi&oacute;n de Gestor de informaci&oacute;n o hasta que se
modifique nuevamente. Al modificar el tama&ntilde;o de la ventana de lectura,
el texto se ajusta autom&aacute;ticamente al nuevo tama&ntilde;o.</para>
<para>Para configurar el tama&ntilde;o predeterminado de la ventana de lectura,
seleccione Preferencias para Examinador del men&uacute; Opciones y configure
el nuevo tama&ntilde;o de geometr&iacute;a del examinador. Para obtener informaci&oacute;n
adicional acerca de la configuraci&oacute;n de preferencias, refi&eacute;rase
a <!--XRef content: 'Customizing the Information Manager'--><xref role="JumpText"
linkend="INFOUG.Custom.mkr.1">.</para>
</sect2>
<sect2 id="INFOUG.Rdbooks.div.6">
<title id="INFOUG.Rdbooks.mkr.6">Duplicaci&oacute;n de una ventana de lectura<indexterm>
<primary>ventanas</primary><secondary>ventana de lectura</secondary><tertiary>duplicaci&oacute;n</tertiary></indexterm><indexterm><primary>ventana de lectura</primary><secondary>duplicaci&oacute;n</secondary></indexterm></title>
<para>Es posible que desee ver dos o m&aacute;s partes de una secci&oacute;n
larga simult&aacute;neamente. Esta operaci&oacute;n se puede efectuar duplicando
la ventana de lectura.</para>
<para>Para duplicar una ventana de lectura, seleccione la opci&oacute;n Nueva
ventana del men&uacute; Examinador. Gestor de informaci&oacute;n abrir&aacute;
otra ventana de lectura que mostrar&aacute; la misma secci&oacute;n. En esta
segunda secci&oacute;n se podr&aacute; trasladar a una ubicaci&oacute;n diferente
de la que aparece en la primera ventana.</para>
</sect2>
<sect2 id="INFOUG.Rdbooks.div.7">
<title id="INFOUG.Rdbooks.mkr.7">Cierre de una ventana de lectura<indexterm>
<primary>ventana de lectura</primary><secondary>cierre</secondary></indexterm><indexterm>
<primary>ventanas</primary><secondary>ventana de lectura</secondary><tertiary>cierre</tertiary></indexterm></title>
<para>Para cerrar una ventana de lectura, seleccione la opci&oacute;n Cerrar
del men&uacute; Examinador. Al cerrar una ventana de lectura, no saldr&aacute;
de Gestor de informaci&oacute;n.</para>
<para>Para salir de Gestor de informaci&oacute;n, seleccione la opci&oacute;n
Salir del men&uacute; Examinador.</para>
</sect2>
</sect1>
<sect1 id="INFOUG.Rdbooks.div.8">
<title id="INFOUG.Rdbooks.mkr.8">Lectura secuencial de un libro<indexterm>
<primary>navegaci&oacute;n</primary><secondary>lectura secuencial</secondary>
</indexterm></title>
<para>La estructura tradicional de los libros de Gestor de informaci&oacute;n
permite trasladarse de forma familiar en bibliotecas de informaci&oacute;n.
Podr&aacute; leer libros utilizando funciones como Tabla de contenido. Tambi&eacute;n
podr&aacute; examinar secciones en orden secuencial.</para>
<para>Para examinar un libro de forma secuencial, haga clic en los botones
Secci&oacute;n anterior o Pr&oacute;xima secci&oacute;n de la barra de herramientas
de la ventana de lectura, para trasladarse a secciones anteriores o posteriores.
</para>
<graphic id="INFOUG.Rdbooks.igrph.4" entityref="INFOUG.Rdbooks.fig.4"></graphic>
<para>La flecha hacia arriba lo ubicar&aacute; en la secci&oacute;n anterior.
Si se encuentra en la primera secci&oacute;n, no podr&aacute; seleccionar
la flecha mencionada anteriormente.</para>
<para>La flecha hacia abajo lo ubicar&aacute; en la pr&oacute;xima secci&oacute;n.
Si se encuentra en la &uacute;ltima secci&oacute;n, esta flecha aparecer&aacute;
atenuada.</para>
<para>Para que aparezca una presentaci&oacute;n preliminar de la secci&oacute;n
anterior, coloque el puntero en la flecha para examinar Secci&oacute;n anterior
o Pr&oacute;xima secci&oacute;n y despu&eacute;s haga clic y mantenga presionado
el bot&oacute;n del rat&oacute;n. Gestor de informaci&oacute;n pondr&aacute;
en pantalla el t&iacute;tulo de la secci&oacute;n anterior o de la pr&oacute;xima
secci&oacute;n en el &aacute;rea de mensajes. Si no desea trasladarse a la
secci&oacute;n indicada, quite el puntero de la flecha antes de soltar el
bot&oacute;n del rat&oacute;n.</para>
<para>Una vez que se encuentre en una secci&oacute;n, podr&aacute; trasladarse
a trav&eacute;s de la misma mediante la barra de desplazamiento, las teclas
Re P&aacute;g y Av P&aacute;g o las flechas hacia arriba y hacia abajo.</para>
</sect1>
</chapter>
<?Pub *0000030745>
