<!-- $XConsortium: ch03.sgm /main/2 1996/12/20 19:30:03 rws $ -->
<?Pub Caret>
<!-- (c) Copyright 1996 Digital Equipment Corporation. -->
<!-- (c) Copyright 1996 Hewlett-Packard Company. -->
<!-- (c) Copyright 1996 International Business Machines Corp. -->
<!-- (c) Copyright 1996 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1996 Novell, Inc. -->
<!-- (c) Copyright 1996 FUJITSU LIMITED. -->
<!-- (c) Copyright 1996 Hitachi. -->
<chapter id="INFOUG.Navigate.div.1">
<title id="INFOUG.Navigate.mkr.1">Navegaci&oacute;n en Gestor de informaci&oacute;n</title>
<para>Adem&aacute;s de utilizar la estructura de libro tradicional, existen
otros m&eacute;todos para navegar en bibliotecas de informaci&oacute;n. Por
ejemplo, podr&aacute; leer libros de una biblioteca siguiendo <firstterm>
enlaces</firstterm> que conducen a informaci&oacute;n relacionada o podr&aacute;
utilizar el historial y las funciones de mapa para buscar informaci&oacute;n.
</para>
<para>Este cap&iacute;tulo contiene informaci&oacute;n acerca de:</para>
<itemizedlist>
<listitem><para><xref role="JumpText" linkend="INFOUG.Navigate.div.2"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Navigate.div.3"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Navigate.div.6"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Navigate.div.8"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Navigate.div.11"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Navigate.div.12"></para>
</listitem>
</itemizedlist>
<para>Tambi&eacute;n podr&aacute; buscar informaci&oacute;n acerca de un tema
espec&iacute;fico directamente. Refi&eacute;rase a <!--Original XRef content:
'Searching for Information'--><xref role="JumpText" linkend="INFOUG.Search.mkr.1">
para obtener informaci&oacute;n adicional acerca de c&oacute;mo comenzar una
b&uacute;squeda, especificar una consulta de b&uacute;squeda y restringir
la amplitud de la b&uacute;squeda.</para>
<sect1 id="INFOUG.Navigate.div.2">
<title id="INFOUG.Navigate.mkr.2">Identificaci&oacute;n de la ubicaci&oacute;n
actual<indexterm><primary>ubicaci&oacute;n</primary><secondary>identificaci&oacute;n
de la ubicaci&oacute;n actual</secondary></indexterm></title>
<para>Mediante los enlaces de hipertexto podr&aacute; trasladarse r&aacute;pida
y f&aacute;cilmente desde una secci&oacute;n a otra, incluso desde un libro
a otro. Si se traslada dentro de un libro o una biblioteca, puede suceder
que la ubicaci&oacute;n donde se encuentra no sea obvia; sin embargo, podr&aacute;
identificarla f&aacute;cilmente utilizando:</para>
<itemizedlist>
<listitem><para>Localizadores. Vea <xref role="JumpText" linkend="INFOUG.Navigate.mkr.3">.
</para>
</listitem>
<listitem><para>El seguimiento autom&aacute;tico (lista de libros). Vea <xref
role="JumpText" linkend="INFOUG.Rdbooks.div.3">.</para>
</listitem>
<listitem><para>La pantalla de la secci&oacute;n anterior (lista de historial).
Vea <xref role="JumpText" linkend="INFOUG.Navigate.mkr.11">.</para>
</listitem>
<listitem><para>El mapa gr&aacute;fico. Vea <xref role="JumpText" linkend="INFOUG.Navigate.mkr.12">.
</para>
</listitem>
</itemizedlist>
</sect1>
<sect1 id="INFOUG.Navigate.div.3">
<title id="INFOUG.Navigate.mkr.3">Utilizaci&oacute;n de localizadores<indexterm>
<primary>localizadores</primary><secondary>utilizaci&oacute;n</secondary>
</indexterm></title>
<para>Cada libro y cada secci&oacute;n de libro cuenta con una identificaci&oacute;n
&uacute;nica llamada <firstterm>localizador</firstterm>. Gestor de informaci&oacute;n
permite poner en pantalla localizadores y utilizarlos para obtener acceso
a las secciones que identifican.</para>
<sect2 id="INFOUG.Navigate.div.4">
<title id="INFOUG.Navigate.mkr.4">Puesta en pantalla de localizadores<indexterm>
<primary>mostrar localizadores</primary></indexterm><indexterm><primary>localizadores</primary><secondary>mostrar</secondary></indexterm><indexterm><primary>ubicaci&oacute;n</primary><secondary>mostrar localizador</secondary></indexterm></title>
<para>Para poner en pantalla el localizador del libro y secci&oacute;n que
aparece en pantalla, seleccione la opci&oacute;n Mostrar localizador del men&uacute;.
Gestor de informaci&oacute;n pondr&aacute; el localizador en el &aacute;rea
de mensajes que aparece en la parte inferior de la ventana.</para>
<para>Para volver a la secci&oacute;n m&aacute;s adelante, podr&aacute; anotar
el localizador correspondiente y especificarlo mediante la funci&oacute;n
Abrir localizador.</para>
</sect2>
<sect2 id="INFOUG.Navigate.div.5">
<title id="INFOUG.Navigate.mkr.5">C&oacute;mo ir a localizadores<indexterm>
<primary>abrir localizador</primary></indexterm><indexterm><primary>localizadores</primary><secondary>abrir</secondary></indexterm><indexterm><primary>ubicaci&oacute;n</primary><secondary>abrir localizador</secondary></indexterm></title>
<para>Para volver a la secci&oacute;n cuyo localizador ha identificado anteriormente
mediante Mostrar localizador, seleccione la opci&oacute;n Abrir localizador
del men&uacute; Ir. Gestor de informaci&oacute;n pondr&aacute; en pantalla
el siguiente cuadro de di&aacute;logo para que pueda especificar el localizador
de la secci&oacute;n.</para>
<figure>
<title id="INFOUG.Navigate.mkr.5a">Cuadro de di&aacute;logo Abrir localizador</title>
<graphic id="INFOUG.Navigate.igrph.1" entityref="INFOUG.Navigate.fig.1"></graphic>
</figure>
<para>Especifique el localizador de la secci&oacute;n en la que desea ubicarse.
</para>
<para>Haga clic en Aplicar para ir a dicha secci&oacute;n y mantener el cuadro
de di&aacute;logo abierto o haga clic en OK para ir a la secci&oacute;n y
cerrar el cuadro de di&aacute;logo.</para>
</sect2>
</sect1>
<sect1 id="INFOUG.Navigate.div.6">
<title id="INFOUG.Navigate.mkr.6">Seguimiento de enlaces<indexterm><primary>navegaci&oacute;n</primary><secondary>seguimiento de enlaces</secondary></indexterm><indexterm>
<primary>enlaces</primary><secondary>seguimiento</secondary></indexterm></title>
<para>En Gestor de informaci&oacute;n, los enlaces de hipertexto aparecen
en texto en negrita, subrayado y en color. Los enlaces permiten &ldquo;saltar&rdquo;
r&aacute;pidamente hacia:</para>
<itemizedlist>
<listitem><para>Otras partes de la secci&oacute;n actual</para>
</listitem>
<listitem><para>Otras secciones del mismo libro</para>
</listitem>
<listitem><para>Otros libros de la biblioteca de informaci&oacute;n</para>
</listitem>
</itemizedlist>
<para>Para seguir un enlace de una ventana de lectura, coloque el puntero
en el texto del enlace y haga clic. Para seguir un enlace de una ventana de
lista, como por ejemplo la lista del historial de secciones, coloque el puntero
en el enlace y haga doble clic.</para>
<para>Cuando se sigue un enlace desde una ventana de lectura que no est&aacute;
sujeta, Gestor de informaci&oacute;n reemplaza la secci&oacute;n actual por
otra. Si la ventana de lectura est&aacute; sujeta, Gestor de informaci&oacute;n
abre una nueva ventana de lectura para mostrar la nueva secci&oacute;n.</para>
<sect2 id="INFOUG.Navigate.div.7">
<title id="INFOUG.Navigate.mkr.7">Presentaci&oacute;n previa de destinos de
enlaces<indexterm><primary>enlaces</primary><secondary>presentaci&oacute;n
previa de destinos</secondary></indexterm><indexterm><primary>navegaci&oacute;n</primary><secondary>presentaci&oacute;n previa de destinos de enlaces</secondary>
</indexterm></title>
<para>Desde la ventana de lectura podr&aacute; poner en pantalla presentaciones
previas de enlaces para decidir si desea seguirlos. Para ver el t&iacute;tulo
de la secci&oacute;n de destino:</para>
<orderedlist>
<listitem><para>Coloque el cursor en el enlace.</para>
</listitem>
<listitem><para>Presione y mantenga presionado el bot&oacute;n izquierdo del
rat&oacute;n. Gestor de informaci&oacute;n pondr&aacute; el destino del enlace
en el &aacute;rea de mensajes que aparece en la parte inferior de la ventana.
</para>
</listitem>
<listitem><para>Para seguir un enlace, suelte el bot&oacute;n del rat&oacute;n.
Si decide no seguir el enlace, quite el puntero del enlace antes de soltar
el bot&oacute;n del rat&oacute;n.</para>
</listitem>
</orderedlist>
</sect2>
</sect1>
<sect1 id="INFOUG.Navigate.div.8">
<title id="INFOUG.Navigate.mkr.8">Seguimiento de operaciones efectuadas<indexterm>
<primary>navegaci&oacute;n</primary><secondary>seguimiento de operaciones
efectuadas</secondary></indexterm></title>
<para>Es posible que desee volver a la secci&oacute;n que ha puesto en pantalla
anteriormente durante la sesi&oacute;n de examinador. Podr&aacute; volver
a las secciones mediante:</para>
<itemizedlist>
<listitem><para>La lista Historial de secciones. Refi&eacute;rase a <xref
role="JumpText" linkend="INFOUG.Navigate.div.9">.</para>
</listitem>
<listitem><para>Flechas de historial. Refi&eacute;rase a <xref role="JumpText"
linkend="INFOUG.Navigate.div.10">.</para>
</listitem>
</itemizedlist>
<sect2 id="INFOUG.Navigate.div.9">
<title id="INFOUG.Navigate.mkr.9">Utilizaci&oacute;n de la lista Historial
de secciones<indexterm><primary>navegaci&oacute;n</primary><secondary>mediante
la lista Historial de secciones</secondary></indexterm><indexterm><primary>seguimiento de operaciones efectuadas</primary><secondary>mediante la lista
Historial de secciones</secondary></indexterm><indexterm><primary>lista Historial
de secciones</primary></indexterm></title>
<para>Gestor de informaci&oacute;n mostrar&aacute; el registro de las secciones
en las que ha estado durante la sesi&oacute;n de examinador en curso. Podr&aacute;
verificar r&aacute;pidamente las secciones que ha le&iacute;do abriendo la
lista Historial de secciones que muestra la siguiente figura.</para>
<figure>
<title id="INFOUG.Navigate.mkr.9a">Lista Historial de secciones</title>
<graphic id="INFOUG.Navigate.igrph.2" entityref="INFOUG.Navigate.fig.2"></graphic>
</figure>
<para>La lista Historial de secciones contiene todas las secciones en las
que ha estado, desde la m&aacute;s reciente hasta la menos reciente. A pesar
de que es posible que haya estado en una misma secci&oacute;n varias veces,
Gestor de informaci&oacute;n la listar&aacute; una sola vez.</para>
<para>Para utilizar la lista Historial de secciones:</para>
<orderedlist>
<listitem><para>Seleccione la opci&oacute;n Historial del men&uacute; Ir de
la ventana de lectura. Gestor de informaci&oacute;n pondr&aacute; en pantalla
la lista Historial de secciones.</para>
</listitem>
<listitem><para>Para trasladarse a una secci&oacute;n de la lista, haga doble
clic en el t&iacute;tulo de la secci&oacute;n o re&aacute;lcelo y haga clic
en Mostrar. Si la ventana de lectura no est&aacute; sujeta, Gestor de informaci&oacute;n
reemplazar&aacute; la secci&oacute;n actual por la nueva. Si la ventana de
lectura est&aacute; sujeta, Gestor de informaci&oacute;n abrir&aacute; otra
ventana de lectura para mostrar la nueva secci&oacute;n.</para>
</listitem>
</orderedlist>
<para>Para cerrar la lista Historial de secciones sin ir a una secci&oacute;n
que se ha visto anteriormente, haga clic en Cerrar.</para>
</sect2>
<sect2 id="INFOUG.Navigate.div.10">
<title id="INFOUG.Navigate.mkr.10">Utilizaci&oacute;n de las flechas de historial<indexterm>
<primary>flechas</primary><secondary>historial</secondary></indexterm><indexterm>
<primary>flechas de historial</primary></indexterm><indexterm><primary>navegaci&oacute;n</primary><secondary>mediante flechas de historial</secondary></indexterm><indexterm>
<primary>seguimiento de operaciones efectuadas</primary><secondary>mediante
flechas de historial</secondary></indexterm></title>
<para>Es posible que sea necesario trasladarse hacia atr&aacute;s o hacia
adelante a trav&eacute;s de una serie de secciones vistas anteriormente. Podr&aacute;
utilizar las flechas de historial de la ventana de lectura para trasladarse
a trav&eacute;s de secciones en el orden en el que las ha le&iacute;do. Las
flechas de historial aparecen en el comienzo de la barra de herramientas de
la ventana de lectura, a la izquierda de las flechas para examinar.</para>
<graphic id="INFOUG.Navigate.igrph.3" entityref="INFOUG.Navigate.fig.3"></graphic>
<note>
<para>Podr&aacute; efectuar las mismas operaciones seleccionando las opciones
Atr&aacute;s (historial) y Adelante (historial) del men&uacute; Ir.</para>
</note>
<para>Si ha estado en la misma secci&oacute;n m&aacute;s de una vez durante
la sesi&oacute;n del examinador, volver&aacute; varias veces a la misma secci&oacute;n
mediante las flechas de historial.</para>
<para>La flecha de historial hacia la izquierda mueve hacia atr&aacute;s a
trav&eacute;s de la lista de secciones. La flecha de historial hacia la derecha
mueve hacia adelante.</para>
<para>Si se encuentra al principio o final de la lista de secciones, no se
podr&aacute; seleccionar la flecha hacia la izquierda o hacia la derecha para
indicar que no podr&aacute; avanzar en la direcci&oacute;n correspondiente.
</para>
</sect2>
</sect1>
<sect1 id="INFOUG.Navigate.div.11">
<title id="INFOUG.Navigate.mkr.11">Puesta en pantalla de secciones anteriores<indexterm>
<primary>navegaci&oacute;n</primary><secondary>mediante el bot&oacute;n del
t&iacute;tulo de secci&oacute;n</secondary></indexterm><indexterm><primary>seguimiento de operaciones efectuadas</primary><secondary>mediante el bot&oacute;n
del t&iacute;tulo de secci&oacute;n</secondary></indexterm><indexterm><primary>secci&oacute;n</primary><secondary>puesta en pantalla de anteriores</secondary>
</indexterm><indexterm><primary>secciones anteriores</primary><secondary>puesta en pantalla</secondary></indexterm><indexterm><primary>bot&oacute;n
del t&iacute;tulo de secci&oacute;n</primary></indexterm></title>
<para>Puede ser necesario obtener informaci&oacute;n m&aacute;s general que
la que contiene esta secci&oacute;n o una idea m&aacute;s clara del nivel
de la informaci&oacute;n que se est&aacute; leyendo, es decir, puede ser necesario
ver una lista de las secciones anteriores de la estructura del libro a la
que aparece en pantalla.</para>
<para>Para poner en pantalla la lista de secciones anteriores, haga clic en
el bot&oacute;n del t&iacute;tulo de la secci&oacute;n que se encuentra arriba
del &aacute;rea de visualizaci&oacute;n.</para>
<graphic id="INFOUG.Navigate.igrph.4" entityref="INFOUG.Navigate.fig.4"></graphic>
<para>Gestor de informaci&oacute;n mostrar&aacute; la lista de t&iacute;tulos
de secci&oacute;n.</para>
<para>Podr&aacute; desplazar la lista hacia atr&aacute;s hasta el nombre de
la biblioteca que contiene el libro de la secci&oacute;n.</para>
<note>
<para>Los dos elementos superiores de la lista corresponden al estante de
libros y a la biblioteca de informaci&oacute;n. No podr&aacute;n seleccionarse
debido a que no identifican ninguna secci&oacute;n espec&iacute;fica.</para>
</note>
<para>Para ir a una secci&oacute;n de la lista, haga clic en su t&iacute;tulo.
Si la ventana de lectura no est&aacute; sujeta, Gestor de informaci&oacute;n
reemplazar&aacute; la secci&oacute;n que aparece en pantalla por la nueva.
Si la ventana de lectura est&aacute; sujeta, Gestor de informaci&oacute;n
abrir&aacute; otra ventana de lectura para mostrar la nueva secci&oacute;n.
</para>
<para>Para cerrar la lista de secciones sin ir a otra secci&oacute;n, haga
clic en el bot&oacute;n del t&iacute;tulo de secci&oacute;n nuevamente.</para>
</sect1>
<sect1 id="INFOUG.Navigate.div.12">
<title id="INFOUG.Navigate.mkr.12">Navegaci&oacute;n mediante el mapa gr&aacute;fico<indexterm>
<primary>mapa</primary><secondary>navegaci&oacute;n</secondary></indexterm><indexterm>
<primary>mapa gr&aacute;fico</primary></indexterm><indexterm><primary>navegaci&oacute;n</primary><secondary>mediante el mapa gr&aacute;fico</secondary></indexterm></title>
<para>Para orientarse en la organizaci&oacute;n del libro, podr&aacute; poner
en pantalla un mapa gr&aacute;fico de sus secciones. El mapa es un &ldquo;&aacute;rbol&rdquo;
gr&aacute;fico que muestra los t&iacute;tulos de las secciones del libro.
El mapa facilita ver la organizaci&oacute;n general del libro.</para>
<figure>
<title id="INFOUG.Navigate.mkr.12a">Mapa gr&aacute;fico</title>
<graphic id="INFOUG.Navigate.igrph.5" entityref="INFOUG.Navigate.fig.5"></graphic>
</figure>
<sect2 id="INFOUG.Navigate.div.13">
<title id="INFOUG.Navigate.mkr.13">C&oacute;mo abrir el mapa<indexterm><primary>mapa gr&aacute;fico</primary><secondary>abrir</secondary></indexterm></title>
<para>Para poner el mapa en pantalla, haga clic en el bot&oacute;n Mapa gr&aacute;fico
de la barra de herramientas de la ventana de lectura o seleccione la opci&oacute;n
Mapa gr&aacute;fico del men&uacute; Ventanas.</para>
<graphic id="INFOUG.Navigate.igrph.6" entityref="INFOUG.Navigate.fig.6"></graphic>
<para>Gestor de informaci&oacute;n abrir&aacute; el mapa gr&aacute;fico en
el que aparecer&aacute; el t&iacute;tulo de la secci&oacute;n actual y los
t&iacute;tulos de las dem&aacute;s secciones del libro.</para>
</sect2>
<sect2 id="INFOUG.Navigate.div.14">
<title id="INFOUG.Navigate.mkr.14">Panor&aacute;mica del mapa<indexterm><primary>mapa gr&aacute;fico</primary><secondary>panor&aacute;mica</secondary></indexterm></title>
<para>Para ver los t&iacute;tulos de secci&oacute;n que no aparecen en pantalla,
podr&aacute; utilizar la funci&oacute;n de panor&aacute;mica a trav&eacute;s
del mapa. Esta funci&oacute;n es &uacute;til ya que generalmente los mapas
son demasiado grandes para que aparezcan completamente en la pantalla.</para>
<para>El mapa gr&aacute;fico contiene un <firstterm>cuadro de panor&aacute;mica
</firstterm> ubicado en la esquina superior izquierda que podr&aacute; utilizar
para seleccionar el &aacute;rea del mapa que desea poner en pantalla.</para>
<para>Para utilizar la funci&oacute;n de panor&aacute;mica a trav&eacute;s
del mapa:</para>
<orderedlist>
<listitem><para>Coloque el puntero en el cuadro de panor&aacute;mica del mapa
de secciones locales.</para>
</listitem>
<listitem><para>Presione y mantenga presionado el bot&oacute;n izquierdo del
rat&oacute;n.</para>
</listitem>
<listitem><para>Arrastre el rat&oacute;n para poner en pantalla la parte del
mapa que desea ver. Por ejemplo, coloque el cuadro de panor&aacute;mica a
la derecha para ver los t&iacute;tulos ocultos por el per&iacute;metro derecho
del mapa.</para>
</listitem>
</orderedlist>
<note>
<para>Si as&iacute; lo prefiere, podr&aacute; modificar el tama&ntilde;o de
la ventana para ajustar el tama&ntilde;o de todo el mapa gr&aacute;fico.</para>
</note>
</sect2>
<sect2 id="INFOUG.Navigate.div.15">
<title id="INFOUG.Navigate.mkr.15">C&oacute;mo trasladarse a una secci&oacute;n
desde el mapa<indexterm><primary>mapa gr&aacute;fico</primary><secondary>ir a una secci&oacute;n</secondary></indexterm></title>
<para>Para ver una secci&oacute;n que aparece en el mapa gr&aacute;fico, haga
clic en el t&iacute;tulo de la misma. Si la ventana de lectura no est&aacute;
sujeta, Gestor de informaci&oacute;n reemplazar&aacute; la secci&oacute;n
actual por la nueva. Si la ventana de lectura est&aacute; sujeta, Gestor de
informaci&oacute;n abrir&aacute; otra para mostrar la nueva secci&oacute;n.
</para>
</sect2>
<sect2 id="INFOUG.Navigate.div.16">
<title id="INFOUG.Navigate.mkr.16">Actualizaci&oacute;n del mapa gr&aacute;fico<indexterm>
<primary>mapa</primary><secondary>actualizaci&oacute;n</secondary></indexterm></title>
<para>Si desea actualizar el mapa gr&aacute;fico para que aparezca la posici&oacute;n
actual en el libro, haga clic en el bot&oacute;n Actualizaci&oacute;n autom&aacute;tica
que se encuentra en la esquina superior derecha de la ventana Mapa gr&aacute;fico.
Si desea que el mapa gr&aacute;fico muestre autom&aacute;ticamente la posici&oacute;n
en la que se encuentra cada vez que se traslade a trav&eacute;s de un libro,
seleccione Preferencias para mapa del men&uacute; Opciones y active Actualizaci&oacute;n
autom&aacute;tica.</para>
</sect2>
</sect1>
</chapter>
<?Pub *0000037615>
