<!-- $XConsortium: ch04.sgm /main/3 1996/12/20 20:07:56 rws $ -->
<!-- (c) Copyright 1996 Digital Equipment Corporation. -->
<!-- (c) Copyright 1996 Hewlett-Packard Company. -->
<!-- (c) Copyright 1996 International Business Machines Corp. -->
<!-- (c) Copyright 1996 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1996 Novell, Inc. -->
<!-- (c) Copyright 1996 FUJITSU LIMITED. -->
<!-- (c) Copyright 1996 Hitachi. -->
<chapter id="INFOUG.Search.div.1">
<title id="INFOUG.Search.mkr.1">B&uacute;squeda de informaci&oacute;n</title>
<para>Cuando es necesario obtener informaci&oacute;n espec&iacute;fica, buscarla
es m&aacute;s eficiente que examinar. Gestor de informaci&oacute;n cuenta
con completas funciones de b&uacute;squeda que permiten:</para>
<itemizedlist>
<listitem><para>Buscar r&aacute;pidamente utilizando criterios de b&uacute;squeda
simples. Refi&eacute;rase a <xref role="JumpText" linkend="INFOUG.Search.div.2">.
</para>
</listitem>
<listitem><para>Realizar b&uacute;squedas detalladas mediante Editor de consultas.
Refi&eacute;rase a<xref role="JumpText" linkend="INFOUG.Search.div.5">.</para>
</listitem>
<listitem><para>Definir la amplitud de b&uacute;squedas para abarcar una sola
secci&oacute;n o libros y tipos de informaci&oacute;n espec&iacute;ficos.
Refi&eacute;rase a <xref role="JumpText" linkend="INFOUG.Search.div.10">.
</para>
</listitem>
<listitem><para>Ver resultados de b&uacute;squedas y leer secciones que contienen
elementos encontrados. Refi&eacute;rase a <xref role="JumpText" linkend="INFOUG.Search.div.22">.
</para>
</listitem>
</itemizedlist>
<note>
<para>Para minimizar el tama&ntilde;o de la base de datos de b&uacute;squeda,
Gestor de informaci&oacute;n no busca muchas palabras comunes como: <wordasword>y</wordasword>, <wordasword>pero</wordasword>, <wordasword>o</wordasword> <wordasword>el</wordasword>.</para>
</note>
<sect1 id="INFOUG.Search.div.2">
<title id="INFOUG.Search.mkr.2">B&uacute;squeda r&aacute;pida<indexterm><primary>b&uacute;squeda</primary><secondary>m&eacute;todo r&aacute;pido</secondary>
</indexterm><indexterm><primary>b&uacute;squeda r&aacute;pida</primary></indexterm></title>
<para>Para buscar r&aacute;pidamente una palabra o frase simple, utilice el
campo de b&uacute;squeda r&aacute;pida que se encuentra en la parte inferior
de la ventana de lectura. Podr&aacute; introducir el texto a buscar manualmente
o realzando texto existente y despu&eacute;s seleccionando la opci&oacute;n
Selecci&oacute;n del men&uacute; Buscar.</para>
<figure>
<title id="INFOUG.Search.mkr.2a">Campo B&uacute;squeda r&aacute;pida</title>
<graphic id="INFOUG.Search.igrph.1" entityref="INFOUG.Search.fig.1"></graphic>
</figure>
<sect2 id="INFOUG.Search.div.3">
<title id="INFOUG.Search.mkr.3">C&oacute;mo iniciar una b&uacute;squeda r&aacute;pida<indexterm>
<primary>b&uacute;squeda r&aacute;pida</primary><secondary>c&oacute;mo iniciar</secondary></indexterm><indexterm><primary>b&uacute;squeda</primary><secondary>c&oacute;mo iniciar una r&aacute;pida</secondary></indexterm></title>
<para>Para iniciar una b&uacute;squeda desde el campo de b&uacute;squeda r&aacute;pida:
</para>
<orderedlist>
<listitem><para>Coloque el puntero en el campo de b&uacute;squeda r&aacute;pida
y borre el texto que se encuentre en dicho campo.</para>
</listitem>
<listitem><para>Escriba el texto a buscar.</para>
<para>Al colocar el puntero en el campo de b&uacute;squeda r&aacute;pida,
el bot&oacute;n Editor de la amplitud de b&uacute;squeda que se encuentra
a la izquierda del campo mostrar&aacute; la amplitud a utilizar para realizar
la b&uacute;squeda. Si desea utilizar la amplitud que aparece en pantalla,
omita los pasos 3 y 4. Para obtener informaci&oacute;n acerca de amplitudes
de b&uacute;squeda, refi&eacute;rase a <xref role="JumpText" linkend="INFOUG.Search.mkr.10">.
</para>
</listitem>
<listitem><para>Haga clic en el bot&oacute;n de amplitud de b&uacute;squeda.
Gestor de informaci&oacute;n pondr&aacute; en pantalla la lista de amplitudes
de b&uacute;squeda disponibles.</para>
<figure>
<title id="INFOUG.Search.mkr.3a">Lista de amplitudes de b&uacute;squeda</title>
<graphic id="INFOUG.Search.igrph.2" entityref="INFOUG.Search.fig.2"></graphic>
</figure>
</listitem>
<listitem><para>Haga clic en la amplitud a utilizar para buscar.</para>
</listitem>
<listitem><para>Presione la tecla Intro para iniciar la b&uacute;squeda.</para>
<para>Gestor de informaci&oacute;n mostrar&aacute; los art&iacute;culos encontrados
en la ventana Resultado de la b&uacute;squeda. Para ir a la secci&oacute;n
que contiene el elemento encontrado, haga clic en el t&iacute;tulo de la misma
en la ventana Resultado de la b&uacute;squeda.</para>
</listitem>
</orderedlist>
<para>Para crear criterios de b&uacute;squeda m&aacute;s detallados, podr&aacute;
utilizar Editor de consultas.</para>
</sect2>
<sect2 id="INFOUG.Search.div.4">
<title id="INFOUG.Search.mkr.4">B&uacute;squeda de texto seleccionado<indexterm>
<primary>b&uacute;squeda r&aacute;pida</primary><secondary>utilizaci&oacute;n
de texto seleccionado</secondary></indexterm><indexterm><primary>texto seleccionado</primary></indexterm></title>
<para>Para realizar una b&uacute;squeda r&aacute;pida mediante texto realzado:
</para>
<orderedlist>
<listitem><para>Realce el texto que desea buscar. (Coloque el puntero al comienzo
del texto. Mantenga el bot&oacute;n 1 del rat&oacute;n presionado y arrastre
hasta el final del texto.)</para>
<note>
<para>No es necesario que el texto realzado se encuentre en la ventana de
lectura; se puede encontrar en cualquier ventana del sistema.</para>
</note>
</listitem>
<listitem><para>Seleccione la opci&oacute;n Selecci&oacute;n del men&uacute;
Buscar de la ventana de lectura.</para>
<para>Gestor de informaci&oacute;n pondr&aacute; en pantalla el texto realzado
en el campo de b&uacute;squeda r&aacute;pida e iniciar&aacute; la b&uacute;squeda.
</para>
</listitem>
</orderedlist>
</sect2>
</sect1>
<sect1 id="INFOUG.Search.div.5">
<title id="INFOUG.Search.mkr.5">Definici&oacute;n de b&uacute;squedas detalladas<indexterm>
<primary>b&uacute;squeda</primary><secondary>m&eacute;todo detallado</secondary>
</indexterm></title>
<para>B&uacute;squedas detalladas permiten encontrar art&iacute;culos espec&iacute;ficos
como resultados de la b&uacute;squeda. Para definir una consulta detallada,
utilice Editor de consultas para:</para>
<itemizedlist>
<listitem><para>Introducir una consulta de b&uacute;squeda detallada. Refi&eacute;rase
a <xref role="JumpText" linkend="INFOUG.Search.div.6">.</para>
</listitem>
<listitem><para>Especificar el prefijo de consulta. Refi&eacute;rase a <xref
role="JumpText" linkend="INFOUG.Search.div.7">.</para>
</listitem>
<listitem><para>Definir las relaciones l&oacute;gicas de la consulta. Refi&eacute;rase
a <xref role="JumpText" linkend="INFOUG.Search.div.8">.</para>
</listitem>
</itemizedlist>
<para>Tambi&eacute;n podr&aacute; configurar la amplitud de la b&uacute;squeda
mediante Editor de consultas. Para obtener informaci&oacute;n adicional, refi&eacute;rase
a <xref role="JumpText" linkend="INFOUG.Search.mkr.10">.</para>
<sect2 id="INFOUG.Search.div.6">
<title id="INFOUG.Search.mkr.6">Introducci&oacute;n de una consulta de b&uacute;squeda
detallada<indexterm><primary>b&uacute;squeda</primary><secondary>introducci&oacute;n
de consultas</secondary></indexterm></title>
<para>Para introducir una consulta de b&uacute;squeda detallada:</para>
<orderedlist>
<listitem><para>Seleccione la opci&oacute;n Editor de consultas del men&uacute;
Buscar de la ventana de lectura para abrir el Editor de consultas. Gestor
de informaci&oacute;n pondr&aacute; en pantalla la ventana Editor de consultas.
</para>
<figure>
<title id="INFOUG.Search.mkr.6a">Ventana Editor de consultas</title>
<graphic id="INFOUG.Search.igrph.3" entityref="INFOUG.Search.fig.3"></graphic>
</figure>
</listitem>
<listitem><para>Haga clic en el bot&oacute;n Prefijo. Editor de consultas
pondr&aacute; en pantalla la lista de prefijos. Haga clic en el prefijo a
utilizar en la consulta: Contiene, No contiene, Comienza con o No comienza
con.</para>
</listitem>
<listitem><para>Escriba la primera palabra a buscar en el campo de introducci&oacute;n
de datos que se encuentra a la derecha del bot&oacute;n Prefijo.</para>
</listitem>
<listitem><para>Para incluir otra palabra en la b&uacute;squeda, haga clic
en el bot&oacute;n conector que se encuentra a la derecha del campo para introducir
datos. Editor de consultas pondr&aacute; en pantalla la lista Conexiones.
Seleccione el conector a utilizar para la consulta: O o Y. Repita los pasos
del 2 al 4 hasta completar la consulta.</para>
</listitem>
<listitem><para>Presione la tecla Intro o haga clic en el bot&oacute;n Buscar
para iniciar la b&uacute;squeda. Gestor de informaci&oacute;n mostrar&aacute;
los elementos encontrados en la ventana Resultados de b&uacute;squeda. La
figura <xref role="JumpText" linkend="INFOUG.Search.mkr.22a"> muestra una
ventana de resultados de b&uacute;squeda t&iacute;pica.</para>
</listitem>
</orderedlist>
<para>A medida que cree una consulta, Editor de consultas la mostrar&aacute;
en el &aacute;rea de consultas que se encuentra en la parte inferior de la
ventana. La definici&oacute;n de consulta mostrar&aacute; c&oacute;mo introducir&aacute;
la consulta si la estuviese escribiendo en el campo B&uacute;squeda r&aacute;pida.
</para>
</sect2>
<sect2 id="INFOUG.Search.div.7">
<title id="INFOUG.Search.mkr.7">Especificaci&oacute;n del prefijo de consulta<indexterm>
<primary>consulta</primary><secondary>especificaci&oacute;n del prefijo</secondary>
</indexterm><indexterm><primary>prefijo</primary><secondary>para consultas</secondary></indexterm></title>
<para>Para comenzar a especificar una consulta, se utiliza el bot&oacute;n
Prefijo para indicar si la consulta contiene, no contiene, comienza con o
no comienza con el texto que se escribe en el campo de introducci&oacute;n
de texto de consulta. Operaciones a efectuar:</para>
<orderedlist>
<listitem><para>Haga clic en el bot&oacute;n Prefijo. Editor de consultas
pondr&aacute; en pantalla la lista de prefijos.</para>
</listitem>
<listitem><para>Haga clic en el prefijo que desea utilizar para la consulta:
</para>
<variablelist>
<varlistentry><term>Contiene</term>
<listitem>
<para>Busca secciones que contienen el texto especificado.</para>
</listitem>
</varlistentry>
<varlistentry><term>No contiene</term>
<listitem>
<para>Busca secciones que no contienen el texto especificado.</para>
</listitem>
</varlistentry>
<varlistentry><term>Comienza con</term>
<listitem>
<para>Busca secciones que contienen palabras que comienzan con el texto especificado.
</para>
</listitem>
</varlistentry>
<varlistentry><term>No comienza con</term>
<listitem>
<para>Busca secciones que no contienen palabras que comienzan con el texto
especificado.</para>
</listitem>
</varlistentry>
</variablelist>
</listitem>
</orderedlist>
<para>Despu&eacute;s de seleccionar el prefijo, Editor de consultas lo mostrar&aacute;
en el bot&oacute;n Prefijo. A continuaci&oacute;n podr&aacute; introducir
el resto del texto de la consulta.</para>
</sect2>
<sect2 id="INFOUG.Search.div.8">
<title id="INFOUG.Search.mkr.8">Definici&oacute;n de relaciones l&oacute;gicas
en consultas<indexterm><primary>consulta</primary><secondary>definici&oacute;n
de relaciones l&oacute;gicas</secondary></indexterm><indexterm><primary>relaciones
l&oacute;gicas</primary><secondary>definici&oacute;n de una consulta</secondary>
</indexterm></title>
<para>Editor de consultas permite incluir varias palabras o frases en una
b&uacute;squeda. Para especificar la relaci&oacute;n l&oacute;gica entre las
partes de la consulta, deber&aacute; utilizar el bot&oacute;n conector que
se encuentra a la derecha del campo para introducir texto, para poner en pantalla
la lista de conexiones. Desde la lista de conexiones podr&aacute; seleccionar
la relaci&oacute;n l&oacute;gica deseada y especificar que se deben encontrar
las partes actual y la pr&oacute;xima o que se debe encontrar solamente una
parte, es decir, la relaci&oacute;n l&oacute;gica define una condici&oacute;n
para que el texto encontrado cumpla con el criterio de b&uacute;squeda.</para>
<para>Para definir una relaci&oacute;n l&oacute;gica:</para>
<orderedlist>
<listitem><para>Especifique el prefijo y texto de b&uacute;squeda de la primera
parte de la consulta.</para>
</listitem>
<listitem><para>Haga clic en el bot&oacute;n conector. Editor de consultas
pondr&aacute; en pantalla la lista de conexiones.</para>
</listitem>
<listitem><para>Haga clic en el conector de la relaci&oacute;n l&oacute;gica
que desea definir:</para>
<variablelist>
<varlistentry><term>O</term>
<listitem>
<para>Busca secciones que contienen el texto de la parte actual O la pr&oacute;xima
parte de la consulta o ambas.</para>
</listitem>
</varlistentry>
<varlistentry><term>Y</term>
<listitem>
<para>Busca secciones que contienen el texto de la parte actual Y la pr&oacute;xima
parte de la consulta.</para>
</listitem>
</varlistentry>
</variablelist>
</listitem>
</orderedlist>
<para>Despu&eacute;s de seleccionar un conector, Editor de consultas mostrar&aacute;
el conector seleccionado en el bot&oacute;n conector e iniciar&aacute; la
pr&oacute;xima l&iacute;nea de la consulta.</para>
</sect2>
</sect1>
<sect1 id="INFOUG.Search.div.10">
<title id="INFOUG.Search.mkr.10">Definici&oacute;n de la amplitud de la b&uacute;squeda<indexterm>
<primary>b&uacute;squeda</primary><secondary>definici&oacute;n de la amplitud</secondary></indexterm><indexterm><primary>amplitud</primary><secondary>definici&oacute;n</secondary></indexterm></title>
<para>Mediante la definici&oacute;n de la amplitud de b&uacute;squeda se puede
hacer la b&uacute;squeda m&aacute;s espec&iacute;fica. Tambi&eacute;n disminuye
el tama&ntilde;o de las listas de resultados ya que los restringe de manera
que tengan m&aacute;s sentido. Podr&aacute; utilizar <firstterm>amplitudes
de b&uacute;squeda</firstterm> para limitar los libros y tipos de informaci&oacute;n,
como por ejemplo tablas, incluidos en la b&uacute;squeda.</para>
<para>Gestor de informaci&oacute;n suministra amplitudes para buscar en la
secci&oacute;n actual, en toda la biblioteca de informaci&oacute;n o en un
estante de libros espec&iacute;fico. Estas amplitudes de b&uacute;squeda predefinidas
abarcan todos los tipos de informaci&oacute;n incluyendo t&iacute;tulos, texto
del cuerpo del documento, ejemplos, &iacute;ndices, tablas y gr&aacute;ficos.
Podr&aacute; crear amplitudes de b&uacute;squeda personalizadas para especificar
los libros y tipos de informaci&oacute;n que desee incluir en b&uacute;squedas
frecuentemente.</para>
<para>El resto de esta secci&oacute;n contiene informaci&oacute;n acerca de:
</para>
<itemizedlist>
<listitem><para><xref role="JumpText" linkend="INFOUG.Search.div.13"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Search.div.16"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Search.div.19"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Search.div.20"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Search.div.21"></para>
</listitem>
</itemizedlist>
<sect2 id="INFOUG.Search.div.13">
<title id="INFOUG.Search.mkr.13">Selecci&oacute;n de amplitudes de b&uacute;squeda<indexterm>
<primary>b&uacute;squeda</primary><secondary>selecci&oacute;n de amplitudes</secondary></indexterm><indexterm><primary>amplitud</primary><secondary>selecci&oacute;n</secondary></indexterm></title>
<para>Al iniciar una b&uacute;squeda, la configuraci&oacute;n predeterminada
utiliza la &uacute;ltima amplitud especificada en el &aacute;rea de b&uacute;squeda.
La ventana de lectura y Editor de consultas cuentan con amplitudes de b&uacute;squeda
predeterminadas.</para>
<para>Por ejemplo, si inicia una b&uacute;squeda desde la ventana de lectura,
Gestor de informaci&oacute;n usar&aacute; la amplitud de b&uacute;squeda utilizada
para la &uacute;ltima b&uacute;squeda. Si todav&iacute;a no ha efectuado ninguna
b&uacute;squeda durante la sesi&oacute;n de examinador en curso, Gestor de
informaci&oacute;n utilizar&aacute; la secci&oacute;n actual como amplitud
para efectuar b&uacute;squedas desde la ventana de lectura y usar&aacute;
todas las bibliotecas como amplitud predeterminada para efectuar b&uacute;squedas
mediante Editor de consultas.</para>
<para>Podr&aacute; seleccionar otra amplitud de b&uacute;squeda mediante el
bot&oacute;n Amplitud de b&uacute;squeda que se encuentra en la parte inferior
de la ventana de lectura o podr&aacute; utilizar el bot&oacute;n Nombre de
la amplitud de Editor de consultas.</para>
<sect3 id="INFOUG.Search.div.14">
<title id="INFOUG.Search.mkr.14">Selecci&oacute;n de una amplitud desde la
ventana de lectura</title>
<para>Podr&aacute; utilizar el bot&oacute;n Amplitud de b&uacute;squeda para
identificar los libros incluidos en b&uacute;squedas iniciadas desde el campo
B&uacute;squeda r&aacute;pida. Para utilizar una amplitud de b&uacute;squeda
diferente de la que aparece en pantalla:</para>
<orderedlist>
<listitem><para>Haga clic en el bot&oacute;n Amplitud de b&uacute;squeda que
se encuentra a la izquierda del campo B&uacute;squeda r&aacute;pida. Gestor
de informaci&oacute;n pondr&aacute; en pantalla la lista de amplitudes de
b&uacute;squeda que contiene las amplitudes predefinidas y las creadas mediante
Editor de amplitudes.</para>
</listitem>
<listitem><para>Seleccione la amplitud de b&uacute;squeda a utilizar. Gestor
de informaci&oacute;n reemplazar&aacute; el nombre de la amplitud anterior
por el nuevo en el bot&oacute;n Amplitud de b&uacute;squeda. La nueva amplitud
permanecer&aacute; en efecto durante el resto de la sesi&oacute;n o hasta
que se modifique.</para>
</listitem>
</orderedlist>
</sect3>
<sect3 id="INFOUG.Search.div.15">
<title id="INFOUG.Search.mkr.15">Selecci&oacute;n de una amplitud mediante
Editor de consultas</title>
<para>Podr&aacute; utilizar el bot&oacute;n Nombre de la amplitud para especificar
los libros a incluir en b&uacute;squedas iniciadas mediante Editor de consultas.
Para utilizar una amplitud de b&uacute;squeda distinta de la que aparece en
pantalla:</para>
<orderedlist>
<listitem><para>Haga clic en el bot&oacute;n Nombre de la amplitud. Aparecer&aacute;
la lista de nombres de las amplitudes disponibles que contendr&aacute; amplitudes
predefinidas y creadas.</para>
</listitem>
<listitem><para>Seleccione el nombre de la amplitud a utilizar en la lista
de nombres de amplitudes.</para>
</listitem>
</orderedlist>
</sect3>
</sect2>
<sect2 id="INFOUG.Search.div.16">
<title id="INFOUG.Search.mkr.16">Creaci&oacute;n de amplitudes de b&uacute;squeda<indexterm>
<primary>b&uacute;squeda</primary><secondary>creaci&oacute;n de amplitudes</secondary></indexterm><indexterm><primary>b&uacute;squeda</primary><secondary>creaci&oacute;n</secondary></indexterm></title>
<para>Si busca informaci&oacute;n espec&iacute;fica frecuentemente en una
parte de la biblioteca de informaci&oacute;n, se recomienda crear y guardar
una amplitud de b&uacute;squeda personalizada. Podr&aacute; crear y modificar
amplitudes de b&uacute;squeda mediante Editor de amplitud.<indexterm><primary>Editor de amplitud</primary></indexterm></para>
<sect3 id="INFOUG.Search.div.17">
<title id="INFOUG.Search.mkr.17">C&oacute;mo abrir el editor de amplitud de
b&uacute;squeda<indexterm><primary>b&uacute;squeda</primary><secondary>Editor
de b&uacute;squeda</secondary></indexterm><indexterm><primary>Editor de b&uacute;squeda</primary><secondary>abrir</secondary></indexterm><indexterm><primary>amplitud</primary><secondary>abrir el editor</secondary></indexterm></title>
<para>Para abrir Editor de amplitud de b&uacute;squeda desde Editor de consultas,
haga clic en el bot&oacute;n Editor de amplitud de b&uacute;squeda que aparece
en la parte inferior de la ventana Editor de consultas.</para>
<para>Para abrir Editor de amplitud de b&uacute;squeda <?Pub Caret>desde la
ventana de lectura, haga clic en el bot&oacute;n Editor de amplitud de b&uacute;squeda
que aparece en la esquina inferior derecha de la ventana o seleccione Editor
de amplitud del men&uacute; Buscar.</para>
<para>Gestor de informaci&oacute;n mostrar&aacute; la pantalla de Editor de
amplitud como lo indica la figura a continuaci&oacute;n.</para>
<figure>
<title id="INFOUG.Search.mkr.16a">Ventana Editor de amplitud</title>
<graphic id="INFOUG.Search.igrph.4" entityref="INFOUG.Search.fig.4"></graphic>
</figure>
</sect3>
<sect3 id="INFOUG.Search.div.18">
<title id="INFOUG.Search.mkr.18">Creaci&oacute;n de una nueva amplitud de
b&uacute;squeda<indexterm><primary>Editor de amplitud</primary><secondary>creaci&oacute;n de una amplitud</secondary></indexterm><indexterm><primary>amplitud</primary><secondary>creaci&oacute;n</secondary></indexterm></title>
<para>El lado izquierdo de la ventana de Editor de amplitud contiene la lista
de libros de la biblioteca de informaci&oacute;n. Podr&aacute; expandir y
contraer dicha lista haciendo clic en las flechas hacia la derecha o hacia
abajo que se encuentran a la izquierda de los t&iacute;tulos de libros.</para>
<para>El lado derecho de la ventana de Editor de amplitud contiene la lista
de componentes de libros que podr&aacute; incluir en la amplitud. Gestor de
informaci&oacute;n incluir&aacute; todos los componentes en la b&uacute;squeda
de forma predeterminada.</para>
<para>Para crear una nueva amplitud de b&uacute;squeda:</para>
<orderedlist>
<listitem><para>Haga clic en el bot&oacute;n Nueva.</para>
</listitem>
<listitem><para>Haga clic en los nombres de los libros y componentes a incluir
en la amplitud.</para>
</listitem>
<listitem><para>Haga clic en el bot&oacute;n Guardar. Gestor de informaci&oacute;n
abrir&aacute; la ventana Guardar amplitud como lo muestra la figura.</para>
<figure>
<title id="INFOUG.Search.mkr.18a">Ventana Guardar amplitud</title>
<graphic id="INFOUG.Search.igrph.5" entityref="INFOUG.Search.fig.5"></graphic>
</figure>
</listitem>
<listitem><para>Escriba el nombre de la nueva amplitud en el campo de introducci&oacute;n
de texto y haga clic en OK. Gestor de informaci&oacute;n mostrar&aacute; el
nombre de la nueva amplitud en la ventana de Editor de amplitud.</para>
</listitem>
</orderedlist>
<para>Para utilizar una nueva amplitud en una consulta podr&aacute; obtener
acceso a la misma de la misma manera que lo har&iacute;a con amplitudes predefinidas.
</para>
</sect3>
<sect3 id="INFOUG.Search.div.19">
<title id="INFOUG.Search.mkr.19">Modificaci&oacute;n de amplitudes de b&uacute;squeda<indexterm>
<primary>Editor de amplitud</primary><secondary>modificaci&oacute;n de la
amplitud</secondary></indexterm><indexterm><primary>amplitud</primary><secondary>modificaci&oacute;n</secondary></indexterm></title>
<para>Para modificar una amplitud existente:</para>
<orderedlist>
<listitem><para>Haga clic en el bot&oacute;n Nombre de la amplitud de la ventana
de Editor de amplitud. Gestor de informaci&oacute;n pondr&aacute; en pantalla
la lista de amplitudes.</para>
</listitem>
<listitem><para>Seleccione la amplitud que desea modificar. El nombre de la
amplitud seleccionada aparecer&aacute; en el bot&oacute;n Nombre de la amplitud.
</para>
</listitem>
<listitem><para>Para cambiar los libros incluidos en la amplitud, realce sus
t&iacute;tulos.</para>
</listitem>
<listitem><para>Para cambiar los componentes incluidos en la amplitud, realce
sus nombres.</para>
</listitem>
<listitem><para>Haga clic en el bot&oacute;n Guardar para guardar los cambios
efectuados.</para>
</listitem>
<listitem><para>Cuando haya terminado de modificar, haga clic en el bot&oacute;n
Cerrar.</para>
</listitem>
</orderedlist>
<note>
<para>Para restaurar la definici&oacute;n inicial de la amplitud, haga clic
en el bot&oacute;n Restablecer que se encuentra en la parte inferior de la
ventana.</para>
</note>
<para>Gestor de informaci&oacute;n conservar&aacute; como amplitud actual
la utilizada para realizar b&uacute;squedas anteriormente. Si ha modificado
la amplitud actual, Gestor de informaci&oacute;n aplicar&aacute; las modificaciones
en la pr&oacute;xima b&uacute;squeda realizada mediante dicha amplitud.</para>
</sect3>
<sect3 id="INFOUG.Search.div.20">
<title id="INFOUG.Search.mkr.20">Copia de amplitudes de b&uacute;squeda<indexterm>
<primary>Editor de amplitud</primary><secondary>copia de amplitudes</secondary>
</indexterm><indexterm><primary>amplitud</primary><secondary>copia</secondary>
</indexterm></title>
<para>Para copiar una amplitud de b&uacute;squeda:</para>
<orderedlist>
<listitem><para>Haga clic en el bot&oacute;n Nombre de la amplitud de la ventana
Editor de amplitud. Gestor de informaci&oacute;n pondr&aacute; en pantalla
la lista de amplitudes.</para>
</listitem>
<listitem><para>Seleccione la copia que desea copiar. El nombre de la amplitud
seleccionada aparecer&aacute; en el bot&oacute;n Nombre de la amplitud.</para>
</listitem>
<listitem><para>Haga clic en el bot&oacute;n Copiar que se encuentra en la
parte inferior de la ventana. Gestor de informaci&oacute;n pondr&aacute; en
pantalla la ventana Guardar amplitud.</para>
</listitem>
<listitem><para>Escriba el nombre de la copia y haga clic en OK para guardarla.
</para>
</listitem>
</orderedlist>
<para>Note que la amplitud continuar&aacute; existiendo con su antiguo nombre.
Refi&eacute;rase a <xref role="JumpText" linkend="INFOUG.Search.mkr.21"> para
obtener instrucciones sobre la eliminaci&oacute;n de amplitudes.</para>
</sect3>
<sect3 id="INFOUG.Search.div.21">
<title id="INFOUG.Search.mkr.21">Eliminaci&oacute;n de amplitudes de b&uacute;squeda<indexterm>
<primary>Editor de amplitud</primary><secondary>eliminaci&oacute;n de amplitudes</secondary></indexterm><indexterm><primary>amplitud</primary><secondary>eliminaci&oacute;n</secondary></indexterm></title>
<para>Para eliminar una amplitud de b&uacute;squeda guardada anteriormente:
</para>
<orderedlist>
<listitem><para>Haga clic en el bot&oacute;n Nombre de la amplitud de la ventana
Editor de amplitud. Gestor de informaci&oacute;n pondr&aacute; en pantalla
la lista de amplitudes.</para>
</listitem>
<listitem><para>Seleccione la amplitud que desea eliminar. El nombre de la
amplitud seleccionada aparecer&aacute; en el bot&oacute;n Nombre de la amplitud.
</para>
</listitem>
<listitem><para>Haga clic en el bot&oacute;n Suprimir que se encuentra en
la parte inferior de la ventana. Gestor de informaci&oacute;n eliminar&aacute;
la amplitud y pondr&aacute; en pantalla la pr&oacute;xima amplitud de b&uacute;squeda
de la lista de amplitudes de b&uacute;squeda.</para>
</listitem>
</orderedlist>
</sect3>
</sect2>
</sect1>
<sect1 id="INFOUG.Search.div.22">
<title id="INFOUG.Search.mkr.22">Puesta en pantalla de resultados de b&uacute;squeda<indexterm>
<primary>b&uacute;squeda</primary><secondary>puesta en pantalla de resultados</secondary></indexterm><indexterm><primary>resultados de b&uacute;squeda</primary></indexterm></title>
<para>Despu&eacute;s de efectuar la b&uacute;squeda, Gestor de informaci&oacute;n
mostrar&aacute; una lista de secciones que contienen el texto buscado. La
lista aparecer&aacute; en la ventana Resultados de b&uacute;squeda desde la
que podr&aacute; ir a las secciones listadas haciendo clic en su t&iacute;tulo.
</para>
<para>La figura a continuaci&oacute;n muestra c&oacute;mo se listan las secciones
que contienen el texto buscado en orden descendiente seg&uacute;n su importancia.
El icono que aparece a la izquierda del t&iacute;tulo del libro indica la
cantidad de veces que el texto buscado aparece en una secci&oacute;n espec&iacute;fica.
</para>
<figure>
<title id="INFOUG.Search.mkr.22a">Ventana Resultados de b&uacute;squeda</title>
<graphic id="INFOUG.Search.igrph.6" entityref="INFOUG.Search.fig.6"></graphic>
</figure>
<para>Si la lista Resultados de b&uacute;squeda parece estar incompleta, es
demasiado larga o tiene errores, verifique si ha utilizado la amplitud de
b&uacute;squeda correspondiente. Tambi&eacute;n compruebe la preferencia configurada
para la cantidad m&aacute;xima de elementos encontrados.</para>
<para>Si se efect&uacute;an varias b&uacute;squedas, se recomienda primero
sujetar la ventana Resultados de b&uacute;squeda. Cuando efect&uacute;e otra
b&uacute;squeda, los nuevos resultados no reemplazar&aacute;n los de la primera
b&uacute;squeda ya que aparecer&aacute;n en otra ventana Resultados de b&uacute;squeda.
</para>
<sect2 id="INFOUG.Search.div.23">
<title id="INFOUG.Search.mkr.23">Examinaci&oacute;n de resultados de b&uacute;squeda<indexterm>
<primary>b&uacute;squeda</primary><secondary>examinaci&oacute;n de elementos
encontrados</secondary></indexterm><indexterm><primary>resultados de b&uacute;squeda</primary><secondary>examinaci&oacute;n de elementos encontrados</secondary>
</indexterm></title>
<para>Despu&eacute;s de ir a una secci&oacute;n desde la lista Resultados
de b&uacute;squeda, podr&aacute; ver cada elemento encontrado en una secci&oacute;n.
Los elementos encontrados aparecen en texto en negrita, subrayados y en un
color diferente. Un rect&aacute;ngulo formado por l&iacute;neas de punto aparecer&aacute;
alrededor del elemento encontrado en el que est&aacute; ubicado.</para>
<para>Para examinar elementos encontrados en una secci&oacute;n, utilice los
botones B&uacute;squeda siguiente y B&uacute;squeda anterior de la barra de
herramientas de la ventana de lectura. (Tambi&eacute;n podr&aacute; seleccionar
las opciones B&uacute;squeda siguiente y B&uacute;squeda anterior del men&uacute;
Ir.)</para>
<graphic id="INFOUG.Search.igrph.7" entityref="INFOUG.Search.fig.7"></graphic>
<para>B&uacute;squeda siguiente pondr&aacute; en pantalla el pr&oacute;ximo
elemento encontrado. B&uacute;squeda anterior pondr&aacute; en pantalla el
elemento encontrado anterior.</para>
<para>Si se encuentra en el &uacute;ltimo elemento encontrado en la secci&oacute;n,
el bot&oacute;n B&uacute;squeda siguiente aparecer&aacute; atenuado. Si se
encuentra en el primer elemento encontrado en la secci&oacute;n, el bot&oacute;n
B&uacute;squeda anterior aparecer&aacute; atenuado.</para>
</sect2>
<sect2 id="INFOUG.Search.div.24">
<title id="INFOUG.Search.mkr.24">Examinaci&oacute;n de una b&uacute;squeda
anterior<indexterm><primary>b&uacute;squeda</primary><secondary>examinaci&oacute;n
de resultados anteriores</secondary></indexterm><indexterm><primary>resultados
de b&uacute;squeda</primary><secondary>examinaci&oacute;n de anteriores</secondary>
</indexterm></title>
<para>Si no ha sujetado la ventana de resultado de la b&uacute;squeda anterior,
podr&aacute; recuperar esta lista de todas maneras. Para examinar la lista
de resultados de b&uacute;squedas anteriores:</para>
<orderedlist>
<listitem><para>Seleccione la opci&oacute;n Historial de b&uacute;squeda del
men&uacute; Buscar de ventanas de lectura.</para>
<para>Gestor de informaci&oacute;n pondr&aacute; en pantalla la ventana Historial
de resultados de b&uacute;squeda.</para>
<figure>
<title id="INFOUG.Search.mkr.24a">Ventana Historial de resultados de b&uacute;squeda</title>
<graphic id="INFOUG.Search.igrph.8" entityref="INFOUG.Search.fig.8"></graphic>
</figure>
</listitem>
<listitem><para>Haga doble clic en la b&uacute;squeda cuyos resultados desea
ver.</para>
<para>Gestor de informaci&oacute;n pondr&aacute; en pantalla la ventana Resultados
de b&uacute;squeda correspondiente a la b&uacute;squeda seleccionada.</para>
</listitem>
</orderedlist>
<para>S&oacute;lo podr&aacute; obtener los resultados de b&uacute;squedas
realizadas durante la sesi&oacute;n actual del examinador.</para>
</sect2>
</sect1>
</chapter>
<?Pub *0000049288>
