<!-- $XConsortium: ch05.sgm /main/2 1996/12/20 19:30:15 rws $ -->
<!-- (c) Copyright 1996 Digital Equipment Corporation. -->
<!-- (c) Copyright 1996 Hewlett-Packard Company. -->
<!-- (c) Copyright 1996 International Business Machines Corp. -->
<!-- (c) Copyright 1996 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1996 Novell, Inc. -->
<!-- (c) Copyright 1996 FUJITSU LIMITED. -->
<!-- (c) Copyright 1996 Hitachi. -->
<chapter id="INFOUG.Bkmarks.div.1">
<title id="INFOUG.Bkmarks.mkr.1">Utilizaci&oacute;n de marcadores de libros
y notas<indexterm><primary>marcadores de libros</primary><secondary>utilizaci&oacute;n</secondary></indexterm></title>
<para>Podr&aacute; identificar secciones espec&iacute;ficas y agregar comentarios
como lo har&iacute;a en un libro impreso, si as&iacute; lo desea. Para personalizar
libros en l&iacute;nea de esta manera, podr&aacute; crear <firstterm>marcadores
de libros</firstterm> y colocar <firstterm>notas</firstterm> al lado de texto
o gr&aacute;ficos.</para>
<para>Un marcador de libro es una marca de lugar. Una nota es un marcador
de libro que contiene anotaciones. El examinador representa marcadores de
libros y notas mediante iconos que aparecen en el margen izquierdo de la ventana
de lectura.</para>
<para>La figura a continuaci&oacute;n muestra un marcador de libro.</para>
<figure>
<title id="INFOUG.Bkmarks.mkr.1a">Marcador de libro en blanco</title>
<graphic id="INFOUG.Bkmarks.igrph.1" entityref="INFOUG.Bkmarks.fig.1"></graphic>
</figure>
<para>La figura a continuaci&oacute;n muestra una nota.</para>
<figure>
<title id="INFOUG.Bkmarks.mkr.1b">Marcador de libro con notas</title>
<graphic id="INFOUG.Bkmarks.igrph.2" entityref="INFOUG.Bkmarks.fig.2"></graphic>
</figure>
<para>Una l&iacute;nea puede contener varios marcadores de libro. La figura
a continuaci&oacute;n muestra marcadores de libros m&uacute;ltiples.</para>
<figure>
<title id="INFOUG.Bkmarks.mkr.1c">Marcadores de libros m&uacute;ltiples</title>
<graphic id="INFOUG.Bkmarks.igrph.3" entityref="INFOUG.Bkmarks.fig.3"></graphic>
</figure>
<para>Los marcadores de libros y notas que crea en Gestor de informaci&oacute;n
son personales, es decir, otros usuarios no podr&aacute;n obtener acceso a
los mismos. Para crear marcadores de libros y notas, utilice el men&uacute;
Marcas de la ventana de lectura.</para>
<sect1 id="INFOUG.Bkmarks.div.2">
<title id="INFOUG.Bkmarks.mkr.2">Creaci&oacute;n de marcadores de libros<indexterm>
<primary>marcadores de libros</primary><secondary>creaci&oacute;n</secondary>
</indexterm></title>
<para>Podr&aacute; crear un marcador de libro en blanco para marcar la posici&oacute;n
en la que se encuentra o crear un marcador de libro con notas.</para>
<note>
<para>Podr&aacute; modificar un marcador de libro en blanco existente para
agregar notas en todo momento.</para>
</note>
<sect2 id="INFOUG.Bkmarks.div.3">
<title id="INFOUG.Bkmarks.mkr.3">Creaci&oacute;n de un marcador de libro en
blanco<indexterm><primary>marcador de libros</primary><secondary>creaci&oacute;n
de marcadores en blanco</secondary></indexterm><indexterm><primary>marcador
de libros en blanco</primary><secondary>creaci&oacute;n</secondary></indexterm></title>
<para>Para crear un marcador de libro en blanco:</para>
<orderedlist>
<listitem><para>Realce el texto o gr&aacute;fico que desea marcar. (Coloque
el puntero en el comienzo del texto. Mantenga presionado el bot&oacute;n izquierdo
del rat&oacute;n y arrastre hasta el final del texto.)</para>
</listitem>
<listitem><para>Seleccione la opci&oacute;n Crear marcador de libro del men&uacute;
Marcas.</para>
<para>Gestor de informaci&oacute;n pondr&aacute; en pantalla el icono de marcador
de libro en el margen izquierdo de la l&iacute;nea que contiene el texto realzado.
El texto seleccionado se utilizar&aacute; como nombre de marcador de libro
de forma predeterminada. Para obtener informaci&oacute;n acerca de la modificaci&oacute;n
de nombres de marcador de libro, refi&eacute;rase a <xref role="JumpText"
linkend="INFOUG.Bkmarks.mkr.7">.</para>
</listitem>
</orderedlist>
</sect2>
<sect2 id="INFOUG.Bkmarks.div.4">
<title id="INFOUG.Bkmarks.mkr.4">Creaci&oacute;n de un marcador de libro con
notas<indexterm><primary>marcadores de libros</primary><secondary>creaci&oacute;n
con notas</secondary></indexterm></title>
<para>Efect&uacute;e las siguientes operaciones para crear un marcador de
libro con notas:</para>
<orderedlist>
<listitem><para>Realce el texto o gr&aacute;fico que desea marcar.</para>
</listitem>
<listitem><para>Seleccione la opci&oacute;n Crear nota del men&uacute; Marcas.
</para>
<para>Gestor de informaci&oacute;n pondr&aacute; en pantalla Editor de marcador
de libros.</para>
</listitem>
<listitem><para>Escriba el texto en el campo Notas.</para>
</listitem>
<listitem><para>Haga clic en OK para guardar la nota y cerrar Editor de marcador
de libros.</para>
</listitem>
</orderedlist>
<para>Tambi&eacute;n podr&aacute; agregar notas a un marcador de libro en
blanco existente. Refi&eacute;rase a<xref role="JumpText" linkend="INFOUG.Bkmarks.div.7">
para obtener informaci&oacute;n adicional.</para>
</sect2>
</sect1>
<sect1 id="INFOUG.Bkmarks.div.5">
<title id="INFOUG.Bkmarks.mkr.5">Listado de marcadores de libros<indexterm>
<primary>marcadores de libros</primary><secondary>listados</secondary></indexterm></title>
<para>Para poner en pantalla la lista de marcadores de libros, seleccione
la opci&oacute;n Listar marcas del men&uacute; Marcas de la ventana de lectura.
Gestor de informaci&oacute;n pondr&aacute; en pantalla la ventana de la lista
de marcas del usuario que contendr&aacute; los marcadores de libro en blanco
y con notas.</para>
<para>Para poner en pantalla la secci&oacute;n en la que aparece el marcador
de libro, haga doble clic en el nombre de &eacute;ste.</para>
</sect1>
<sect1 id="INFOUG.Bkmarks.div.6">
<title id="INFOUG.Bkmarks.mkr.6">Puesta en pantalla de marcadores de libro
y notas<indexterm><primary>marcadores de libro</primary><secondary>puesta
en pantalla</secondary></indexterm></title>
<para>Para ver un marcador de libro existente y sus notas, haga doble clic
en el icono del marcador de libro de la ventana de lectura. Gestor de informaci&oacute;n
abrir&aacute; la ventana de Editor de marcador de libros que aparece en la
siguiente figura. Mediante Editor de marcador de libros podr&aacute; modificar
el nombre y las notas del marcador de libro. Para poner en pantalla un marcador
de libro existente y sus notas, haga doble clic en el icono del marcador de
libro de la ventana de lectura.</para>
<figure>
<title id="INFOUG.Bkmarks.mkr.6a">Editor de marcador de libros</title>
<graphic id="INFOUG.Bkmarks.igrph.4" entityref="INFOUG.Bkmarks.fig.4"></graphic>
</figure>
<para>Si aparecen varios marcadores de libro en una l&iacute;nea, Gestor de
informaci&oacute;n los representar&aacute; mediante un icono que tiene el
aspecto de marcadores de libro m&uacute;ltiples. Para ver los marcadores de
libro de una l&iacute;nea, haga doble clic en el icono de marcadores de libro
m&uacute;ltiples. Podr&aacute; seleccionar el marcador de libro a poner en
pantalla en la lista Editar marca.</para>
</sect1>
<sect1 id="INFOUG.Bkmarks.div.7">
<title id="INFOUG.Bkmarks.mkr.7">Modificaci&oacute;n de marcadores de libro<indexterm>
<primary>marcador de libro</primary><secondary>modificaci&oacute;n</secondary>
</indexterm></title>
<para>Podr&aacute; agregar comentarios a un marcador de libro en blanco o
modificar comentarios escritos durante una sesi&oacute;n anterior del examinador,
si as&iacute; lo desea.</para>
<para>Para modificar o agregar notas a un marcador de libro:</para>
<orderedlist>
<listitem><para>Haga clic en el icono del marcador de libro que desea modificar.
</para>
</listitem>
<listitem><para>Seleccione la opci&oacute;n Editar selecci&oacute;n del men&uacute;
Marcas.</para>
<para>Gestor de informaci&oacute;n abrir&aacute; Editor de marcador de libros
que pondr&aacute; en pantalla el nombre del marcador de libro y sus notas.
</para>
</listitem>
<listitem><para>Escriba las modificaciones en el nombre del marcador de libro
o notas.</para>
</listitem>
<listitem><para>Cuando haya terminado de modificar, haga clic en OK.</para>
</listitem>
</orderedlist>
<tip>
<para>Como atajo, podr&aacute; abrir Editor de marcador de libro<?Pub Caret>s
haciendo doble clic en el icono del marcador de libro.</para>
</tip>
</sect1>
<sect1 id="INFOUG.Bkmarks.div.8">
<title id="INFOUG.Bkmarks.mkr.8">C&oacute;mo mover marcadores de libro<indexterm>
<primary>marcadores de libro</primary><secondary>c&oacute;mo mover</secondary>
</indexterm></title>
<para>Podr&aacute; trasladar un marcador de libro desde su ubicaci&oacute;n
actual a otra en la misma ventana de lectura. Efect&uacute;e las siguientes
operaciones para mover un marcador de libro:</para>
<orderedlist>
<listitem><para>Haga clic en el icono del marcador de libro que desea mover.
</para>
</listitem>
<listitem><para>Realce texto que se encuentra en la l&iacute;nea a la que
desea mover el marcador de libro.</para>
</listitem>
<listitem><para>Seleccione la opci&oacute;n Mover selecci&oacute;n del men&uacute;
Marcas.</para>
</listitem>
</orderedlist>
</sect1>
<sect1 id="INFOUG.Bkmarks.div.9">
<title id="INFOUG.Bkmarks.mkr.9">Eliminaci&oacute;n de marcadores de libro
y notas<indexterm><primary>marcadores de libro</primary><secondary>eliminaci&oacute;n</secondary></indexterm></title>
<para>Podr&aacute; eliminar marcadores de libro que no desea conservar. Efect&uacute;e
las siguientes operaciones para eliminar un marcador de libro:</para>
<orderedlist>
<listitem><para>Haga clic en el icono del marcador de libro que desea eliminar.
</para>
</listitem>
<listitem><para>Seleccione la opci&oacute;n Eliminar selecci&oacute;n del
men&uacute; Marcas.</para>
<para>Gestor de informaci&oacute;n eliminar&aacute; el marcador seleccionado
del margen del libro.</para>
</listitem>
</orderedlist>
</sect1>
</chapter>
<?Pub *0000027575>
