<!-- $XConsortium: ch06.sgm /main/2 1996/12/20 19:30:21 rws $ -->
<!-- (c) Copyright 1996 Digital Equipment Corporation. -->
<!-- (c) Copyright 1996 Hewlett-Packard Company. -->
<!-- (c) Copyright 1996 International Business Machines Corp. -->
<!-- (c) Copyright 1996 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1996 Novell, Inc. -->
<!-- (c) Copyright 1996 FUJITSU LIMITED. -->
<!-- (c) Copyright 1996 Hitachi. -->
<chapter id="INFOUG.Mngrafx.div.1">
<title id="INFOUG.Mngrafx.mkr.1">Gesti&oacute;n de gr&aacute;ficos<indexterm>
<primary>gr&aacute;ficos</primary><secondary>gesti&oacute;n</secondary></indexterm><indexterm>
<primary>gr&aacute;ficos</primary></indexterm></title>
<para>Puede eliminar gr&aacute;ficos del flujo de documentos, colocarlos en
una ventana individual para verlos o manipularlos, es decir, ajustar la escala,
si as&iacute; lo desea. Dicho tipo de gr&aacute;fico se llama gr&aacute;fico
"desvinculado". A continuaci&oacute;n se listan algunas de las razones debido
a las cuales puede ser necesario desvincular un gr&aacute;fico:</para>
<itemizedlist>
<listitem><para>Al mantener un gr&aacute;fico en pantalla podr&aacute; utilizarlo
como referencia mientras contin&uacute;a leyendo.</para>
</listitem>
<listitem><para>Al desvincular un gr&aacute;fico podr&aacute; comparar im&aacute;genes
de la misma u otras secciones.</para>
</listitem>
<listitem><para>Despu&eacute;s de desvincular un gr&aacute;fico de gran tama&ntilde;o
o que simplemente no cabe en el ancho predeterminado de la ventana de lectura,
podr&aacute; modificar la escala de la imagen gr&aacute;fica sin cambiar el
tama&ntilde;o de la ventana de lectura.</para>
</listitem>
<listitem><para>Debido a que la ubicaci&oacute;n de algunos gr&aacute;ficos
de gran tama&ntilde;o puede interrumpir el flujo de texto, podr&aacute; mejorar
la legibilidad de una secci&oacute;n desvinculando sus gr&aacute;ficos.</para>
</listitem>
</itemizedlist>
<para>Podr&aacute; manipular y gestionar gr&aacute;ficos desvinculados f&aacute;cilmente,
es decir, podr&aacute;:</para>
<itemizedlist>
<listitem><para>Modificar el tama&ntilde;o de la ventana del gr&aacute;fico
y la posici&oacute;n del bot&oacute;n de panor&aacute;mica. Refi&eacute;rase
a <xref role="JumpText" linkend="INFOUG.Mngrafx.div.3">.</para>
</listitem>
<listitem><para>Modificar el tama&ntilde;o de gr&aacute;ficos. Refi&eacute;rase
a <xref role="JumpText" linkend="INFOUG.Mngrafx.div.4">.</para>
</listitem>
<listitem><para>Buscar la secci&oacute;n original de gr&aacute;ficos. Refi&eacute;rase
a <xref role="JumpText" linkend="INFOUG.Mngrafx.div.5">.</para>
</listitem>
<listitem><para>Volver a vincular gr&aacute;ficos. Refi&eacute;rase a <xref
role="JumpText" linkend="INFOUG.Mngrafx.div.7">.</para>
</listitem>
</itemizedlist>
<sect1 id="INFOUG.Mngrafx.div.2">
<title id="INFOUG.Mngrafx.mkr.2">Desvinculaci&oacute;n de gr&aacute;ficos<indexterm>
<primary>gr&aacute;ficos</primary><secondary>desvinculaci&oacute;n</secondary>
</indexterm></title>
<para>Para desvincular un gr&aacute;fico de un libro:</para>
<orderedlist>
<listitem><para>Seleccione Desvincular gr&aacute;fico en el men&uacute; Opciones.
Gestor de informaci&oacute;n pondr&aacute; en pantalla un cursor en forma
de hilo de mira.</para>
</listitem>
<listitem><para>Mediante el puntero del rat&oacute;n, haga clic en el gr&aacute;fico
a desvincular. (Para cancelar la operaci&oacute;n, haga clic en cualquier
lugar fuera del gr&aacute;fico.)</para>
</listitem>
</orderedlist>
<para>Tambi&eacute;n podr&aacute; desvincular un gr&aacute;fico colocando
el puntero en el mismo y haciendo clic con el bot&oacute;n derecho del rat&oacute;n.
Seleccione la opci&oacute;n Desvincular gr&aacute;fico del men&uacute; emergente.
</para>
<para>Si se ha seleccionado un gr&aacute;fico, Gestor de informaci&oacute;n
pondr&aacute; en pantalla una ventana individual y aparecer&aacute; un icono
de gr&aacute;fico desvinculado en la ventana de lectura en vez del gr&aacute;fico.
</para>
<sidebar>
<graphic id="INFOUG.Mngrafx.igrph.1" entityref="INFOUG.Mngrafx.fig.1"></graphic>
</sidebar>
<para>La figura a continuaci&oacute;n muestra un ejemplo de ventana de gr&aacute;fico
desvinculado.</para>
<figure>
<title id="INFOUG.Mngrafx.mkr.1a">Ventana Gr&aacute;fico desvinculado</title>
<graphic id="INFOUG.Mngrafx.igrph.2" entityref="INFOUG.Mngrafx.fig.2"></graphic>
</figure>
<para>El gr&aacute;fico desvinculado permanecer&aacute; en una ventana individual
hasta que lo vuelva a vincular, hasta que cierre la ventana gr&aacute;fica
o finalice la sesi&oacute;n del examinador. Esto significa que durante una
sesi&oacute;n podr&aacute; cerrar la secci&oacute;n en la que ha aparecido
el gr&aacute;fico mientras &eacute;ste permanece en una ventana individual.
</para>
</sect1>
<sect1 id="INFOUG.Mngrafx.div.3">
<title id="INFOUG.Mngrafx.mkr.3">Modificaci&oacute;n del tama&ntilde;o de
la ventana de gr&aacute;ficos<indexterm><primary>gr&aacute;ficos</primary>
<secondary>modificaci&oacute;n del tama&ntilde;o de la ventana</secondary>
</indexterm></title>
<para>Para modificar el tama&ntilde;o de la ventana de gr&aacute;ficos, utilice
el rat&oacute;n para arrastrar y estirar los bordes de la ventana o use el
bot&oacute;n para maximizar que se encuentra en la esquina superior derecha
del marco de la ventana.</para>
<para>Una vez que reduzca el tama&ntilde;o de la ventana del gr&aacute;fico
desvinculado, Gestor de informaci&oacute;n pondr&aacute; un elemento para
panor&aacute;mica en una esquina de la ventana. Para ver partes ocultas del
gr&aacute;fico despu&eacute;s de reducir el tama&ntilde;o de la ventana, mueva
el elemento para panor&aacute;mica para que aparezcan las secciones que desea
ver. La figura a continuaci&oacute;n muestra la ventana Gr&aacute;fico desvinculado
con un elemento para panor&aacute;mica ubicado en la esquina superior izquierda
de la ventana.<indexterm><primary>panor&aacute;mica</primary><secondary>con
ventana de gr&aacute;fico desvinculado</secondary></indexterm></para>
<figure>
<title id="INFOUG.Mngrafx.mkr.2a">Panor&aacute;mica</title>
<graphic id="INFOUG.Mngrafx.igrph.3" entityref="INFOUG.Mngrafx.fig.3"></graphic>
</figure>
<para>Para trasladar el elemento para panor&aacute;mica a otra esquina de
la ventana o para quitarlo, seleccione la ubicaci&oacute;n deseada en el men&uacute;
Panor&aacute;mica. Gestor de informaci&oacute;n trasladar&aacute; el elemento
para panor&aacute;mica a la esquina seleccionada o lo eliminar&aacute;.</para>
</sect1>
<sect1 id="INFOUG.Mngrafx.div.4">
<title id="INFOUG.Mngrafx.mkr.4">Modificaci&oacute;n del tama&ntilde;o de
gr&aacute;ficos<indexterm><primary>gr&aacute;ficos</primary><secondary>modificaci&oacute;n
del tama&ntilde;o</secondary></indexterm></title>
<para>Podr&aacute; utilizar las opciones del men&uacute; Ver para especificar
el aspecto de un gr&aacute;fico cuya escala se puede modificar, en la ventana
Gr&aacute;fico desvinculado. Estas opciones estar&aacute;n inactivas en gr&aacute;ficos
cuya escala no se puede modificar:</para>
<variablelist>
<varlistentry><term>Ajustar a la ventana</term>
<listitem>
<para>Modifica el tama&ntilde;o del gr&aacute;fico para que quepa dentro del
&aacute;rea delimitada por los bordes de la ventana Gr&aacute;fico desvinculado.
</para>
</listitem>
</varlistentry>
<varlistentry><term>Ajustar al gr&aacute;fico</term>
<listitem>
<para>Modifica el tama&ntilde;o de la ventana Gr&aacute;fico desvinculado
para que el gr&aacute;fico quepa.</para>
</listitem>
</varlistentry>
<varlistentry><term>Porcentajes de escala</term>
<listitem>
<para>Aumentan o disminuyen el tama&ntilde;o del gr&aacute;fico en relaci&oacute;n
con su tama&ntilde;o inicial.</para>
</listitem>
</varlistentry>
<varlistentry><term>Personalizado</term>
<listitem>
<para>Especifica el porcentaje de escala del gr&aacute;fico que aparece en
pantalla.</para>
</listitem>
</varlistentry>
</variablelist>
</sect1>
<sect1 id="INFOUG.Mngrafx.div.5">
<title id="INFOUG.Mngrafx.mkr.5">B&uacute;squeda de la secci&oacute;n original
de un gr&aacute;fico<indexterm><primary>gr&aacute;ficos</primary><secondary>b&uacute;squeda de la secci&oacute;n</secondary></indexterm></title>
<para>Desde una ventana Gr&aacute;fico desvinculado podr&aacute; abrir la
secci&oacute;n desde la cual se ha desvinculado el gr&aacute;fico. Para abrir
dicha secci&oacute;n, seleccione la opci&oacute;n Mostrar secci&oacute;n del
men&uacute; Archivo de la ventana Archivo desvinculado. Gestor de informaci&oacute;n
abrir&aacute; la ventana desde la cual ha desvinculado el gr&aacute;fico y
la colocar&aacute; sobre las otras ventanas.</para>
</sect1>
<sect1 id="INFOUG.Mngrafx.div.7">
<title id="INFOUG.Mngrafx.mkr.7">C&oacute;mo volver a vincular gr&aacute;ficos<indexterm>
<primary>gr&aacute;ficos</primary><secondary>volver a vincular</secondary>
</indexterm></title>
<para>Podr&aacute; reemplazar un gr&aacute;fico de un libro desde el cual
lo ha desvinculado mediante uno de los siguientes m&eacute;todos:</para>
<itemizedlist>
<listitem><para>Seleccione la opci&oacute;n Vincular del men&uacute; Archivo
de la ventana Gr&aacute;fico desvinculado.</para>
</listitem>
<listitem><para>Seleccione la opci&oacute;n Cerrar del men&uacute; Archivo
de la ventana Gr&aacute;fico desvinculado.</para>
</listitem>
<listitem><para>Haga doble clic en el bot&oacute;n de men&uacute; Ventana
que se encuentra en la esquina superior izquierda de la ventana Gr&aacute;fico
desvinculado.</para>
</listitem>
<listitem><para>Coloque el puntero en el gr&aacute;fico y haga clic mediante
el bot&oacute;n derecho del rat&oacute;n. Seleccione la opci&oacute;n Vincular<?Pub Caret> gr&aacute;fico
del men&uacute; emergente.</para>
</listitem>
</itemizedlist>
<para>Gestor de informaci&oacute;n cerrar&aacute; la ventana Gr&aacute;fico
desvinculado y volver&aacute; a colocar el gr&aacute;fico en el libro, aun
si el libro no est&aacute; abierto.</para>
</sect1>
</chapter>
<?Pub *0000027566>
