<!-- $XConsortium: ch07.sgm /main/3 1996/12/20 20:08:02 rws $ -->
<!-- (c) Copyright 1996 Digital Equipment Corporation. -->
<!-- (c) Copyright 1996 Hewlett-Packard Company. -->
<!-- (c) Copyright 1996 International Business Machines Corp. -->
<!-- (c) Copyright 1996 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1996 Novell, Inc. -->
<!-- (c) Copyright 1996 FUJITSU LIMITED. -->
<!-- (c) Copyright 1996 Hitachi. -->
<chapter id="INFOUG.Printing.div.1">
<title id="INFOUG.Printing.mkr.1">Impresi&oacute;n<indexterm><primary>impresi&oacute;n</primary></indexterm></title>
<para>Mediante Gestor de informaci&oacute;n podr&aacute; imprimir desde partes
de libros hasta todo un estante de libros. Tambi&eacute;n podr&aacute; especificar
f&aacute;cilmente la impresora a utilizar o un archivo al cual enviar los
datos de impresi&oacute;n.</para>
<note>
<para>S&oacute;lo podr&aacute; imprimir los documentos para los cuales cuenta
con autorizaci&oacute;n.</para>
</note>
<para>Para imprimir r&aacute;pidamente (sin utilizar el cuadro de di&aacute;logo
Imprimir), haga clic en el bot&oacute;n Imprimir de la ventana de lista de
libros o lectura. Tambi&eacute;n podr&aacute; seleccionar la opci&oacute;n
Imprimir del men&uacute; Archivo de la ventana de lista de libros o del men&uacute;
Examinador de una ventana de lectura.</para>
<para>Para imprimir mediante el cuadro de di&aacute;logo Imprimir, seleccione
la opci&oacute;n Imprimir... del men&uacute; Archivo de la ventana de lista
de libros o del men&uacute; Examinador de una ventana de lectura. Al efectuar
esta operaci&oacute;n, Gestor de informaci&oacute;n pone en pantalla el cuadro
de di&aacute;logo Imprimir que muestra la figura a continuaci&oacute;n.</para>
<figure>
<title id="INFOUG.Printing.mkr.1a">Cuadro de di&aacute;logo Imprimir</title>
<graphic id="INFOUG.Printing.igrph.1" entityref="INFOUG.Printing.fig.1"></graphic>
</figure>
<para>El cuadro de di&aacute;logo Imprimir contiene los siguientes botones:
</para>
<variablelist>
<varlistentry><term>Imprimir</term>
<listitem>
<para>Env&iacute;a las secciones seleccionadas al archivo o impresora seleccionados.
</para>
</listitem>
</varlistentry>
<varlistentry><term>Configurar...</term>
<listitem>
<para>Pone en pantalla la ventana Configurar impresi&oacute;n. Desde esta
ventana podr&aacute; configurar opciones espec&iacute;ficas para la impresora
y definir opciones de las impresoras y tareas.</para>
</listitem>
</varlistentry>
<varlistentry><term>Cancelar</term>
<listitem>
<para>Cancela la operaci&oacute;n de impresi&oacute;n y cierra el cuadro de
di&aacute;logo Imprimir.</para>
</listitem>
</varlistentry>
<varlistentry><term>Ayuda</term>
<listitem>
<para>Pone en pantalla informaci&oacute;n de ayuda acerca del cuadro de di&aacute;logo
Imprimir.</para>
</listitem>
</varlistentry>
</variablelist>
<para>Para obtener informaci&oacute;n adicional acerca de la impresi&oacute;n
mediante Gestor de informaci&oacute;n, refi&eacute;rase a:</para>
<itemizedlist>
<listitem><para><xref role="JumpText" linkend="INFOUG.Printing.div.3"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Printing.div.4"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Printing.div.7"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Printing.div.8"></para>
</listitem>
</itemizedlist>
<sect1 id="INFOUG.Printing.div.3">
<title id="INFOUG.Printing.mkr.3">Impresi&oacute;n de secciones espec&iacute;ficas<indexterm>
<primary>impresi&oacute;n</primary><secondary>secciones espec&iacute;ficas</secondary></indexterm></title>
<para>Para imprimir r&aacute;pidamente la secci&oacute;n que est&aacute; leyendo,
haga clic en el bot&oacute;n Imprimir o seleccione la opci&oacute;n Imprimir
del men&uacute; Examinador. Gestor de informaci&oacute;n imprimir&aacute;
la secci&oacute;n sin poner en pantalla el cuadro de di&aacute;logo Imprimir.
</para>
<para>Para imprimir la secci&oacute;n en la que se encuentra mediante el cuadro
de di&aacute;logo Imprimir:</para>
<orderedlist>
<listitem><para>Seleccione la opci&oacute;n Imprimir... del men&uacute; Examinador.
Gestor de informaci&oacute;n pondr&aacute; en pantalla el cuadro de di&aacute;logo
Imprimir que contendr&aacute; la secci&oacute;n seleccionada que est&aacute;
leyendo.</para>
</listitem>
<listitem><para>Aseg&uacute;rese de que el bot&oacute;n de radio Secciones
est&eacute; seleccionado en el &aacute;rea A imprimir.</para>
</listitem>
<listitem><para>Para enviar los datos de impresi&oacute;n de una secci&oacute;n
a un archivo, haga clic en el bot&oacute;n de radio Imprimir en el archivo.
Escriba la ruta de acceso del archivo en el &aacute;rea de introducci&oacute;n
de datos o haga clic en el bot&oacute;n Seleccionar archivo... para buscar
la ruta de acceso y nombre del archivo.</para>
<para>Para imprimir una secci&oacute;n directamente mediante una impresora,
aseg&uacute;rese de que el bot&oacute;n de radio Imprimir en la impresora
est&eacute; seleccionado.</para>
<para>Para obtener informaci&oacute;n adicional, refi&eacute;rase a <xref
role="JumpText" linkend="INFOUG.Printing.mkr.8">.</para>
</listitem>
<listitem><para>Haga clic en Imprimir para imprimir la secci&oacute;n seleccionada.
</para>
</listitem>
</orderedlist>
</sect1>
<sect1 id="INFOUG.Printing.div.4">
<title id="INFOUG.Printing.mkr.4">Impresi&oacute;n de secciones m&uacute;ltiples<indexterm>
<primary>impresi&oacute;n</primary><secondary>secciones m&uacute;ltiples</secondary>
</indexterm></title>
<para>Podr&aacute; imprimir secciones m&uacute;ltiples desde la ventana de
lectura o lista de libros.</para>
<sect2 id="INFOUG.Printing.div.5">
<title id="INFOUG.Printing.mkr.5">Desde la ventana de lectura<indexterm>
<primary>impresi&oacute;n</primary><secondary>desde la ventana de lectura</secondary></indexterm></title>
<para>Para imprimir desde la ventana de lectura:</para>
<orderedlist>
<listitem><para>Seleccione la opci&oacute;n Imprimir... del men&uacute; Examinador.
Gestor de informaci&oacute;n pondr&aacute; en pantalla el cuadro de di&aacute;logo
Imprimir.</para>
</listitem>
<listitem><para>Haga clic en el bot&oacute;n de radio Jerarqu&iacute;a del
&aacute;rea A imprimir. Esta operaci&oacute;n indica a Gestor de informaci&oacute;n
que imprima la secci&oacute;n actual y todas sus secciones subordinadas.</para>
<para>Para obtener informaci&oacute;n adicional, refi&eacute;rase a <xref
role="JumpText" linkend="INFOUG.Printing.mkr.7">.</para>
</listitem>
<listitem><para>Para imprimir secciones en un archivo, haga clic en el bot&oacute;n
de radio Imprimir en archivo. Escriba la ruta de acceso del archivo en el
&aacute;rea de introducci&oacute;n de datos o haga clic en el bot&oacute;n
Seleccionar archivo para buscar la ruta de acceso y el nombre del archivo.
</para>
<para>Para imprimir las secciones directamente mediante una impresora, haga
clic en el bot&oacute;n de radio Imprimir en la impresora.</para>
<para>Para obtener informaci&oacute;n adicional, refi&eacute;rase a <xref
role="JumpText" linkend="INFOUG.Printing.mkr.8">.</para>
</listitem>
<listitem><para>Haga clic en Imprimir para imprimir las secciones seleccionadas.
</para>
</listitem>
</orderedlist>
</sect2>
<sect2 id="INFOUG.Printing.div.6">
<title id="INFOUG.Printing.mkr.6">Desde la ventana de lista de libros<indexterm>
<primary>impresi&oacute;n</primary><secondary>desde la ventana de lista de
libros</secondary></indexterm></title>
<para>Para imprimir desde la ventana de lista de libros:</para>
<orderedlist>
<listitem><para>En la ventana de lista de libros, mantenga presionada la tecla
Control y haga clic en los nombres de las secciones a imprimir.</para>
<para>Para seleccionar un conjunto de secciones contiguas, mantenga presionada
la tecla de may&uacute;sculas mientras arrastra el puntero sobre los nombres
de secci&oacute;n.</para>
<para>Para cancelar la selecci&oacute;n de una secci&oacute;n, mantenga presionada
la tecla Control y haga clic en el nombre de la secci&oacute;n.</para>
</listitem>
<listitem><para>Seleccione la opci&oacute;n Imprimir... del men&uacute; Archivo.
Gestor de informaci&oacute;n pondr&aacute; en pantalla el cuadro de di&aacute;logo
Imprimir.</para>
</listitem>
<listitem><para>En el &aacute;rea A imprimir del cuadro de di&aacute;logo
Imprimir, haga clic en el bot&oacute;n de radio Secciones.</para>
<note>
<para>No podr&aacute; hacer clic en el bot&oacute;n de radio Jerarqu&iacute;a
si ha seleccionado varias secciones de la lista de libros.</para>
</note>
<para>Para obtener informaci&oacute;n adicional, refi&eacute;rase a<xref role="JumpText"
linkend="INFOUG.Printing.mkr.7">.</para>
</listitem>
<listitem><para>Para imprimir las secciones en un archivo, haga clic en el
bot&oacute;n de radio Imprimir en el archivo. Escriba la ruta de acceso del
archivo en el &aacute;rea de introducci&oacute;n de datos o haga clic en el
bot&oacute;n Seleccionar archivo... para buscar la ruta y el nombre del archivo.
</para>
<para>Para imprimir secciones directamente mediante una impresora, haga clic
en el bot&oacute;n de radio Imprimir en la impresora.</para>
<para>Para obtener informaci&oacute;n adicional, refi&eacute;rase a <xref
role="JumpText" linkend="INFOUG.Printing.mkr.8">.</para>
</listitem>
<listitem><para>Haga clic en Imprimir para imprimir las secciones seleccionadas.
</para>
</listitem>
</orderedlist>
<para>Para imprimir r&aacute;pidamente varias secciones desde la ventana de
lista de libros, es decir, sin utilizar el cuadro de di&aacute;logo Imprimir:
</para>
<orderedlist>
<listitem><para>Seleccione las secciones a imprimir de acuerdo con lo descrito
anteriormente.</para>
</listitem>
<listitem><para>Haga clic en el bot&oacute;n Imprimir o seleccione la opci&oacute;n
Imprimir del men&uacute; Archivo. Gestor de informaci&oacute;n imprimir&aacute;
la secci&oacute;n y no pondr&aacute; en pantalla el cuadro de di&aacute;logo
Imprimir.</para>
</listitem>
</orderedlist>
</sect2>
</sect1>
<sect1 id="INFOUG.Printing.div.7">
<title id="INFOUG.Printing.mkr.7">Especificaci&oacute;n de elementos a imprimir</title>
<para>Mediante Gestor de informaci&oacute;n, podr&aacute; especificar la impresi&oacute;n
de una sola secci&oacute;n, una cantidad de secciones no contiguas o un grupo
de secciones relacionadas. Para especificar elementos a imprimir, deber&aacute;
utilizar el &aacute;rea A imprimir del cuadro de di&aacute;logo Imprimir.
</para>
<para>Para especificar la impresi&oacute;n de una sola secci&oacute;n o de
varias contiguas (disponible al activar la funci&oacute;n de impresi&oacute;n
mediante la lista de libros), haga clic en el bot&oacute;n de radio Secciones.
</para>
<para>Para imprimir una secci&oacute;n y sus secciones subordinadas, haga
clic en el bot&oacute;n de radio Jerarqu&iacute;a.</para>
<note>
<para>Al hacer clic en Jerarqu&iacute;a, el &aacute;rea Cantidad de secciones
indicar&aacute; la cantidad de secciones que contiene la jerarqu&iacute;a.
</para>
</note>
</sect1>
<sect1 id="INFOUG.Printing.div.8">
<title id="INFOUG.Printing.mkr.8">Especificaci&oacute;n del lugar de impresi&oacute;n<indexterm>
<primary>impresi&oacute;n</primary><secondary>en un archivo</secondary></indexterm></title>
<para>Podr&aacute; enviar secciones o libros seleccionados directamente a
la impresora o podr&aacute; guardarlos en un archivo PostScript para imprimirlos
m&aacute;s adelante.</para>
<sect2 id="INFOUG.Printing.div.9">
<title id="INFOUG.Printing.mkr.9">Impresi&oacute;n directa mediante una impresora</title>
<para>Para imprimir directamente mediante una impresora:</para>
<orderedlist>
<listitem><para>Haga clic en el bot&oacute;n de radio Impresora.</para>
<para>El &aacute;rea de introducci&oacute;n del nombre de la impresora contiene
el especificador de impresora X de la impresora a utilizar para la tarea de
impresi&oacute;n. El especificador de impresora X es un identificador que
identifica de forma &uacute;nica a una impresora X. Formato del especificador:
</para>
<programlisting><emphasis>nombre_de_la_impresora</emphasis>@<emphasis>anfitri&oacute;n</emphasis> :<emphasis>visualizaci&oacute;n</emphasis>.<emphasis>pantalla</emphasis></programlisting>
<para>La parte llamada <emphasis>pantalla</emphasis> es opcional.</para>
</listitem>
<listitem><para>Utilice la impresora cuyo nombre aparece en pantalla o seleccione
otra haciendo clic en el bot&oacute;n Seleccionar impresora... y utilizando
el cuadro de di&aacute;logo de selecci&oacute;n de impresora.</para>
</listitem>
</orderedlist>
</sect2>
<sect2 id="INFOUG.Printing.div.10">
<title id="INFOUG.Printing.mkr.10">Impresi&oacute;n en un archivo</title>
<para>Para imprimir en un archivo:</para>
<orderedlist>
<listitem><para>Haga clic en el bot&oacute;n de radio Imprimir en el archivo.
</para>
</listitem>
<listitem><para>Escriba el nombre del archivo al que se enviar&aacute;n los
datos de impresi&oacute;n PostScript. Tambi&eacute;n podr&aacute; seleccionar
el directorio y archivo haciendo clic en el bot&oacute;n Seleccionar archivo
<?Pub Caret>y utilizando el cuadro de di&aacute;logo de selecci&oacute;n de
archivos.</para>
</listitem>
</orderedlist>
</sect2>
</sect1>
</chapter>
<?Pub *0000030798>
