<!-- $XConsortium: glossary.sgm /main/2 1996/12/20 20:08:08 rws $ -->
<!-- (c) Copyright 1996 Digital Equipment Corporation. -->
<!-- (c) Copyright 1996 Hewlett-Packard Company. -->
<!-- (c) Copyright 1996 International Business Machines Corp. -->
<!-- (c) Copyright 1996 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1996 Novell, Inc. -->
<!-- (c) Copyright 1996 FUJITSU LIMITED. -->
<!-- (c) Copyright 1996 Hitachi. -->
<glossary id="INFOUG.Gloss.div.1">
<title>Glosario</title>
<glossentry><glossterm>amplitud de b&uacute;squeda</glossterm>
<glossdef>
<para>Conjunto de libros y tipos de informaci&oacute;n que Gestor de informaci&oacute;n
consultar&aacute; para realizar b&uacute;squedas.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>biblioteca de informaci&oacute;n</glossterm>
<glossdef>
<para>Conjunto de estantes para libros en el que cada estante para libros
contiene un conjunto de libros y cada libro contiene secciones.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bot&oacute;n Conector</glossterm>
<glossdef>
<para>Editor de consultas: Se utiliza para incluir otros t&eacute;rminos en
la b&uacute;squeda.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Configurar impresi&oacute;n</glossterm>
<glossdef>
<para>Cuadro de di&aacute;logo que permite especificar opciones de impresi&oacute;n
para la impresora seleccionada, como por ejemplo la orientaci&oacute;n de
p&aacute;gina (horizontal o vertical), impresi&oacute;n en una o dos caras
y la bandeja de papel a utilizar. Agenda, Gestor de informaci&oacute;n, Aplicaci&oacute;n
de correo y Editor de texto pondr&aacute; en pantalla este cuadro de di&aacute;logo
al hacer doble clic en el bot&oacute;n Configurar de su cuadro de di&aacute;logo
de impresi&oacute;n.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>control de Panel frontal</glossterm>
<glossdef>
<para>Panel frontal: Objeto de Panel frontal utilizado como interfaz para
servicios de sistema b&aacute;sicos, operaciones y tareas efectuadas frecuentemente.
Utilice el nombre de control espec&iacute;fico cuando corresponda. Controles
del Panel frontal predeterminado: Reloj, Agenda, Gestor de archivos, Editor
de texto y Aplicaci&oacute;n de correo, Gestor de informaci&oacute;n y Papelera.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Crear marcador de libro</glossterm>
<glossdef>
<para>Ventana de lectura: men&uacute; Marcas: Se utiliza para crear un marcador
en blanco en una secci&oacute;n que se encuentra en una ventana de lectura
activa.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Crear nota</glossterm>
<glossdef>
<para>Ventana de lectura: men&uacute; Marcas: Se utiliza para crear un marcador
de libro con anotaci&oacute;n en una secci&oacute;n que se encuentra en una
ventana de lectura activa.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>cuadro de panor&aacute;mica</glossterm>
<glossdef>
<para>Cuadro de panor&aacute;mica interactivo de dos dimensiones que se encuentra
en un mapa gr&aacute;fico de Gestor de informaci&oacute;n y permite trasladarse
a la parte del mapa que no aparece en la ventana de lectura.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Desvincular gr&aacute;fico</glossterm>
<glossdef>
<para>Opci&oacute;n de men&uacute;: Se utiliza para copiar una imagen de gr&aacute;fico
seleccionada en una ventana individual llamada Gr&aacute;fico desvinculado.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>DTD de estante para libros</glossterm>
<glossdef>
<para>Definici&oacute;n de tipo de documento que define la estructura de los
archivos de especificaci&oacute;n utilizados para generar libros para Gestor
de informaci&oacute;n. Refi&eacute;rase tambi&eacute;n a <emphasis>definici&oacute;n
de tipo de documento</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Editor de amplitud de b&uacute;squeda</glossterm>
<glossdef>
<para>Cuadro de di&aacute;logo que permite crear amplitudes de b&uacute;squeda
personalizadas.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Editor de consultas</glossterm>
<glossdef>
<para>Cuadro de di&aacute;logo que permite definir b&uacute;squedas detalladas
en bibliotecas de informaci&oacute;n.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Editor de marcador de libros</glossterm>
<glossdef>
<para>Cuadro de di&aacute;logo que aparece al hacer doble clic en el icono
de marcador de libro de ventanas de lectura. Se utiliza para ver y modificar
marcadores de libros y notas existentes.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>enlace</glossterm>
<glossdef>
<para>Referencia de hipertexto a un localizador. El contenido del enlace representa
un &aacute;rea activa de Gestor de informaci&oacute;n. Refi&eacute;rase a <emphasis>localizador</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>especificaci&oacute;n de estante para libros</glossterm>
<glossdef>
<para>Documento SGML que contiene o especifica archivos de libro, hojas de
estilo y otras entidades SGML necesarias para generar una biblioteca de informaci&oacute;n.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>estante para libros</glossterm>
<glossdef>
<para>Conjunto de libros electr&oacute;nicos que contienen informaci&oacute;n
sobre temas relacionados. Conjunto l&oacute;gico de informaci&oacute;n (puede
constar de varios libros relacionados) que contiene un &iacute;ndice &uacute;nico
de texto. Un estante de libro y hojas de estilo constituyen el conjunto m&iacute;nimo
de informaci&oacute;n con el que se puede construir una biblioteca de informaci&oacute;n.
Refi&eacute;rase tambi&eacute;n a <emphasis>biblioteca de informaci&oacute;n</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>examinar</glossterm>
<glossdef>
<para>1) Examinar un conjunto, como por ejemplo una base de datos, una ventana
del Gestor de archivos o un archivo de texto para buscar un elemento espec&iacute;fico
o algo de inter&eacute;s. Consiste en observar en vez de modificar informaci&oacute;n.
</para>
<para>2) Buscar examinando y desplaz&aacute;ndose a trav&eacute;s de pantallas
y ventanas que contienen datos.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Gestor de informaci&oacute;n</glossterm>
<glossdef>
<para>Aplicaci&oacute;n de software que permite examinar y realizar b&uacute;squedas
en conjuntos de documentaci&oacute;n en l&iacute;nea llamados bibliotecas
de informaci&oacute;n.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>icono Gr&aacute;fico desvinculado</glossterm>
<glossdef>
<para>Icono que marca el lugar en el que se ha desvinculado un gr&aacute;fico.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>infolib</glossterm>
<glossdef>
<para>Conjunto de archivos, incluyendo casos de SGML, gr&aacute;ficos e &iacute;ndices
que constituyen una biblioteca de informaci&oacute;n. Refi&eacute;rase a <emphasis>biblioteca de informaci&oacute;n</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Ir</glossterm>
<glossdef>
<para>Ventana de lectura: men&uacute; Ir: Se utiliza para navegar de forma
secuencial a trav&eacute;s de una biblioteca de informaci&oacute;n o volver
a secciones le&iacute;das anteriormente.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Juego de herramientas para programadores de sistemas
de informaci&oacute;n</glossterm>
<glossdef>
<para>Conjunto de herramientas y APIs que permiten a autores de sistemas de
informaci&oacute;n escribir, procesar y poner en pantalla bibliotecas de informaci&oacute;n.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>libro</glossterm>
<glossdef>
<para>Libro electr&oacute;nico. Vea tambi&eacute;n <emphasis>estante para
libros</emphasis> y <emphasis>biblioteca de informaci&oacute;n</emphasis>.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>lista de libros</glossterm>
<glossdef>
<para>Lista de estantes de libros y libros que se pueden obtener mediante
Gestor de informaci&oacute;n.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Listar marcas</glossterm>
<glossdef>
<para>Ventana de lectura: men&uacute; Marcas: Se utiliza para listar todos
los marcadores de libro en blanco y con anotaciones.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>localizador</glossterm>
<glossdef>
<para>Punto de anclaje de un documento al que se pueden referir enlaces de
hipertexto. Cada localizador cuenta con un identificador asociado &uacute;nico
en la biblioteca de informaci&oacute;n.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>mapa gr&aacute;fico</glossterm>
<glossdef>
<para>Representaci&oacute;n visual de la estructura de un libro en la que
se muestran los t&iacute;tulos de sus secciones en forma de &ldquo;&aacute;rbol&rdquo;
gr&aacute;fico.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>marcador de libro</glossterm>
<glossdef>
<para>Marcador utilizado por Gestor de informaci&oacute;n que los usuarios
pueden crear para hacer anotaciones en texto y gr&aacute;ficos espec&iacute;ficos
de la biblioteca de informaci&oacute;n. Gestor de informaci&oacute;n representa
el marcador de libro en forma de icono en el margen izquierdo de ventanas
de lectura.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Marcas</glossterm>
<glossdef>
<para>Ventana de lectura: men&uacute; Marcas: Se utiliza para crear, modificar
y eliminar marcadores de libros.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>secci&oacute;n</glossterm>
<glossdef>
<para>Unidad simple de documentaci&oacute;n que aparece en ventanas de lectura
de Gestor de informaci&oacute;n.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Seguimiento autom&aacute;tico</glossterm>
<glossdef>
<para>Ventana Lista de libros: men&uacute; Opciones: Se utiliza para especificar
que Gestor de informaci&oacute;n muestre d&oacute;nde se encuentra en la jerarqu&iacute;a
de una biblioteca de informaci&oacute;n.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>sistema de informaci&oacute;n</glossterm>
<glossdef>
<para>Bibliotecas de informaci&oacute;n (datos), Gestor de informaci&oacute;n
(visor) y Juego de herramientas para programadores de sistemas de informaci&oacute;n
(herramientas de desarrollo).</para>
</glossdef>
</glossentry>
<glossentry><glossterm>tabla de contenido de hipertexto</glossterm>
<glossdef>
<para>Lista de t&iacute;tulos de secci&oacute;n en hipertexto. Las tablas
de contenido de hipertexto contienen los t&iacute;tulos de secci&oacute;n
de libros en l&iacute;nea del sistema de informaci&oacute;n.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ventana de lectura</glossterm>
<glossdef>
<para>Ventana de Gestor de informaci&oacute;n que muestra texto, tablas y
gr&aacute;ficos de una secci&oacute;n espec&iacute;fica de un libro.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ventana Gr&aacute;fico desvinculado</glossterm>
<glossdef>
<para>Cuadro de di&aacute;logo que aparece al desvincular un gr&aacute;fico.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ventana Lista de libros</glossterm>
<glossdef>
<para>Cuadro de di&aacute;logo de Gestor de informaci&oacute;n que suministra
acceso a informaci&oacute;n almacenada en una biblioteca de informaci&oacute;n
para mostrar en l&iacute;neas o imprimir.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ventana Resultado de la b&uacute;squeda</glossterm>
<glossdef>
<para>Ventana que muestra una lista de secciones que contienen elementos buscados.
Gestor de informaci&oacute;n pondr&aacute; la ventana Resultado de la <?Pub Caret>b&uacute;squeda
en pantalla al completar una b&uacute;squeda.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ventana sujeta</glossterm>
<glossdef>
<para>Ventana de lectura marcada de manera que el texto que aparece en ella
se conserva al seguir un enlace y se abre una nueva ventana para el nuevo
texto. Si la ventana no est&aacute; sujeta, Gestor de informaci&oacute;n actualizar&aacute;
el texto que aparece en la ventana de lectura cada vez que se siga un enlace.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Ver</glossterm>
<glossdef>
<para>Icono y opci&oacute;n de men&uacute; que permite abrir una ventana de
lectura de una secci&oacute;n seleccionada.</para>
</glossdef>
</glossentry>
</glossary>
<!--fickle 1.14 mif-to-docbook 1.7 01/02/96 10:57:19-->
<?Pub *0000029952>
