<!-- $XConsortium: appb.sgm /main/10 1996/12/21 18:43:46 rws $ -->
<!-- (c) Copyright 1995 Digital Equipment Corporation. -->
<!-- (c) Copyright 1995 Hewlett-Packard Company. -->
<!-- (c) Copyright 1995 International Business Machines Corp. -->
<!-- (c) Copyright 1995 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1995 Novell, Inc. -->
<!-- (c) Copyright 1995 FUJITSU LIMITED. -->
<!-- (c) Copyright 1995 Hitachi. -->
<appendix id="UG.uI18N.div.1">
<title id="UG.uI18N.mkr.1">Ejecuci&oacute;n de sesiones localizadas</title>
<para>Puede personalizar en muchos idiomas diferentes la interfaz de usuario
del escritorio. Se pueden modificar diversos elementos tales como pantallas,
idiomas predeterminados, fonts, m&eacute;todos de entrada (teclado) e iconos.
Adem&aacute;s, se pueden adaptar al entorno local los men&uacute;s, la ayuda
en l&iacute;nea y los mensajes de error y est&aacute;n disponibles en diversos
idiomas.</para>
<informaltable id="UG.uI18N.itbl.1" frame="All">
<tgroup cols="1" colsep="1" rowsep="1">
<colspec colwidth="4.00in">
<tbody>
<row>
<entry align="left" valign="top"><para><!--Original XRef content: 'Idioma
predeterminado en el inicio de sesi&oacute;n309'--><xref role="JumpText" linkend="UG.uI18N.mkr.2"></para></entry>
</row>
<row>
<entry align="left" valign="top"><para><!--Original XRef content: 'Inicio
de una sesi&oacute;n con idioma espec&iacute;fico310'--><xref role="JumpText"
linkend="UG.uI18N.mkr.3"></para></entry></row>
<row>
<entry align="left" valign="top"><para><!--Original XRef content: 'Creaci&oacute;n
o edici&oacute;n de un archivo espec&iacute;fico de idioma310'--><xref role="JumpText"
linkend="UG.uI18N.mkr.4"></para></entry></row>
<row>
<entry align="left" valign="top"><para><!--Original XRef content: 'Uso de
un emulador de terminal espec&iacute;fico de idioma311'--><xref role="JumpText"
linkend="UG.uI18N.mkr.5"></para></entry></row>
<row>
<entry align="left" valign="top"><para><!--Original XRef content: 'Especificaci&oacute;n
de fonts311'--><xref role="JumpText" linkend="UG.uI18N.mkr.6"></para></entry>
</row>
<row>
<entry align="left" valign="top"><para><!--Original XRef content: 'Cambio
de fonts312'--><xref role="JumpText" linkend="UG.uI18N.mkr.7"></para></entry>
</row>
<row>
<entry align="left" valign="top"><para><!--Original XRef content: 'Elecci&oacute;n
del m&eacute;todo de entrada y del teclado314'--><xref role="JumpText" linkend="UG.uI18N.mkr.9"></para></entry>
</row></tbody></tgroup></informaltable>
<para><indexterm><primary>espec&iacute;fico de idioma</primary><secondary>sesiones</secondary></indexterm><indexterm><primary>sesi&oacute;n</primary>
<secondary>espec&iacute;fica de idioma</secondary></indexterm></para>
<sect1 id="UG.uI18N.div.2">
<title id="UG.uI18N.mkr.2">Idioma predeterminado en el inicio de sesi&oacute;n</title>
<para>Los mensajes y men&uacute;s de la ventana inicial de inicio de sesi&oacute;n
se muestran en el idioma predeterminado. Si no se ha establecido el idioma
predeterminado, los mensajes y men&uacute;s se muestran utilizando un entorno
nacional &ldquo;C&rdquo; gen&eacute;rico. Puede cambiar el idioma en el men&uacute;
Opciones de la pantalla de inicio de sesi&oacute;n.</para>
</sect1>
<sect1 id="UG.uI18N.div.3">
<title id="UG.uI18N.mkr.3">Inicio de una sesi&oacute;n con idioma espec&iacute;fico<indexterm><primary>espec&iacute;fico de idioma</primary><secondary>inicio
de sesi&oacute;n</secondary></indexterm><indexterm><primary>inicio de sesi&oacute;n</primary><secondary>espec&iacute;fico de idioma</secondary></indexterm><indexterm>
<primary>inicio de sesi&oacute;n, espec&iacute;fico de idioma</primary></indexterm></title>
<para>Es f&aacute;cil iniciar una sesi&oacute;n en un idioma determinado utilizando
el escritorio. Sin embargo, pueden ser necesarios determinados requisitos
de hardware, tales como teclados e impresoras, para hacer m&aacute;s utilizable
la sesi&oacute;n adaptada al entorno nacional. Estos requisitos var&iacute;an
con el idioma, el juego de caracteres y el pa&iacute;s. El software y los
fonts pueden aumentar m&aacute;s la adaptaci&oacute;n efectiva del sistema
al entorno nacional. Para iniciar una sesi&oacute;n espec&iacute;fica de idioma:
</para>
<orderedlist>
<listitem><para>Utilice el men&uacute; Opciones de la pantalla de inicio de
sesi&oacute;n para seleccionar un idioma.</para>
<para>La lista de idiomas incluye todos los idiomas a los que se da soporte.
</para>
</listitem>
<listitem><para>Inicie la sesi&oacute;n en la forma habitual, con su nombre
y contrase&ntilde;a.</para>
</listitem>
</orderedlist>
</sect1>
<sect1 id="UG.uI18N.div.4">
<title id="UG.uI18N.mkr.4">Creaci&oacute;n o edici&oacute;n de un archivo
espec&iacute;fico de idioma<indexterm><primary>espec&iacute;fico de idioma</primary><secondary>datos</secondary></indexterm></title>
<para>Puede crear, editar e imprimir archivos espec&iacute;ficos de idioma.
Puede tambi&eacute;n dar nombres espec&iacute;ficos de idioma a los archivos.
Sin embargo, para archivos de la administraci&oacute;n del sistema que se
comparten en una red, los nombres de archivo s&oacute;lo deben contener caracteres
ASCII. Los diversos sistemas de la red pueden estar utilizando entornos nacionales
diferentes.</para>
<para>Si uno inicia la sesi&oacute;n en el escritorio para un idioma determinado,
todas las aplicaciones se invocar&aacute;n utilizando ese idioma. Sin embargo,
puede todav&iacute;a invocar una aplicaci&oacute;n con otro idioma.</para>
<para>Si desea crear un archivo con un idioma diferente, invoque el Editor
de textos especificando el idioma deseado.</para>
<sect2 id="UG.uI18N.div.5" role="Procedure">
<title>Creaci&oacute;n y edici&oacute;n de un archivo espec&iacute;fico para
un idioma</title>
<indexterm><primary>creaci&oacute;n</primary><secondary>archivo con caracteres
espec&iacute;ficos de un idioma</secondary></indexterm><indexterm><primary>edici&oacute;n</primary><secondary>archivo con caracteres espec&iacute;ficos
de un idioma</secondary></indexterm><indexterm><primary>archivos</primary>
<secondary>con caracteres espec&iacute;ficos de un idioma[archivos</secondary>
</indexterm><indexterm><primary>espec&iacute;ficos de un idioma</primary>
<secondary>caracteres en un archivo</secondary></indexterm>
<para>Para crear o editar un archivo espec&iacute;fico de un idioma, podr&aacute;
activar el Editor de textos directamente con el idioma o configurar la variable
de entorno <systemitem class="environvar">LANG</systemitem> antes de activar
dicho editor.</para>
<para>Para activar el Editor de textos con el idioma directamente, invoque
el comando <command>dtpad</command> con el idioma especificado en la opci&oacute;n <command>-xnllanguage</command>. Por ejemplo:</para>
<programlisting><command>/usr/dt/bin/dtpad -xnllanguage</command> <symbol role="Variable">japones_nombredellugar</symbol></programlisting>
<para>Para configurar <systemitem class="environvar">LANG</systemitem> antes
de invocar el editor, efect&uacute;e las siguientes operaciones:</para>
<orderedlist>
<listitem><para>En una ventana Terminal, configure la variable de entorno <systemitem class="environvar">LANG</systemitem> con el idioma deseado. Por ejemplo, para
configurar el lugar en japon&eacute;s, escriba:<indexterm><primary>Terminal</primary><secondary>configuraci&oacute;n del idioma</secondary></indexterm><indexterm>
<primary>mediante la variable de entorno LANG</primary></indexterm></para>
<programlisting><systemitem class="environvar">LANG</systemitem>=<symbol role="Variable">japones_nombredellugar</symbol></programlisting>
<para>donde <symbol role="Variable">japones_nombredellugar</symbol> especifica
el juego de caracteres japon&eacute;s. Refi&eacute;rase a la plataforma espec&iacute;fica
para determinar el valor de <symbol role="Variable">japones_nombre_del_lugar</symbol>.</para>
</listitem>
<listitem><para>En la misma ventana, invoque el Editor de textos ( <computeroutput>dtpad</computeroutput>) bajo el idioma deseado escribiendo:<indexterm><primary>Editor de textos</primary><secondary>activaci&oacute;n con un idioma espec&iacute;fico</secondary></indexterm><indexterm><primary>activaci&oacute;n</primary><secondary>Editor de textos con un idioma espec&iacute;fico</secondary></indexterm><indexterm>
<primary>espec&iacute;fico del idioma</primary><secondary>Editor de textos</secondary></indexterm></para>
<programlisting><command>/usr/dt/bin/dtpad &amp;</command></programlisting>
</listitem>
</orderedlist>
<para>Podr&aacute; introducir caracteres japoneses si se han instalado archivos
espec&iacute;ficos para el lugar. Tambi&eacute;n podr&aacute; utilizar la
sesi&oacute;n del Editor de textos para modificar un archivo en japon&eacute;s
creado anteriormente.</para>
<para>Vea <!--Original XRef content: '&xd2;To Specify Fonts from the Command
Line&xd3; on page&numsp;298'--><xref role="SecTitleAndPageNum" linkend="UG.uI18N.mkr.8">
para obtener un ejemplo de la especificaci&oacute;n de un juego de fonts.
</para>
</sect2>
</sect1>
<sect1 id="UG.uI18N.div.6">
<title id="UG.uI18N.mkr.5">Utilizaci&oacute;n de un emulador de terminal espec&iacute;fico
para un idioma</title>
<para>En el siguiente ejemplo se utiliza <command>dtterm</command> y se activa
un emulador de terminal japon&eacute;s. Se supone que el idioma predeterminado
no es japon&eacute;s, que se utiliza el shell Korn y que se han instalado
los archivos espec&iacute;ficos para el lugar.</para>
<indexterm><primary>emulador de terminal</primary><secondary>espec&iacute;fico
para un idioma</secondary></indexterm><indexterm><primary>espec&iacute;fico
para un idioma</primary><secondary>emulador de terminal</secondary></indexterm>
<indexterm><primary>activaci&oacute;n</primary><secondary>emulador de terminal
con un idioma espec&iacute;fico</secondary></indexterm>
<orderedlist>
<listitem><para>Escriba lo siguiente en la l&iacute;nea de comando de una
ventana de terminal de shell Korn:</para>
<programlisting><systemitem class="environvar">LANG</systemitem>=<symbol role="Variable">japones_nombredellugar</symbol> <command>dtterm</command></programlisting>
<para>donde <symbol role="Variable">japones_nombredellugar</symbol> especifica
el juego de caracteres japon&eacute;s. Refi&eacute;rase a su plataforma espec&iacute;fica
para determinar el valor de<symbol role="Variable">japones_nombredellugar</symbol>.</para>
</listitem>
</orderedlist>
</sect1>
<sect1 id="UG.uI18N.div.7">
<title id="UG.uI18N.mkr.6">Especificaci&oacute;n de fonts<indexterm><primary>fonts</primary><secondary>internacionalizaci&oacute;n&lt;$startrange></secondary>
</indexterm><indexterm><primary>internacionalizaci&oacute;n y fonts</primary>
</indexterm></title>
<para>Generalmente el usuario cambia los fonts utilizando el Gestor de estilos,
el cual a su vez reinicia el Gestor de espacios de trabajo, restableciendo
los fonts del escritorio. Puede tambi&eacute;n personalizar fonts desde la
l&iacute;nea de mandatos o en archivos de recursos. En un entorno internacionalizado,
el usuario debe especificar fonts que sean independientes del c&oacute;digo
de caracteres. Esto es necesario debido a que la especificaci&oacute;n puede
ser utilizada en diversos entornos nacionales con c&oacute;digos de caracteres
diferentes al del font (<symbol role="Variable">charset</symbol>). Por tanto,
todas las listas de fonts se deben especificar con un conjunto de fonts.</para>
<sect2 id="UG.uI18N.div.8">
<title>Especificaci&oacute;n de fonts</title>
<para><indexterm><primary>especificaci&oacute;n de fonts</primary></indexterm>Una <emphasis>especificaci&oacute;n de fonts</emphasis> incluida en una lista de fonts puede
ser un nombre LFD (Logical Function Description) de X o un alias del nombre<indexterm><primary>XLFD</primary></indexterm>
XLFD. Por ejemplo, lo siguiente
son especificaciones v&aacute;lidas de fonts para un font de 14 puntos:</para>
<programlisting>-<?Pub Caret1>dt-interface system-medium-r-normal-serif-*-*-*-*-p-*-iso8859-1
</programlisting>
<para><emphasis>O</emphasis></para>
<programlisting>-*-r-*-14-*iso8859-1</programlisting>
</sect2>
<sect2 id="UG.uI18N.div.9">
<title>Especificaci&oacute;n de conjuntos de fonts</title>
<para><indexterm><primary>especificaci&oacute;n de conjuntos de fonts</primary>
</indexterm>La <emphasis>especificaci&oacute;n de conjuntos de fonts</emphasis>
incluida en una lista de fonts es una lista de nombres XLFD o de sus alias
(a veces llamada <emphasis>lista de nombres base</emphasis>). Los nombres
est&aacute;n separados por un punto y coma (;) y no se tienen en cuenta los
espacios en blanco situados antes o despu&eacute;s del punto y coma. Se pueden
especificar caracteres comodines para facilitar el acortamiento de los nombres
XLFD.<indexterm><primary>lista de nombres base de fonts</primary></indexterm></para>
<para>La especificaci&oacute;n del conjunto de fonts est&aacute; determinada
por el entorno nacional que se est&aacute; utilizando. Por ejemplo, el entorno
nacional japon&eacute;s define tres fonts (juegos de caracteres) necesarios
para visualizar todos sus caracteres. El ejemplo siguiente identifica el conjunto
de fonts Mincho necesario.</para>
<itemizedlist remap="Bullet1">
<listitem><para>Lista de nombres de ejemplo con juego de caracteres:</para>
<para remap="CodeIndent1"><programlisting>-dt-interface system-medium-r-normal-serif-*-*-*-*-p-*-14;
-dt-mincho-medium-r-normal--14-*-*-m-*-jisx0201.1976-0;
-dt-mincho-medium-r-normal--28-*-*-*-m-*-jisx0208.1983-0:</programlisting></para>
</listitem>
<listitem><para>Nombre individual de ejemplo sin juego de caracteres:</para>
<programlisting>-dt-*-medium-*-24-*-m-*:</programlisting>
</listitem>
</itemizedlist>
<para>Los dos ejemplos anteriores se pueden utilizar en un entorno nacional
japon&eacute;s siempre que existan fonts que coincidan con la lista de nombres
base.</para>
</sect2>
</sect1>
<sect1 id="UG.uI18N.div.10">
<title id="UG.uI18N.mkr.7">Cambio de fonts</title>
<para>Puede cambiar los fonts de dtterm utilizando cualquiera de los dos m&eacute;todos
siguientes:</para>
<itemizedlist remap="Bullet1">
<listitem><para>Especificar fonts desde la l&iacute;nea de mandatos</para>
</listitem>
<listitem><para>Especificar fonts dentro de un archivo de recursos</para>
</listitem>
</itemizedlist>
<sect2 id="UG.uI18N.div.11" role="Procedure">
<title id="UG.uI18N.mkr.8">Para especificar fonts desde la l&iacute;nea de
mandatos</title>
<para><indexterm><primary>fonts</primary><secondary>especificar desde la l&iacute;nea
de mandatos&lt;$startrange></secondary></indexterm>Para cambiar los fonts
para el men&uacute; desde la l&iacute;nea de mandatos, escriba:</para>
<programlisting>dtterm -xrm '*fontList: <symbol remap="courieroblique">fontset'</symbol></programlisting>
<para>donde <emphasis>fontset</emphasis> es una especificaci&oacute;n de conjunto
de fonts. Se puede especificar un conjunto de fonts mediante una lista completa
de nombres LFD (Logical Font Description) de X, mediante un patr&oacute;n
XLFD simple o mediante un alias. Observe que una especificaci&oacute;n del
conjunto de fonts est&aacute; determinada por el entorno nacional que se est&aacute;
utilizando.</para>
<sect3 id="UG.uI18N.div.12">
<title>Ejemplos</title>
<para>Para utilizar un font mayor, excepto para el font de men&uacute;, escriba:
</para>
<programlisting>               
dtterm -xrm '*fontList:-dt-interface user-medium-r-normal-l*-*-*-*:'</programlisting>
<para>Para utilizar un font menor, excepto para el font de men&uacute;, escriba:
</para>
<programlisting>               
dtterm -xrm '*fontList:-dt-interface user-medium-r-normal-s*-*-*-*:'</programlisting>
<para>Estas especificaciones son v&aacute;lidas para cualquier entorno nacional.<indexterm><primary>fonts</primary><secondary>especificar desde la l&iacute;nea
de mandatos&lt;$endrange></secondary></indexterm>
</para>
</sect3>
</sect2>
<sect2 id="UG.uI18N.div.13" role="Procedure">
<title>Especificaci&oacute;n de fonts en un archivo de recursos</title>
<para>A pesar de que es posible configurar fonts editando archivos de recursos
de aplicaci&oacute;n en el directorio de <filename>/usr/dt/app-defaults/</filename><symbol role="Variable">language</symbol>, no se recomienda hacerlo
ya que dichos archivos se sobreescriben autom&aacute;ticamente cada vez que
se efect&uacute;a una nueva instalaci&oacute;n, debido a lo cual se deben
configurar fonts agregando los recursos al archivo de su directorio personal <symbol role="Variable">HomeDirectory</symbol><filename>/.Xdefaults</filename>.</para>
</sect2>
</sect1>
<sect1 id="UG.uI18N.div.14">
<title id="UG.uI18N.mkr.9">Elecci&oacute;n del m&eacute;todo de entrada y
del teclado</title>
<para>Cada entorno nacional tiene asociado un &uacute;nico m&eacute;todo de
entrada predeterminado. Si el usuario no indica otra cosa, se selecciona este
m&eacute;todo predeterminado. Debido a que puede haber instalados a la vez
muchos m&eacute;todos de entrada, la secci&oacute;n siguiente describe c&oacute;mo
se seleccionan autom&aacute;ticamente los diversos m&eacute;todos de entrada.
</para>
<para>Adem&aacute;s de utilizar recursos para configurar el m&eacute;todo
de introducci&oacute;n de datos y el estilo de m&eacute;todo de preedici&oacute;n,
podr&aacute; utilizar el control <literal>Internacional</literal> (internacionalizaci&oacute;n)
del Gestor de estilos para configurar dichos valores de forma interactiva.
Para obtener informaci&oacute;n detallada, refi&eacute;rase a <citetitle>Common Desktop Environment: Gu&iacute;a del administrador de sistema y del
usuario avanzado</citetitle></para>
<sect2 id="UG.uI18N.div.15">
<title>Uso de modificadores del m&eacute;todo de entrada</title>
<para><indexterm><primary>m&eacute;todo de entrada para entornos nacionales&lt;$startrange></primary></indexterm>Cuando exista m&aacute;s de un m&eacute;todo de entrada
para un entorno nacional, utilice el recurso XmNinputMethod para identificar
el m&eacute;todo que desear&iacute;a utilizar. Esto se realiza especificando
un <emphasis>modificador</emphasis>. El modificador debe tener el formato
siguiente, donde <emphasis>modificador</emphasis> es el nombre utilizado para
identificar de forma exclusiva el m&eacute;todo de entrada:</para>
<para>inputMethod :@im=<emphasis>modificador</emphasis></para>
<para>La cadena de caracteres <emphasis>modificador</emphasis> especificada
en el recurso XmNinputMethod se utiliza para elegir el m&eacute;todo de entrada
que se utiliza.</para>
<para>Alternativamente, puede establecer la variable de entorno XMODIFIERS.
La sintaxis es la misma que para el recurso <command>XmNinputMethod</command>
pero los valores no son los mismos. Los valores de XMODIFIERS son espec&iacute;ficos
del proveedor del producto.<indexterm><primary>variable de entorno XMODIFIERS</primary></indexterm><indexterm><primary>recurso &lt;Filename | Command>XmNinputMethod&lt;Default
Para Font></primary></indexterm></para>
</sect2>
<sect2 id="UG.uI18N.div.16">
<title>Especificaci&oacute;n del estilo del m&eacute;todo de entrada</title>
<para>El estilo del m&eacute;todo de entrada determina c&oacute;mo se producir&aacute;
la preedici&oacute;n. La preedici&oacute;n est&aacute; controlada por el recurso <systemitem class="resource">XmNpreeditType</systemitem>. La sintaxis, los valores posibles
y el tipo predeterminado del recurso <systemitem class="resource">XmNpreeditType</systemitem> son:</para>
<informaltable>
<tgroup cols="2" colsep="0" rowsep="0">
<colspec colwidth="204*">
<colspec colwidth="324*">
<thead>
<row><entry align="left" valign="bottom"><para>Sintaxis</para></entry><entry
align="left" valign="bottom"><para>valor [,valor,....]</para></entry></row>
</thead>
<tbody>
<row>
<entry align="left" valign="top"><para>Valores posibles</para></entry>
<entry align="left" valign="top"><para>OverTheSpot, OffTheSpot, Root, None
</para></entry></row>
<row>
<entry align="left" valign="top"><para>Valor predeterminado</para></entry>
<entry align="left" valign="top"><para>OverTheSpot, OffTheSpot, Root</para></entry>
</row></tbody></tgroup></informaltable>
<para>La lista de cadenas de caracteres, separadas por una coma, especifica
el orden de prioridad para el recurso. Se utiliza el primer valor al que d&eacute;
soporte el m&eacute;todo de entrada.</para>
<para>Para obtener m&aacute;s informaci&oacute;n, vea el manual <emphasis>Internationalization Programmer's Guide.<indexterm><primary>m&eacute;todo
de entrada para entornos nacionales&lt;$endrange></primary></indexterm></emphasis></para>
</sect2>
<sect2 id="UG.uI18N.div.17">
<title>Cambio del mapa de teclado de X en el servidor</title>
<para>Si los mapas de teclado<indexterm><primary>mapas de teclado, cambiar</primary></indexterm> utilizados actualmente por el servidor de X no coinciden
con el teclado f&iacute;sico del sistema, puede cambiarlos manualmente utilizando
el mandato xmodmap o un programa de utilidad para la distribuci&oacute;n del
teclado, proporcionado por el proveedor. Para obtener informaci&oacute;n sobre
el mandato <command><indexterm><primary>mandato &lt;Filename | Command>xmodmap&lt;Default
Para Font></primary></indexterm>xmodmap</command>, escriba man xmodmap.</para>
</sect2>
</sect1>
</appendix>
<!--fickle 1.14 mif-to-docbook 1.7 01/02/96 15:01:23-->
<?Pub *0000035660>
