<!-- $XConsortium: ch02.sgm /main/10 1996/12/20 20:24:58 rws $ -->
<!-- (c) Copyright 1995 Digital Equipment Corporation. -->
<!-- (c) Copyright 1995 Hewlett-Packard Company. -->
<!-- (c) Copyright 1995 International Business Machines Corp. -->
<!-- (c) Copyright 1995 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1995 Novell, Inc. -->
<!-- (c) Copyright 1995 FUJITSU LIMITED. -->
<!-- (c) Copyright 1995 Hitachi. -->
<chapter id="UG.LogIn.div.1">
<title id="UG.LogIn.mkr.1">Inicio de una sesi&oacute;n de escritorio</title>
<para>Una sesi&oacute;n de escritorio comprende el per&iacute;odo de tiempo
entre el momento en que inicia la sesi&oacute;n y el momento en que la finaliza.
</para>
<para>La pantalla de inicio de sesi&oacute;n, que muestra el Gestor de inicio
de sesi&oacute;n, es la puerta de acceso del usuario al escritorio.<indexterm>
<primary>pantalla de inicio de sesi&oacute;n</primary></indexterm> Proporciona
un lugar para que el usuario escriba su nombre de inicio de sesi&oacute;n
y su contrase&ntilde;a. El men&uacute; Opciones de la pantalla de inicio de
sesi&oacute;n lista las opciones de inicio de sesi&oacute;n. Adem&aacute;s
de ejecutar una sesi&oacute;n de escritorio, puede iniciar una sesi&oacute;n
de seguridad contra anomal&iacute;a. Puede tambi&eacute;n seleccionar el
idioma para la sesi&oacute;n.</para>
<informaltable id="UG.LogIn.itbl.1" frame="All">
<tgroup cols="1">
<colspec colname="1" colwidth="10.16 cm">
<tbody>
<row rowsep="1">
<entry><para><!--Original XRef content: 'Inicio y finalizaci&oacute;n de una
sesi&oacute;n de escritorio25'--><xref role="JumpText" linkend="UG.LogIn.mkr.2"></para></entry>
</row>
<row rowsep="1">
<entry><para><!--Original XRef content: 'Para utilizar una sesi&oacute;n en
un idioma diferente26'--><xref role="JumpText" linkend="UG.LogIn.mkr.3"></para></entry>
</row>
<row rowsep="1">
<entry><para><!--Original XRef content: 'Inicio de una sesi&oacute;n de seguridad
contra anomal&iacute;a26'--><xref role="JumpText" linkend="UG.LogIn.mkr.4"></para></entry>
</row>
<row rowsep="1">
<entry><para><!--Original XRef content: 'Inicio de una sesi&oacute;n de l&iacute;nea
de mandatos27'--><xref role="JumpText" linkend="UG.LogIn.mkr.5"></para></entry>
</row>
<row rowsep="1">
<entry><para><!--Original XRef content: 'Uso de una sesi&oacute;n de inicio27'--><xref
role="JumpText" linkend="UG.LogIn.mkr.6"></para></entry></row></tbody></tgroup>
</informaltable>
<sect1 id="UG.LogIn.div.2">
<title id="UG.LogIn.mkr.2">Inicio y finalizaci&oacute;n de una sesi&oacute;n
de escritorio</title>
<para>Cuando el usuario se conecta al sistema, se inicia una sesi&oacute;n
de escritorio. El Gestor de sesiones se inicia despu&eacute;s de que el Gestor
de inicio de sesi&oacute;n valide el nombre de inicio de sesi&oacute;n y la
contrase&ntilde;a del usuario.</para>
<para>El Gestor de sesiones proporciona la capacidad de <emphasis>gestionar</emphasis> sesiones, es decir, recuerda el estado de la sesi&oacute;n m&aacute;s
reciente y devuelve al usuario a ese punto cuando inicia la sesi&oacute;n
la pr&oacute;xima vez.</para>
<para>El Gestor de sesiones guarda y restaura la informaci&oacute;n siguiente:
</para>
<itemizedlist remap="Bullet1">
<listitem><para>Los valores de aspecto y de comportamiento (por ejemplo, los
valores de fonts, colores y del rat&oacute;n).</para>
</listitem>
<listitem><para>Las aplicaciones de ventana que se estaban ejecutando (por
ejemplo, las ventanas del Gestor de archivos y del Editor de textos). El Gestor
de sesiones no puede guardar y restaurar determinados tipos de aplicaciones.
Por ejemplo, si inicia el editor <command>vi</command> desde una l&iacute;nea
de mandatos en una ventana de terminal, el Gestor de sesiones no podr&aacute;
restaurar la sesi&oacute;n de edici&oacute;n.</para>
</listitem>
</itemizedlist>
<sect2 id="UG.LogIn.div.3" role="Procedure">
<title>Para iniciar una sesi&oacute;n de escritorio</title>
<orderedlist>
<listitem><para>Escriba su nombre de inicio de sesi&oacute;n y pulse Intro
u OK<indexterm><primary>inicio de sesi&oacute;n</primary></indexterm></para>
</listitem>
<listitem><para>Escriba su contrase&ntilde;a y pulse Intro u OK.<indexterm>
<primary>sesi&oacute;n de escritorio</primary></indexterm></para>
<para>Si el Gestor de inicio de sesi&oacute;n no reconoce su nombre o contrase&ntilde;a,
pulse Iniciar e inicie de nuevo el proceso de inicio de sesi&oacute;n.</para>
</listitem>
</orderedlist>
<para>Una vez que se haya conectado al sistema, el Gestor de sesiones inicia
una sesi&oacute;n:</para>
<itemizedlist remap="Bullet1">
<listitem><para>Si es la primera que inicia una sesi&oacute;n, obtendr&aacute;
una sesi&oacute;n nueva.</para>
</listitem>
<listitem><para>Si ha iniciado una sesi&oacute;n antes, se restaurar&aacute;
la sesi&oacute;n anterior.</para>
</listitem>
</itemizedlist>
</sect2>
<sect2 id="UG.LogIn.div.4" role="Procedure">
<title>Para finalizar la sesi&oacute;n</title>
<itemizedlist remap="Bullet1">
<listitem><para>Pulse el control Salir (Exit), en el Panel frontal.<indexterm>
<primary>fin de sesi&oacute;n</primary></indexterm><indexterm><primary>Panel
frontal</primary><secondary>control Salir</secondary></indexterm><indexterm>
<primary>control Salir</primary></indexterm></para>
</listitem>
<listitem><para><emphasis>O bien</emphasis>, elija Finalizar sesi&oacute;n
en el men&uacute; del espacio de trabajo.</para>
</listitem>
</itemizedlist>
<para>Cuando finaliza una sesi&oacute;n de escritorio normal, el Gestor de
sesiones guarda informaci&oacute;n sobre la sesi&oacute;n actual para que
se pueda restaurar la pr&oacute;xima vez que inicie una sesi&oacute;n. No
se puede guardar informaci&oacute;n sobre aplicaciones que no sean de escritorio.
</para>
</sect2>
<sect2 id="UG.LogIn.div.5" role="Procedure">
<title id="UG.LogIn.mkr.3">Para utilizar una sesi&oacute;n en un idioma diferente</title>
<orderedlist>
<listitem><para>Elija Idioma en el men&uacute; Opciones de la pantalla de
inicio de sesi&oacute;n.<indexterm><primary>idioma, valor para sesi&oacute;n
de escritorio</primary></indexterm></para>
</listitem>
<listitem><para>Elija el grupo de idiomas que incluya el idioma deseado.</para>
</listitem>
<listitem><para>Seleccione un idioma.</para>
</listitem>
<listitem><para>Inicie la sesi&oacute;n.</para>
</listitem>
</orderedlist>
<para>El idioma predeterminado del sistema lo establece el administrador del
sistema. El men&uacute; Opciones le permite acceder a otros idiomas. Cuando
elige un idioma en el men&uacute; Opciones se define la variable de entorno <systemitem>LANG</systemitem> para la sesi&oacute;n. Al finalizar la sesi&oacute;n se
restaura el idioma predeterminado.</para>
</sect2>
</sect1>
<sect1 id="UG.LogIn.div.6">
<title id="UG.LogIn.mkr.4">Inicio de una sesi&oacute;n de seguridad contra
anomal&iacute;a</title>
<para><indexterm><primary>sesi&oacute;n de seguridad contra anomal&iacute;a</primary></indexterm>Una sesi&oacute;n de seguridad contra anomal&iacute;a
es una sesi&oacute;n que inicia una ventana de terminal &uacute;nica (y opcionalmente
el Gestor de espacios de trabajo). Es &uacute;til cuando el usuario necesita
acceder a una ventana de terminal &uacute;nica para ejecutar varios mandatos
antes de iniciar una sesi&oacute;n de escritorio.</para>
<sect2 id="UG.LogIn.div.7" role="Procedure">
<title>Para iniciar una sesi&oacute;n de seguridad contra anomal&iacute;a</title>
<orderedlist>
<listitem><para>Elija Sesi&oacute;n en el men&uacute; Opciones.</para>
</listitem>
<listitem><para>Elija Sesi&oacute;n de seguridad contra anomal&iacute;a en
el submen&uacute; Sesi&oacute;n.</para>
</listitem>
<listitem><para>Inicie la sesi&oacute;n.</para>
</listitem>
</orderedlist>
</sect2>
<sect2 id="UG.LogIn.div.8" role="Procedure">
<title>Para finalizar una sesi&oacute;n de seguridad contra anomal&iacute;a</title>
<itemizedlist>
<listitem><para>Escriba el mandato <command>exit</command> en una ventana
de terminal.</para>
</listitem>
</itemizedlist>
</sect2>
</sect1>
<sect1 id="UG.LogIn.div.9">
<title id="UG.LogIn.mkr.5">Inicio de una sesi&oacute;n de l&iacute;nea de
mandatos</title>
<para>El modo Inicio de sesi&oacute;n de l&iacute;nea de mandatos le permite
abandonar temporalmente el escritorio para trabajar en el entorno del sistema
operativo. El modo Inicio de sesi&oacute;n de l&iacute;nea de mandatos no
es una sesi&oacute;n de escritorio. Cuando el sistema est&aacute; en dicho
modo, el escritorio est&aacute; suspendido. La sesi&oacute;n se inicia utilizando
el sistema operativo, en lugar del Gestor de inicio de sesi&oacute;n. No hay
ninguna ventana debido a que el servidor de X no est&aacute; funcionando.<indexterm><primary>modo Inicio de sesi&oacute;n de l&iacute;nea de mandatos</primary><secondary>definici&oacute;n del</secondary></indexterm>
</para>
<sect2 id="UG.LogIn.div.10" role="Procedure">
<title>Para iniciar y finalizar una sesi&oacute;n de l&iacute;nea de mandatos</title>
<note>
<para>Ciertos tipos de configuraciones (por ejemplo, terminales X) no proporcionan
una opci&oacute;n de Inicio de sesi&oacute;n de l&iacute;nea de mandatos.
</para>
</note>
<para>Para entrar en el modo Inicio de sesi&oacute;n de l&iacute;nea de mandatos:<indexterm>
<primary>modo Inicio de sesi&oacute;n de l&iacute;nea de mandatos</primary>
<secondary>entrar en</secondary></indexterm><indexterm><primary>modo Inicio
de sesi&oacute;n de l&iacute;nea de mandatos</primary><secondary>salir</secondary>
</indexterm><indexterm><primary>iniciar</primary><secondary>modo Inicio de
sesi&oacute;n de l&iacute;nea de mandatos</secondary></indexterm></para>
<orderedlist>
<listitem><para>Elija Inicio de sesi&oacute;n de l&iacute;nea de mandatos
en el men&uacute; Opciones.</para>
<para>La pantalla de inicio de sesi&oacute;n desaparece y se sustituye por
un indicador de consola.</para>
</listitem>
<listitem><para>Proporcione su nombre de inicio de sesi&oacute;n y contrase&ntilde;a
tal como se le solicite.</para>
</listitem>
</orderedlist>
<para>Para abandonar el modo Inicio de sesi&oacute;n de l&iacute;nea de mandatos:
</para>
<itemizedlist>
<listitem><para>Escriba <command>exit</command> en un indicador de l&iacute;nea
de mandatos.</para>
</listitem>
</itemizedlist>
</sect2>
</sect1>
<sect1 id="UG.LogIn.div.11">
<title id="UG.LogIn.mkr.6">Uso de una sesi&oacute;n de inicio</title>
<para>Generalmente, el escritorio guarda informaci&oacute;n sobre la sesi&oacute;n
cuando el usuario finaliza la sesi&oacute;n y utiliza esa informaci&oacute;n
para iniciar la sesi&oacute;n siguiente. Si inicia o detiene aplicaciones
durante la sesi&oacute;n, o utiliza el Gestor de estilos para cambiar el aspecto
y el comportamiento del sistema, los cambios hechos se reflejar&aacute;n en
la sesi&oacute;n siguiente. Este tipo de sesi&oacute;n se denomina <emphasis>sesi&oacute;n actual</emphasis>.<indexterm><primary>sesi&oacute;n actual</primary><secondary>definici&oacute;n de</secondary></indexterm><indexterm>
<primary>sesi&oacute;n de inicio</primary><secondary>definici&oacute;n de</secondary></indexterm><indexterm><primary>sesi&oacute;n</primary><secondary>actual</secondary></indexterm><indexterm><primary>sesi&oacute;n</primary>
<secondary>de inicio</secondary></indexterm></para>
<para>El escritorio tambi&eacute;n proporciona una <emphasis>sesi&oacute;n
de inicio</emphasis>. Una sesi&oacute;n de inicio es una sesi&oacute;n que
el usuario guarda expl&iacute;citamente. Es como obtener una instant&aacute;nea
de la sesi&oacute;n actual en un momento determinado. Una vez guardada una
sesi&oacute;n de inicio, puede especificar que el inicio de sesi&oacute;n
restaure siempre esa sesi&oacute;n en lugar de la sesi&oacute;n actual.
</para>
<sect2 id="UG.LogIn.div.12" role="Procedure">
<title>Para guardar una sesi&oacute;n de inicio</title>
<orderedlist>
<listitem><para>Pulse el control Gestor de estilos, en el Panel frontal.<indexterm>
<primary>sesi&oacute;n de inicio</primary><secondary>establecer</secondary>
</indexterm></para>
</listitem>
<listitem><para>Pulse el control Arranque, en el Gestor de estilos.</para>
<para>Se mostrar&aacute; el cuadro de di&aacute;logo Arranque.</para>
</listitem>
<listitem><para>Pulse Establecer sesi&oacute;n de inicio, en el cuadro de
di&aacute;logo Arranque.</para>
</listitem>
<listitem><para>Pulse OK en el cuadro de di&aacute;logo de confirmaci&oacute;n
que aparece.</para>
<para>Esto guarda el estado actual de la sesi&oacute;n.</para>
</listitem>
</orderedlist>
</sect2>
<sect2 id="UG.LogIn.div.13" role="Procedure">
<title>Para iniciar autom&aacute;ticamente la sesi&oacute;n de inicio al conectarse</title>
<orderedlist>
<listitem><para>Pulse el control Gestor de estilos, en el Panel frontal.<indexterm>
<primary>sesi&oacute;n de inicio</primary><secondary>arranque autom&aacute;tico
al conectarse</secondary></indexterm><indexterm><primary>arranque</primary>
<secondary>autom&aacute;tico de sesi&oacute;n de inicio al conectarse</secondary>
</indexterm></para>
</listitem>
<listitem><para>Pulse el control Arranque, en el Gestor de estilos.</para>
<para>Se mostrar&aacute; el cuadro de di&aacute;logo Arranque.</para>
</listitem>
<listitem><para>Seleccione Volver a sesi&oacute;n Inicio.</para>
</listitem>
<listitem><para>Pulse OK.</para>
</listitem>
</orderedlist>
<para>Cuando elige Volver a sesi&oacute;n Inicio, el Gestor de sesiones <emphasis>no</emphasis> guardar&aacute; la sesi&oacute;n cuando la finalice.</para>
</sect2>
<sect2 id="UG.LogIn.div.14" role="Procedure">
<title>Selecci&oacute;n de la sesi&oacute;n inicial</title>
<orderedlist>
<listitem><para>Haga clic en el bot&oacute;n Opciones de la pantalla Conexi&oacute;n.<indexterm>
<primary>sesi&oacute;n</primary><secondary>especificaci&oacute;n al conectar</secondary></indexterm></para>
</listitem>
<listitem><para>Haga clic en Sesi&oacute;n. El men&uacute; Sesi&oacute;n listar&aacute;
las sesiones disponibles:</para>
<variablelist>
<varlistentry><term>Actual</term>
<listitem>
<para>Activa la sesi&oacute;n m&aacute;s reciente.</para>
</listitem>
</varlistentry>
<varlistentry><term>Inicio</term>
<listitem>
<para>Activa la sesi&oacute;n de inicio (si ha especificado una).</para>
</listitem>
</varlistentry>
<varlistentry><term><emphasis>nombre-de-visualizaci&oacute;n</emphasis> -
Actual</term>
<listitem>
<para>Crea una nueva sesi&oacute;n espec&iacute;fica para su pantalla y activa
su sesi&oacute;n de inicio espec&iacute;fica para la pantalla (si la ha creado),
su sesi&oacute;n de inicio gen&eacute;rica (si existe) o una nueva sesi&oacute;n
de usuario.</para>
</listitem>
</varlistentry>
<varlistentry><term><emphasis>nombre-de-visualizaci&oacute;n</emphasis> -
Inicio</term>
<listitem>
<para>Crea una nueva sesi&oacute;n en la pantalla y activa su sesi&oacute;n
de inicio gen&eacute;rica (si existe) o una nueva sesi&oacute;n de usuario.
</para>
</listitem>
</varlistentry>
<varlistentry><term>Sesi&oacute;n a prueba de fallos</term>
<listitem>
<para>Activa una sesi&oacute;n a prueba de fallos<?Pub Caret>.</para>
</listitem>
</varlistentry>
</variablelist>
</listitem>
<listitem><para>Haga clic en la sesi&oacute;n que desea activar.</para>
</listitem>
</orderedlist>
</sect2>
</sect1>
</chapter>
<!--fickle 1.14 mif-to-docbook 1.7 01/02/96 15:01:23-->
<?Pub *0000029675>
