<!-- $XConsortium: ch03.sgm /main/13 1996/12/21 18:43:52 rws $ -->
<!-- (c) Copyright 1995 Digital Equipment Corporation. -->
<!-- (c) Copyright 1995 Hewlett-Packard Company. -->
<!-- (c) Copyright 1995 International Business Machines Corp. -->
<!-- (c) Copyright 1995 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1995 Novell, Inc. -->
<!-- (c) Copyright 1995 FUJITSU LIMITED. -->
<!-- (c) Copyright 1995 Hitachi. -->
<chapter id="UG.GHelp.div.1">
<title id="UG.GHelp.mkr.1">Obtenci&oacute;n de ayuda <?X-setsize 13.0 pt><indexterm>
<primary>ayuda en l&iacute;nea</primary></indexterm></title>
<para>Existe ayuda en l&iacute;nea disponible para cada una de las aplicaciones
est&aacute;ndar de Common Desktop Environment (CDE). Tanto si utiliza el Gestor
de archivos, la Agenda o la Aplicaci&oacute;n de correo, por ejemplo, puede
solicitar y mostrar temas de la ayuda de la misma manera. Puede tambi&eacute;n
examinar informaci&oacute;n de ayuda en el sistema utilizando el Gestor de
ayuda del escritorio.</para>
<para>Otras aplicaciones instaladas en el escritorio pueden aprovechar el
uso del Sistema de ayudas del escritorio o proporcionar ayuda de otras maneras.
</para>
<informaltable id="UG.GHelp.itbl.1" frame="All">
<tgroup cols="1" colsep="1" rowsep="1">
<colspec colwidth="4.00in">
<tbody>
<row>
<entry align="left" valign="top"><para><!--Original XRef content: 'Solicitud
de ayuda29'--><xref role="JumpText" linkend="UG.GHelp.mkr.2"></para></entry>
</row>
<row>
<entry align="left" valign="top"><para><!--Original XRef content: 'Uso de
ventanas de ayuda32'--><xref role="JumpText" linkend="UG.GHelp.mkr.6"></para></entry>
</row>
<row>
<entry align="left" valign="top"><para><!--Original XRef content: 'Selecci&oacute;n
de temas de la ayuda32'--><xref role="JumpText" linkend="UG.GHelp.mkr.8"></para></entry>
</row>
<row>
<entry align="left" valign="top"><para><!--Original XRef content: 'Desplazamiento
entre temas de la ayuda34'--><xref role="JumpText" linkend="UG.GHelp.mkr.12"></para></entry>
</row>
<row>
<entry align="left" valign="top"><para><!--Original XRef content: 'B&uacute;squeda
de informaci&oacute;n espec&iacute;fica37'--><xref role="JumpText" linkend="UG.GHelp.mkr.13"></para></entry>
</row>
<row>
<entry align="left" valign="top"><para><!--Original XRef content: 'Exploraci&oacute;n
de la ayuda del sistema39'--><xref role="JumpText" linkend="UG.GHelp.mkr.17"></para></entry>
</row>
<row>
<entry align="left" valign="top"><para><!--Original XRef content: 'Impresi&oacute;n
de temas de la ayuda42'--><xref role="JumpText" linkend="UG.GHelp.mkr.20"></para></entry>
</row></tbody></tgroup></informaltable>
<sect1 id="UG.GHelp.div.2">
<title id="UG.GHelp.mkr.2">Solicitud de ayuda</title>
<para><literal><indexterm><primary>ayuda de la aplicaci&oacute;n</primary>
</indexterm></literal>Estas son las formas en que puede solicitar Ayuda:
</para>
<itemizedlist remap="Bullet1">
<listitem><para>Pulsar F1 &mdash;tambi&eacute;n conocida como &ldquo;tecla
de ayuda&rdquo;&mdash;para obtener ayuda <emphasis>sensible al contexto</emphasis>
</para>
</listitem>
<listitem><para>Elegir un mandato en el men&uacute; Ayuda de la aplicaci&oacute;n
</para>
</listitem>
<listitem><para>Abrir el Gestor de ayuda desde el Panel frontal para examinar
ayuda en el sistema</para>
</listitem>
<listitem><para>Abrir el subpanel de Ayuda para seleccionar ayuda sobre el
escritorio o para elegir Ayuda sobre el tema</para>
</listitem>
</itemizedlist>
<sect2 id="UG.GHelp.div.3">
<title>Pulsar F1 <literal>&mdash;</literal> La tecla Ayuda<indexterm><primary>ayuda</primary><secondary>uso de la tecla Ayuda</secondary></indexterm></title>
<para>Cuando tenga una duda, la forma m&aacute;s r&aacute;pida y sencilla
de obtener ayuda es pulsar F1. Cuando pulsa F1, la aplicaci&oacute;n que est&aacute;
utilizando muestra el tema de la ayuda m&aacute;s relacionado con el componente
que est&aacute; resaltado (por ejemplo, una ventana o un bot&oacute;n).<indexterm>
<primary>ayuda</primary><secondary>sensible al contexto</secondary></indexterm> Debido
a que la aplicaci&oacute;n determina el tema de la ayuda m&aacute;s adecuado,
este tipo de ayuda se denomina <emphasis>sensible al contexto</emphasis>.
</para>
<para>La tecla F1 es una forma r&aacute;pida de obtener ayuda sobre un men&uacute;
o un cuadro de di&aacute;logo de una aplicaci&oacute;n. Por ejemplo, para
solicitar ayuda sobre el men&uacute; Archivo del Gestor de archivos, abra
el men&uacute; Archivo y pulse F1. El Gestor de archivos mostrar&aacute; una
descripci&oacute;n de cada opci&oacute;n del men&uacute;. Asimismo, si est&aacute;
abierto un cuadro de di&aacute;logo, cuando pulse F1 se mostrar&aacute; una
explicaci&oacute;n sobre el cuadro de di&aacute;logo. La tecla F1 es un m&eacute;todo
abreviado equivalente a pulsar el bot&oacute;n Ayuda del cuadro de di&aacute;logo.
</para>
<note>
<para>Algunos sistemas tienen una tecla &ldquo;Ayuda&rdquo; especial en el
teclado. Si este es su caso, puede que dicha tecla sustituya a la tecla F1.
</para>
</note>
</sect2>
<sect2 id="UG.GHelp.div.4">
<title>Uso del men&uacute; Ayuda de una aplicaci&oacute;n</title>
<para>La mayor&iacute;a de las aplicaciones tienen un men&uacute; Ayuda que
contiene mandatos para solicitar diferentes tipos de ayuda, por ejemplo informaci&oacute;n
preliminar, tareas de la aplicaci&oacute;n o informaci&oacute;n de consulta.
</para>
<figure>
<title>Men&uacute; Ayuda de la aplicaci&oacute;n de CDE</title>
<graphic id="UG.GHelp.grph.1" entityref="UG.GHelp.fig.1"></graphic>
</figure>
<para>Un men&uacute; Ayuda t&iacute;pico de CDE incluye estos mandatos:</para>
<informaltable>
<tgroup cols="2" colsep="0" rowsep="0">
<colspec colwidth="182*">
<colspec colwidth="346*">
<tbody>
<row>
<entry align="left" valign="top"><para>Informaci&oacute;n general</para></entry>
<entry align="left" valign="top"><para>Muestra el <emphasis>tema de inicio</emphasis> de la aplicaci&oacute;n. El tema de inicio es el primer tema en
la jerarqu&iacute;a de temas de la ayuda de la aplicaci&oacute;n.</para></entry>
</row>

<row>
<entry align="left" valign="top"><para>Tabla de contenido</para></entry>
<entry align="left" valign="top"><para>Muestra todos los temas de la jerarqu&iacute;a de temas de ayuda de la aplicaci&oacute;n.
</para></entry></row>

<row>
<entry align="left" valign="top"><para>Tareas</para></entry>
<entry align="left" valign="top"><para>Muestra instrucciones sobre tareas
para la mayor&iacute;a de las operaciones realizadas con la aplicaci&oacute;n.
</para></entry></row>
<row>
<entry align="left" valign="top"><para>Referencia</para></entry>
<entry align="left" valign="top"><para>Muestra res&uacute;menes de referencia
para varios componentes, tales como ventanas y cuadros de di&aacute;logo,
men&uacute;s y recursos de la aplicaci&oacute;n.</para></entry></row>
<row>
<entry align="left" valign="top"><para>Sobre el tema</para></entry>
<entry align="left" valign="top"><para>Le permite pulsar con el rat&oacute;n
un elemento de cualquier ventana de una aplicaci&oacute;n y ver una descripci&oacute;n
del elemento.</para></entry></row>
<row>
<entry align="left" valign="top"><para>Uso de la ayuda</para></entry>
<entry align="left" valign="top"><para>Proporciona ayuda sobre la utilizaci&oacute;n
de las ventanas de la ayuda.</para></entry></row>
<row>
<entry align="left" valign="top"><para>Acerca de la <emphasis>aplicaci&oacute;n</emphasis></para></entry>
<entry align="left" valign="top"><para>Muestra la versi&oacute;n y la informaci&oacute;n
de copyright correspondiente a la aplicaci&oacute;n.</para></entry></row>
</tbody></tgroup></informaltable>
<para>Las aplicaciones pueden incluir opciones adicionales. Adem&aacute;s,
las aplicaciones no pertenecientes a CDE pueden tener mandatos diferentes
en sus men&uacute;s de la Ayuda.</para>
<sect3 id="UG.GHelp.div.5">
<title>Ayuda de la aplicaci&oacute;n Sobre el tema<indexterm><primary>ayuda
sobre el tema</primary></indexterm><indexterm><primary>ayuda</primary><secondary>ayuda sobre el tema</secondary></indexterm></title>
<para>La Ayuda sobre el tema es interactiva. Le permite colocar el puntero
sobre un elemento determinado (tal como un men&uacute;, un bot&oacute;n o
un cuadro de di&aacute;logo) y pulsar sobre el elemento para mostrar su ayuda
correspondiente.</para>
</sect3>
<sect3 id="UG.GHelp.div.6" role="Procedure">
<title id="UG.GHelp.mkr.3">Para seleccionar Ayuda sobre el tema</title>
<orderedlist>
<listitem><para>Elija Sobre el tema, en el men&uacute; Ayuda.</para>
<para>El puntero se convertir&aacute; en un signo de interrogaci&oacute;n
(?).</para>
</listitem>
<listitem><para>Coloque el puntero sobre un elemento de la aplicaci&oacute;n
y pulse el bot&oacute;n 1 del rat&oacute;n.</para>
<para>Se mostrar&aacute; una descripci&oacute;n del elemento.</para>
</listitem>
</orderedlist>
</sect3>
</sect2>
<sect2 id="UG.GHelp.div.7">
<title id="UG.GHelp.mkr.4">Uso del Gestor de ayuda<indexterm><primary>Gestor
de ayuda</primary><secondary>control del Panel frontal</secondary></indexterm></title>
<para>El Gestor de ayuda es un volumen especial de la ayuda que lista toda
la ayuda en l&iacute;nea que est&aacute; registrada en el sistema. Cuando
pulsa el control Gestor de ayuda, en el Panel frontal, se abre el volumen
de ayuda correspondiente al Gestor de ayuda.</para>
<figure>
<title id="UG.GHelp.mkr.5">Control Gestor de ayuda</title>
<graphic id="UG.GHelp.grph.2" entityref="UG.GHelp.fig.2"></graphic>
</figure>
<para>Pulse en cualquiera de los t&iacute;tulos subrayados para ver la correspondiente
informaci&oacute;n de ayuda. Para obtener instrucciones adicionales sobre
el uso del Gestor de ayuda, vea.</para>
<para>Para su comodidad, puede tambi&eacute;n encontrar ayuda sobre el escritorio
y el Panel frontal en el subpanel Ayuda. Tambi&eacute;n proporciona ayuda
Sobre el tema para el Panel frontal y sus subpaneles.</para>
</sect2>
</sect1>
<sect1 id="UG.GHelp.div.8">
<title id="UG.GHelp.mkr.6">Uso de ventanas de ayuda</title>
<para><literal><indexterm><primary>ayuda</primary><secondary>ventanas</secondary>
</indexterm><indexterm><primary>ventanas de ayuda</primary><secondary>tipos
de</secondary></indexterm></literal> El <emphasis>Sistema de ayudas</emphasis>
est&aacute; incorporado en cada una de las aplicaciones CDE (y posiblemente
en otras aplicaciones instaladas en el sistema). Cuando solicita ayuda mientras
est&aacute; utilizando una aplicaci&oacute;n, &eacute;sta muestra una ventana
de ayuda.</para>
<para>Las aplicaciones pueden utilizar dos tipos de ventanas de ayuda para
mostrar temas de la ayuda: una <emphasis>ventana de ayuda</emphasis> <emphasis>general</emphasis> y una <emphasis>ventana de ayuda</emphasis> <emphasis>r&aacute;pida</emphasis>, que se muestra en la <!--Original XRef content:
'Figura&numsp;3&hyphen;4'--><xref role="CodeOrFigureOrTable" linkend="UG.GHelp.mkr.7">.
</para>
<figure>
<title id="UG.GHelp.mkr.7">Tipos de ventanas de ayuda</title>
<graphic id="UG.GHelp.grph.4" entityref="UG.GHelp.fig.4"></graphic>
</figure>
<para><indexterm><primary>&aacute;rbol de temas</primary></indexterm><indexterm>
<primary>&aacute;rea de visualizaci&oacute;n de temas</primary></indexterm>Las <emphasis>ventanas de ayuda general</emphasis> tienen un &aacute;rbol de temas y un
&aacute;rea de visualizaci&oacute;n de temas. El <emphasis>&aacute;rbol de
temas</emphasis> es una lista de temas de la ayuda que el usuario puede examinar
para buscar ayuda sobre un tema. Cuando elige un tema, se muestra en la parte
inferior de la ventana de ayuda, denominada <emphasis>&aacute;rea de visualizaci&oacute;n
de temas</emphasis>.<indexterm><primary>ventanas de ayuda</primary><secondary>&aacute;rbol de temas</secondary></indexterm><indexterm><primary>ventanas
de ayuda</primary><secondary>&aacute;rea de visualizaci&oacute;n de temas</secondary></indexterm></para>
<para>Las <emphasis>ventanas de ayuda r&aacute;pida</emphasis> son ventanas
de ayuda reducidas. S&oacute;lo tienen un &aacute;rea de visualizaci&oacute;n
de temas y uno o m&aacute;s botones.</para>
</sect1>
<sect1 id="UG.GHelp.div.9">
<title id="UG.GHelp.mkr.8">Selecci&oacute;n de temas de la ayuda</title>
<para><indexterm><primary>hiperenlace, utilizado en ayuda</primary></indexterm><indexterm>
<primary>ayuda</primary><secondary>visualizaci&oacute;n de temas</secondary>
</indexterm>Existen dos formas de seleccionar un tema de la ayuda. Puede elegir
un tema del &aacute;rbol de temas. Tambi&eacute;n, dentro de un tema de la
ayuda, puede seleccionar un hiperenlace. Un <emphasis>hiperenlace</emphasis>
es una palabra o frase activa que &ldquo;salta&rdquo; hacia otro tema relacionado
de la ayuda. Cualquier texto subrayado de una ventana de ayuda es un hiperenlace.
</para>
<para>Las im&aacute;genes gr&aacute;ficas tambi&eacute;n se pueden utilizar
como hiperenlaces. Para obtener m&aacute;s informaci&oacute;n sobre los hiperenlaces,
vea <!--Original XRef content: '&ldquo;Uso de hiperenlaces&ldquo; 
en la p&aacute;gina&numsp;33'--><xref role="SecTitleAndPageNum" linkend="UG.GHelp.mkr.10">en
la.</para>
<sect2 id="UG.GHelp.div.10">
<title>Uso del &aacute;rbol de temas</title>
<para>El &aacute;rbol de temas es un esquema de los temas principales de un
volumen de la ayuda. Los subtemas aparecen sangrados debajo de los temas
principales. El tema actual, cuyo contenido se muestra en el &aacute;rea de
visualizaci&oacute;n de temas, est&aacute; marcado con una flecha (&ogon;).
Puede desplazar el &aacute;rea de visualizaci&oacute;n de temas para ver todas
las opciones de que dispone o cambiar el tama&ntilde;o de la ventana de ayuda
completa.</para>
<para>Puede tambi&eacute;n cambiar el tama&ntilde;o del panel de temas. Para
hacerlo, arrastre con el rat&oacute;n la barra de divisi&oacute;n que se muestra
en la <!--Original XRef content: 'Figura&numsp;3&hyphen;5'--><xref role="CodeOrFigureOrTable"
linkend="UG.GHelp.mkr.9">. Luego libere el bot&oacute;n del rat&oacute;n para
establecer el nuevo tama&ntilde;o.</para>
<figure>
<title id="UG.GHelp.mkr.9">Cambio de tama&ntilde;o del &aacute;rbol de temas</title>
<graphic id="UG.GHelp.grph.5" entityref="UG.GHelp.fig.5"></graphic>
</figure>
<sect3 id="UG.GHelp.div.11" role="Procedure">
<title>Para seleccionar un tema</title>
<orderedlist>
<listitem><para>Coloque el puntero en el &aacute;rbol de temas.</para>
</listitem>
<listitem><para>Pulse el bot&oacute;n 1 del rat&oacute;n en el tema que desea
mostrar.</para>
</listitem>
</orderedlist>
</sect3>
</sect2>
<sect2 id="UG.GHelp.div.12">
<title id="UG.GHelp.mkr.10">Uso de hiperenlaces</title>
<para>Cualquier texto subrayado de una ventana de ayuda es un hiperenlace.
Mediante los hiperenlaces es f&aacute;cil &ldquo;saltar&rdquo; a temas relacionados
de la ayuda: simplemente pulse el rat&oacute;n en el texto subrayado.</para>
<sect3 id="UG.GHelp.div.13">
<title>Aspecto de los hiperenlaces</title>
<para>Una l&iacute;nea de subrayado continua identifica los hiperenlaces est&aacute;ndar
que muestran el nuevo tema en la ventana de ayuda actual. Por ejemplo, el
&uacute;ltimo p&aacute;rrafo de la <!--Original XRef content: 'Figura&numsp;3&hyphen;5'--><xref
role="CodeOrFigureOrTable" linkend="UG.GHelp.mkr.9"> muestra un hiperenlace
de este tipo.</para>
<para>Un subrayado de l&iacute;nea de guiones identifica un <emphasis>enlace
de definici&oacute;n</emphasis>, que muestra una ventana de ayuda r&aacute;pida.
</para>
<para>Un gr&aacute;fico &mdash; un icono, por ejemplo &mdash; puede tambi&eacute;n
ser un hiperenlace. Un borde gris sin esquinas identifica un hiperenlace gr&aacute;fico.
La <!--Original XRef content: 'Figura&numsp;3&hyphen;6'--><xref role="CodeOrFigureOrTable"
linkend="UG.GHelp.mkr.11"> muestra los diferentes formatos de hiperenlace que
se pueden utilizar en temas de la ayuda.</para>
<figure>
<title id="UG.GHelp.mkr.11">Formatos de hiperenlace</title>
<graphic id="UG.GHelp.grph.6" entityref="UG.GHelp.fig.6"></graphic>
</figure>
</sect3>
<sect3 id="UG.GHelp.div.14">
<title>Enlaces que muestran un nueva ventana</title>
<para>La mayor&iacute;a de los hiperenlaces muestran el tema relacionado en
la misma ventana. Sin embargo, si elige un hiperenlace que salta a un tema
de la ayuda para otra aplicaci&oacute;n, se muestra una nueva ventana. Los
enlaces que saltan desde la ayuda en l&iacute;nea de una aplicaci&oacute;n
a la de otra se denominan hiperenlaces <emphasis>entre vol&uacute;menes</emphasis>
o <emphasis>entre aplicaciones</emphasis>.</para>
</sect3>
<sect3 id="UG.GHelp.div.15" role="Procedure">
<title>Para seleccionar un hiperenlace</title>
<orderedlist>
<listitem><para>Coloque el puntero en el texto subrayado o en la imagen gr&aacute;fica.
</para>
</listitem>
<listitem><para>Pulse el bot&oacute;n 1 del rat&oacute;n.</para>
</listitem>
</orderedlist>
</sect3>
</sect2>
</sect1>
<sect1 id="UG.GHelp.div.16">
<title id="UG.GHelp.mkr.12">Desplazamiento entre temas de la ayuda<indexterm>
<primary>ayuda</primary><secondary>desplazamiento entre temas</secondary>
</indexterm><indexterm><primary>mandatos de ayuda</primary><secondary>Retroceder</secondary></indexterm><indexterm><primary>mandatos de ayuda</primary>
<secondary>Hist&oacute;rico</secondary></indexterm><indexterm><primary>mandatos de ayuda</primary><secondary>Tema de inicio</secondary></indexterm></title>
<para>Para ir de un tema a otro de la ayuda, utilice estos mandatos del men&uacute;
Desplazarse:</para>
<informaltable>
<tgroup cols="2" colsep="0" rowsep="0">
<colspec colwidth="159*">
<colspec colwidth="369*">
<tbody>
<row>
<entry align="left" valign="top"><para>Retroceder</para></entry>
<entry align="left" valign="top"><para>Vuelve al tema anterior. Retroceder
le permite volver a cada tema que ha examinado.</para></entry></row>
<row>
<entry align="left" valign="top"><para>Hist&oacute;rico</para></entry>
<entry align="left" valign="top"><para>Muestra el cuadro de di&aacute;logo
Hist&oacute;rico que lista los vol&uacute;menes y temas de la ayuda que ha
visitado. Seleccione un tema de la ayuda para volver a mostrarlo.</para></entry>
</row>
<row>
<entry align="left" valign="top"><para>Tema de inicio</para></entry>
<entry align="left" valign="top"><para>Vuelve al tema de inicio, es decir,
el principio del volumen de la ayuda.</para></entry></row></tbody></tgroup>
</informaltable>
<para>Para su comodidad, los mandatos Retroceder e Hist&oacute;rico tambi&eacute;n
se proporcionan en forma de botones de acci&oacute;n.</para>
<sect2 id="UG.GHelp.div.17">
<title>Men&uacute; emergente Ayuda<indexterm><primary>ayuda</primary><secondary>men&uacute; emergente</secondary></indexterm></title>
<para>En una ventana de ayuda general, puede tambi&eacute;n utilizar el men&uacute;
emergente Ayuda como m&eacute;todo abreviado. El men&uacute; emergente incluye
los mandatos Retroceder y Tema de inicio, que se utilizan con frecuencia.
</para>
<para>Las ventanas de ayuda r&aacute;pida no tienen un men&uacute; emergente.
</para>
<sect3 id="UG.GHelp.div.18" role="Procedure">
<title>Para mostrar el men&uacute; emergente Ayuda</title>
<orderedlist>
<listitem><para>Se&ntilde;ale el &aacute;rea de visualizaci&oacute;n de temas
y pulse el bot&oacute;n 3 del rat&oacute;n.</para>
</listitem>
<listitem><para>Elija Retroceder o Tema de inicio.</para>
</listitem>
</orderedlist>
<figure>
<title>Men&uacute; emergente Ayuda</title>
<graphic id="UG.GHelp.grph.7" entityref="UG.GHelp.fig.7"></graphic>
</figure>
</sect3>
</sect2>
<sect2 id="UG.GHelp.div.19">
<title>D&oacute;nde estoy<indexterm><primary>volumen de ayudas</primary>
</indexterm><indexterm><primary>tema de inicio</primary></indexterm><indexterm>
<primary>tema de inicio, en volumen de ayudas</primary></indexterm><indexterm>
<primary>ayuda</primary><secondary>jerarqu&iacute;a de temas</secondary></indexterm></title>
<para>Cada aplicaci&oacute;n que proporciona ayuda en l&iacute;nea tiene un <emphasis>volumen de ayudas.</emphasis> Un volumen consta de un grupo de <emphasis>temas de ayuda</emphasis> que describen la aplicaci&oacute;n y explican c&oacute;mo
utilizar sus caracter&iacute;sticas. Por ejemplo, una aplicaci&oacute;n podr&iacute;a
organizar su ayuda utilizando estos temas principales: Conceptos, Tareas y
Referencia.</para>
<figure>
<title>Organizaci&oacute;n del volumen de ayudas</title>
<graphic id="UG.GHelp.grph.8" entityref="UG.GHelp.fig.8"></graphic>
</figure>
<para>El tema de inicio es el primer tema, es decir, el principio del volumen
de ayudas. Los temas de nivel principal son accesibles desde el tema de inicio,
o pueden tambi&eacute;n estar listados en el men&uacute; Ayuda de la aplicaci&oacute;n.
</para>
<sect3 id="UG.GHelp.div.20">
<title>Desplazamiento entre diferentes vol&uacute;menes de ayudas</title>
<para>A menudo los hiperenlaces le llevan a otro tema del volumen de ayudas
de la aplicaci&oacute;n. Por ejemplo, mientras examina los temas de Tareas
podr&iacute;a seleccionar un hiperenlace hacia un tema de la secci&oacute;n
Referencia.</para>
<para>Sin embargo, un grupo de aplicaciones relacionadas pueden utilizar
hiperenlaces que apuntan a informaci&oacute;n de referencias cruzadas situada
en vol&uacute;menes de ayudas diferentes. Por ejemplo, una aplicaci&oacute;n
podr&iacute;a incluir un hiperenlace con el volumen de ayudas de introducci&oacute;n
del escritorio que describe los conocimientos b&aacute;sicos sobre el rat&oacute;n
y el teclado.</para>
<para>Debido a que los hiperenlaces le pueden llevar r&aacute;pidamente de
un elemento de informaci&oacute;n a otro, tal vez le interese saber d&oacute;nde
se encuentra. Un examen r&aacute;pido de la ventana de ayuda puede proporcionarle
la informaci&oacute;n que necesita.</para>
<itemizedlist remap="Bullet1">
<listitem><para>La l&iacute;nea situada debajo de la barra de men&uacute;s
indica el nombre del volumen que est&aacute; viendo. Esto es &uacute;til cuando
ha explorado varios vol&uacute;menes de ayudas mediante el Gestor de ayuda,
el &iacute;ndice de la ayuda o enlaces entre vol&uacute;menes.</para>
</listitem>
</itemizedlist>
<graphic id="UG.GHelp.igrph.1" entityref="UG.GHelp.fig.9"></graphic>
<itemizedlist remap="Bullet1">
<listitem><para>Dentro del &aacute;rbol de temas, el primer elemento es el <emphasis>tema de inicio</emphasis>, que es el comienzo del volumen de ayudas. Despu&eacute;s
de explorar temas, puede volver f&aacute;cilmente al tema de inicio desplaz&aacute;ndose
hacia el principio del &aacute;rbol de temas. O puede elegir Tema de inicio,
en el men&uacute; Desplazarse o en el men&uacute; emergente.</para>
</listitem>
<listitem><para>Una flecha se&ntilde;ala el t&iacute;tulo del tema seleccionado.
Cuando selecciona temas, la flecha se desplaza para identificar su selecci&oacute;n.
El desplazamiento por el &aacute;rbol de temas le mostrar&aacute; d&oacute;nde
se encuentra con respecto a otros temas.</para>
</listitem>
</itemizedlist>
</sect3>
</sect2>
<sect2 id="UG.GHelp.div.21">
<title>D&oacute;nde he estado</title>
<para>Una ventana de ayuda general hace un seguimiento de los temas que el
usuario ha explorado. El mandato Hist&oacute;rico abre un cuadro de di&aacute;logo
que lista los vol&uacute;menes de ayudas y los temas de ayuda que el usuario
ha explorado.</para>
<figure>
<title>Cuadro de di&aacute;logo Hist&oacute;rico</title>
<graphic id="UG.GHelp.grph.9" entityref="UG.GHelp.fig.10"></graphic>
</figure>
<sect3 id="UG.GHelp.div.22" role="Procedure">
<title>Para utilizar Hist&oacute;rico para volver a un tema</title>
<orderedlist>
<listitem><para>Pulse el bot&oacute;n Hist&oacute;rico.</para>
</listitem>
<listitem><para>Elija el t&iacute;tulo del volumen de ayudas o del tema que
desea que se muestre.</para>
</listitem>
<listitem><para>Cuando haya terminado, pulse Cerrar.</para>
</listitem>
</orderedlist>
</sect3>
</sect2>
</sect1>
<sect1 id="UG.GHelp.div.23">
<title id="UG.GHelp.mkr.13">B&uacute;squeda de informaci&oacute;n espec&iacute;fica<indexterm><primary>ayuda</primary><secondary>&iacute;ndice</secondary></indexterm><indexterm>
<primary>caracteres comodines</primary><secondary>para buscar en el &iacute;ndice
de la ayuda</secondary></indexterm></title>
<para>Como en un libro, un volumen de ayudas tiene un &iacute;ndice de palabras
y frases significativas que puede utilizar para buscar temas de la ayuda sobre
una materia. Puede examinar o buscar en el &iacute;ndice del volumen actual,
de vol&uacute;menes seleccionados o de todos los vol&uacute;menes de ayudas
disponibles en el sistema.</para>
<figure>
<title id="UG.GHelp.mkr.14">Cuadro de di&aacute;logo Buscar &iacute;ndice</title>
<graphic id="UG.GHelp.grph.10" entityref="UG.GHelp.fig.11"></graphic>
</figure>
<para>Debido a que el &iacute;ndice de la ayuda puede ser bastante grande,
incluso para un &uacute;nico volumen, las entradas de &iacute;ndice se pueden
ampliar o reducir. Un signo m&aacute;s (+) indica que la entrada de &iacute;ndice
est&aacute; relacionada con m&aacute;s de un tema de la ayuda. El n&uacute;mero
muestra la cuenta de temas de la ayuda. Puede pulsar en el elemento de &iacute;ndice
para listar los temas.</para>
<para>Por ejemplo, la <!--Original XRef content: 'Figura&numsp;3&hyphen;10'--><xref
role="CodeOrFigureOrTable" linkend="UG.GHelp.mkr.14"> muestra el resultado
de una b&uacute;squeda por &iacute;ndice de la palabra &ldquo;display&rdquo;.
El prefijo -36 indica que existen 36 entradas de &iacute;ndice que contienen
la palabra clave &ldquo;display&rdquo;. Cuando se pulsa sobre cualquier t&iacute;tulo
marcado con un signo m&aacute;s (+) se ampl&iacute;a la lista y el signo
m&aacute;s se convierte en un signo menos (-). La &uacute;ltima entrada de
&iacute;ndice que muestra la figura se ha ampliado de esta forma.</para>
<sect2 id="UG.GHelp.div.24" role="Procedure">
<title id="UG.GHelp.mkr.15">Para buscar temas mediante el &iacute;ndice de
la ayuda</title>
<note>
<para>El &iacute;ndice de la ayuda s&oacute;lo aparece en una ventana de ayuda
general</para>
</note>
<orderedlist>
<listitem><para>Para abrir el &iacute;ndice, pulse el bot&oacute;n &Iacute;ndice.<indexterm>
<primary>mandatos de ayuda</primary><secondary>&Iacute;ndice</secondary></indexterm></para>
<para>El &iacute;ndice lista todas las entradas del volumen de ayudas seleccionado.
Puede elegir <emphasis>Todos los vol&uacute;menes</emphasis> para ver un
&iacute;ndice de todos los vol&uacute;menes de ayudas disponibles o elegir <emphasis>Seleccionado</emphasis> si desea seleccionar s&oacute;lo determinados vol&uacute;menes.
</para>
</listitem>
<listitem><para>Seleccione el campo Entradas con, escriba la palabra o frase
que est&aacute; buscando, y pulse Intro.</para>
<para>Las b&uacute;squedas por &iacute;ndice no distinguen entre may&uacute;sculas
y min&uacute;sculas. Se pueden utilizar caracteres comodines, tales como el
asterisco (*) y el signo de interrogaci&oacute;n (?) (vea <!--Original
XRef content: '&ldquo;B&uacute;squedas por patr&oacute;n'--><xref role="SectionTitle"
linkend="UG.GHelp.mkr.16"> m&aacute;s adelante).</para>
</listitem>
<listitem><para>Seleccione la entrada de &iacute;ndice que desea ver.</para>
<para>Si la entrada tiene un signo m&aacute;s (+) como prefijo, la lista se
ampliar&aacute; para mostrar opciones adicionales. A continuaci&oacute;n seleccione
un tema de la ayuda para ver.</para>
<para>Puede visualizar tantos temas como desee.</para>
</listitem>
<listitem><para>Cuando haya terminado, pulse Cerrar.</para>
</listitem>
</orderedlist>
<sect3 id="UG.GHelp.div.25">
<title id="UG.GHelp.mkr.16">B&uacute;squedas por patr&oacute;n</title>
<para>En un patr&oacute;n de b&uacute;squeda determinados caracteres (denominados
&ldquo;comodines&rdquo;) tienen un significado especial. Puede combinar estos
caracteres de varias formas.</para>
<para>Dos comodines utilizados con frecuencia son el asterisco ( <filename>*</filename>) y el signo de interrogaci&oacute;n (<filename>?</filename>).
El <filename>*</filename> coincide con cualquier cadena de caracteres (incluyendo
su ausencia), y el <filename>?</filename> coincide con cualquier car&aacute;cter
individual. Otros comodines son:</para>
<informaltable>
<tgroup cols="2" colsep="0" rowsep="0">
<colspec colwidth="159*">
<colspec colwidth="369*">
<tbody>
<row>
<entry align="left" valign="top"><para>. (punto)</para></entry>
<entry align="left" valign="top"><para>Coincide con cualquier car&aacute;cter
</para></entry></row>
<row>
<entry align="left" valign="top"><para>| (barra vertical)</para></entry>
<entry align="left" valign="top"><para>Especifica dos patrones de b&uacute;squeda
y coincide con cualquiera de los dos patrones (operador l&oacute;gico OR)
</para></entry></row>
<row>
<entry align="left" valign="top"><para>() (par&eacute;ntesis)</para></entry>
<entry align="left" valign="top"><para>Delimita una expresi&oacute;n modelo
</para></entry></row></tbody></tgroup></informaltable>
<para>Para buscar un car&aacute;cter que tiene un significado especial dentro
de una expresi&oacute;n regular, preceda el car&aacute;cter con una barra
inclinada invertida ().</para>
<sect4 id="UG.GHelp.div.26">
<title>Ejemplos</title>
<informaltable>
<tgroup cols="2" colsep="0" rowsep="0">
<colspec colwidth="196*">
<colspec colwidth="332*">
<tbody>
<row>
<entry align="left" valign="top"><para>mouse*clicking</para></entry>
<entry align="left" valign="top"><para>Coincide con las entradas que contengan
la palabra &ldquo;mouse&rdquo; seguida de un n&uacute;mero cualquiera de caracteres
seguidos a su vez de la palabra &ldquo;clicking&rdquo;</para></entry></row>
<row>
<entry align="left" valign="top"><para>mouse | click</para></entry>
<entry align="left" valign="top"><para>Coincide con las entradas que contengan
la palabra &ldquo;mouse&rdquo; o &ldquo;click&rdquo;</para></entry></row>
<row>
<entry align="left" valign="top"><para>(session | style)*manager</para></entry>
<entry align="left" valign="top"><para>Coincide con las entradas que contengan
la palabra &ldquo;Session Manager&rdquo; o &ldquo;Style Manager&rdquo;</para></entry>
</row></tbody></tgroup></informaltable>
</sect4>
</sect3>
</sect2>
</sect1>
<sect1 id="UG.GHelp.div.27">
<title id="UG.GHelp.mkr.17">Exploraci&oacute;n de la ayuda del sistema<indexterm>
<primary>ayuda</primary><secondary>exploraci&oacute;n</secondary></indexterm></title>
<para>Puede explorar todos los vol&uacute;menes de ayudas de aplicaci&oacute;n
registrados en el sistema sin tener que iniciar cada aplicaci&oacute;n individual:
s&oacute;lo tiene que iniciar el Gestor de ayuda desde el Panel frontal.
</para>
<para>En el nivel superior, el Gestor de ayuda agrupa los vol&uacute;menes
de ayudas en <emphasis>familias de ayudas</emphasis>. Por ejemplo, la familia
de ayudas Common Desktop Environment lista vol&uacute;menes de ayudas para
las aplicaciones de escritorio est&aacute;ndar. Puede explorar y abrir cualquiera
de los vol&uacute;menes listados.</para>
<sect2 id="UG.GHelp.div.28" role="Procedure">
<title>Para abrir el Gestor de ayuda<indexterm><primary>Gestor de ayuda</primary><secondary>abrir</secondary></indexterm></title>
<orderedlist>
<listitem><para>Pulse el control Gestor de ayuda, en el Panel frontal (vea
la <!--Original
XRef content: 'Figura&numsp;3&hyphen;2 en 
la p&aacute;gina&n--><!--umsp;31'--><xref role="CodeOrFigOrTabAndPNum" linkend="ug.ghelp.mkr.5">).
</para>
<para>Una ventana de ayuda mostrar&aacute; una lista de familias de ayudas
con ayuda en l&iacute;nea. Ese es el nivel superior del Gestor de ayuda.</para>
<figure>
<title>Vista de nivel superior del Gestor de ayuda</title>
<graphic id="ug.ghelp.grph.11" entityref="UG.GHelp.fig.12"></graphic>
</figure>
</listitem>
<listitem><para>Desplace la ventana para buscar el grupo de productos en que
est&aacute; interesado y pulse en su t&iacute;tulo (subrayado).</para>
<para>Esto har&aacute; que se listen los vol&uacute;menes de ayudas que hay
disponibles para ese producto.</para>
</listitem>
<listitem><para>Para abrir un volumen de ayudas determinado, pulse en su t&iacute;tulo
(texto subrayado).</para>
</listitem>
<listitem><para>Para volver al nivel superior del Gestor de ayuda, pulse el<indexterm>
<primary>mandatos de ayuda</primary><secondary>Nivel superior</secondary>
</indexterm> bot&oacute;n Nivel superior.</para>
</listitem>
</orderedlist>
<sect3 id="UG.GHelp.div.29">
<title>Ejemplo</title>
<para>Para explorar la ayuda en l&iacute;nea del Gestor de archivos:</para>
<orderedlist>
<listitem><para>Pulse el control Gestor de ayuda.</para>
</listitem>
<listitem><para>Elija Common Desktop Environment.</para>
</listitem>
<listitem><para>Desplace la lista de vol&uacute;menes de ayudas hasta que
vea Ayuda del Gestor de archivos.</para>
</listitem>
<listitem><para>Pulse en Ayuda del Gestor de archivos.</para>
<para>Se mostrar&aacute; la ayuda del Gestor de archivos. Esta es la misma
informaci&oacute;n de ayuda que ver&iacute;a si abriera Gestor de archivos
y seleccionar&aacute; Informaci&oacute;n general en el men&uacute; Ayuda.
</para>
</listitem>
</orderedlist>
<figure>
<title>Ayuda del Gestor de archivos visualizada en el Gestor de ayuda</title>
<graphic id="UG.GHelp.grph.12" entityref="UG.GHelp.fig.13"></graphic>
</figure>
</sect3>
</sect2>
<sect2 id="UG.GHelp.div.30" role="Procedure">
<title>Para duplicar una ventana de ayuda<indexterm><primary>mandatos de
ayuda</primary><secondary>Ventana nueva</secondary></indexterm><indexterm>
<primary>ventanas de ayuda</primary><secondary>duplicar</secondary></indexterm></title>
<orderedlist>
<listitem><para>Elija Ventana nueva en el men&uacute; Archivo del Gestor de
ayuda.</para>
<para>Se duplicar&aacute; la ventana de ayuda actual. Puede cambiar el tama&ntilde;o
de la nueva ventana y seleccionar temas con independencia de la ventana original.
</para>
</listitem>
<listitem><para>Para eliminar la ventana, elija Cerrar en el men&uacute; Archivo.
</para>
</listitem>
</orderedlist>
<note>
<para>El mandato Ventana nueva s&oacute;lo est&aacute; disponible en la ayuda
del Gestor de ayuda (vea <!--Original XRef content: ''--><xref role="CodeOrFigureOrTable"
linkend="UG.GHelp.mkr.4"> <!--Original XRef content: '&ldquo;Exploraci&oacute;n
de la ayuda del sistema&ldquo; en la 
p&aacute;gina&numsp;39'--><xref role="SecTitleAndPageNum" linkend="UG.GHelp.mkr.17">).
</para>
</note>
</sect2>
</sect1>
<sect1 id="UG.GHelp.div.31">
<title id="UG.GHelp.mkr.18">Visualizaci&oacute;n de una p&aacute;gina de manual
en l&iacute;nea<indexterm><primary>p&aacute;ginas de manual en l&iacute;nea,
visualizaci&oacute;n</primary></indexterm></title>
<para>Las p&aacute;ginas de referencia del manual en l&iacute;nea se pueden
visualizar utilizando la acci&oacute;n Visor de p&aacute;gina de manual. El
icono de acci&oacute;n est&aacute; situado en la carpeta Apls_Escritorio del
Gestor de aplicaciones.</para>
<figure>
<title>Icono de acci&oacute;n P&aacute;gina de manual</title>
<graphic id="UG.GHelp.grph.13" entityref="UG.GHelp.fig.14"></graphic>
</figure>
<sect2 id="UG.GHelp.div.32" role="Procedure">
<title id="UG.GHelp.mkr.19">Para mostrar una p&aacute;gina de manual en l&iacute;nea<indexterm><primary>mostrar</primary><secondary>p&aacute;ginas de manual</secondary></indexterm><indexterm><primary>p&aacute;ginas de manual, mostrar</primary></indexterm></title>
<orderedlist>
<listitem><para>Pulse el control Gestor de aplicaciones, en el Panel frontal.
</para>
<graphic id="ug.ghelp.igrph.2" entityref="UG.GHelp.fig.15"></graphic>
</listitem>
<listitem><para>Efect&uacute;e una doble pulsaci&oacute;n sobre el icono Apls_Escritorio.
</para>
</listitem>
<listitem><para>Pulse el icono Visor de p&aacute;gina de manual.</para>
<para>Se mostrar&aacute; un cuadro de di&aacute;logo, que le solicita que
entre un nombre de p&aacute;gina de manual.</para>
<graphic id="ug.ghelp.igrph.3" entityref="UG.GHelp.fig.16"></graphic>
</listitem>
<listitem><para>Escriba el nombre de la p&aacute;gina de manual que desea
ver y pulse Intro.</para>
<para>La p&aacute;gina de manual aparecer&aacute; en una ventana de ayuda
r&aacute;pida.</para>
</listitem>
<listitem><para>Pulse Cerrar para eliminar la p&aacute;gina de manual.</para>
</listitem>
</orderedlist>
</sect2>
</sect1>
<sect1 id="UG.GHelp.div.33">
<title id="UG.GHelp.mkr.20">Impresi&oacute;n de temas de la ayuda<indexterm>
<primary>imprimir</primary><secondary>temas de la ayuda</secondary></indexterm><indexterm>
<primary>ayuda</primary><secondary>imprimir temas de la ayuda</secondary>
</indexterm></title>
<para>En ocasiones, tal vez le interese tener una versi&oacute;n impresa de
un tema de la ayuda para una aplicaci&oacute;n determinada. Puede imprimir
un tema individual de la ayuda, una tabla de contenido y un &iacute;ndice
o el volumen de ayudas completo. En el cuadro de di&aacute;logo Imprimir tambi&eacute;n
se pueden establecer opciones de impresi&oacute;n, tales como el tama&ntilde;o
del papel, el n&uacute;mero de copias y la impresora de destino.</para>
<para>Los temas de la ayuda impresos se env&iacute;an a la impresora predeterminada,
a menos que el usuario proporcione un nombre de impresora diferente en el
cuadro de di&aacute;logo. La salida impresa consta s&oacute;lo de texto.
</para>
<sect2 id="UG.GHelp.div.34" role="Procedure">
<title id="UG.GHelp.mkr.21">Para imprimir un tema de la ayuda<indexterm><primary>mandatos de ayuda</primary><secondary>Imprimir</secondary></indexterm></title>
<orderedlist>
<listitem><para>Elija Imprimir en el men&uacute; Archivo. (En una ventana
de ayuda r&aacute;pida, pulse el bot&oacute;n Imprimir.)</para>
<para>Puede utilizar los valores predeterminados del cuadro de di&aacute;logo
Imprimir e ir al paso 5 o entrar nuevos valores para el trabajo de impresi&oacute;n.
</para>
<graphic id="ug.ghelp.igrph.4" entityref="UG.GHelp.fig.17"></graphic>
</listitem>
<listitem><para>Opcional. Escriba el nombre de la impresora que desea utilizar.
</para>
</listitem>
<listitem><para><emphasis>Opcional</emphasis>. Escriba el n&uacute;mero de
copias a imprimir.</para>
</listitem>
<listitem><para><emphasis>Opcional.</emphasis> Pulse el bot&oacute;n del tama&ntilde;o
de papel para elegir un tama&ntilde;o de papel.</para>
</listitem>
<listitem><para>Seleccione el tema o los temas que desea imprimir.</para>
<informaltable>
<tgroup cols="2" colsep="0" rowsep="0">
<colspec colwidth="234*">
<colspec colwidth="294*">
<tbody>
<row>
<entry align="left" valign="top"><para>Tema Actual (valor predeterminado)
</para></entry>
<entry align="left" valign="top"><para>Imprime s&oacute;lo el tema seleccionado
</para></entry></row>
<row>
<entry align="left" valign="top"><para>Actual y Subtemas</para></entry>
<entry align="left" valign="top"><para>Imprime el tema seleccionado y sus
subtemas</para></entry></row>
<row>
<entry align="left" valign="top"><para>Tabla de Contenido e &Iacute;ndice
</para></entry>
<entry align="left" valign="top"><para>Imprime la tabla de contenido y el
&iacute;ndice del volumen de ayudas</para></entry></row>
<row>
<entry align="left" valign="top"><para>Todos los Temas en el Volumen</para></entry>
<entry align="left" valign="top"><para>Imprime el contenido del volumen de
ayudas, incluyendo la tabla de contenido y el &iacute;ndice</para></entry>
</row></tbody></tgroup></informaltable>
</listitem>
<listitem><para>Pulse Imprimir.</para>
</listitem>
</orderedlist>
</sect2>
<sect2 id="UG.GHelp.div.35">
<title>Configuraci&oacute;n de impresi&oacute;n</title>
<para>El cuadro de di&aacute;logo Imprimir muestra el nombre de la impresora
predeterminada. Puede cambiar el nombre de la impresora predeterminada modificando
la variable de entorno LPDEST. Puede tambi&eacute;n cambiar la impresora para
una aplicaci&oacute;n determinada modificando el archivo de valores predeterminados
de la aplicaci&oacute;n.</para>
<sect3 id="UG.GHelp.div.36" role="Procedure">
<title>Para definir el recurso de impresora para una aplicaci&oacute;n</title>
<itemizedlist>
<listitem><para>Edite el archivo <emphasis>DirectorioInicio</emphasis>/ <computeroutput>.Xdefaults</computeroutput> a&ntilde;adiendo este recurso:</para>
<para remap="CodeIndent2"><programlisting><symbol role="Variable">nombre_aplicaci&oacute;n</symbol>*printer: <symbol role="variable">nombre</symbol></programlisting></para>
<para>Si no tiene un archivo <computeroutput>.Xdefaults</computeroutput>,
cree el archivo en su directorio de inicio.</para>
</listitem>
</itemizedlist>
<sect4 id="UG.GHelp.div.37">
<title>Ejemplo</title>
<para>Desea dirigir toda la ayuda impresa de una aplicaci&oacute;n llamada
ImageScan a una impresora llamada <computeroutput>laser2</computeroutput>
en lugar de dirigirla a la impresora predeterminada.</para>
<para>A&ntilde;ada este recurso al archivo <computeroutput>.Xdefaults</computeroutput>:
</para>
<programlisting>ImageScan*printer: laser2</programlisting>
</sect4>
</sect3>
</sect2>
</sect1>
<sect1 id="UG.GHelp.div.38">
<title>Modificaci&oacute;n de los colores de la ventana de ayuda<?X-setsize 12.0 pt><indexterm>
<primary>ayuda</primary><secondary>colores de la ventana</secondary></indexterm><indexterm>
<primary>color</primary><secondary>de ventanas de ayuda</secondary></indexterm><indexterm>
<primary>ventanas de ayuda</primary><secondary>color de</secondary></indexterm></title>
<para>Puede cambiar los colores del &aacute;rbol de temas o del &aacute;rea
de visualizaci&oacute;n de temas de una ventana de ayuda definiendo recursos
de aplicaci&oacute;n. Es importante elegir colores contrastantes. Esto asegura
que el texto (color en primer plano) se distinga del color de fondo.</para>
<sect2 id="UG.GHelp.div.39" role="Procedure">
<title id="UG.GHelp.mkr.22">Para cambiar los colores de una ventana de ayuda
de una aplicaci&oacute;n</title>
<orderedlist>
<listitem><para>Edite el archivo <filename><symbol>DirectorioInicio</symbol>/.Xdefaults</filename> a&ntilde;adiendo estos recursos:</para>
<programlisting>nombre_aplicaci&oacute;n*DtHelpDialog*DisplayArea.foreground: color
nombre_aplicaci&oacute;n*DtHelpDialog*DisplayArea.background: color
nombre_aplicaci&oacute;n*DtHelpDialog*TocArea.foreground:  color
nombre_aplicaci&oacute;n*DtHelpDialog*TocArea.background:  color
nombre_aplicaci&oacute;n*DtHelpQuickDialog*DisplayArea.foreground:  color
nombre_aplicaci&oacute;n*DtHelpQuickDialog*DisplayArea.background:  color
</programlisting>
<para>Sustituya <symbol>nombre_aplicaci&oacute;n</symbol> por el nombre de
la aplicaci&oacute;n cuyas ventanas de ayuda desea cambiar.</para>
<para>Puede solicitar al administrador del sistema una lista de colores que
pueda utilizar o consultar la documentaci&oacute;n del sistema.</para>
</listitem>
<listitem><para>Guarde y cierre el archivo.</para>
<para>Cuando reinicie la aplicaci&oacute;n, est&aacute; utilizar&aacute; en
sus ventanas de ayuda los nuevos valores de color para el &aacute;rbol de
temas y el &aacute;rea de visualizaci&oacute;n de temas.</para>
</listitem>
</orderedlist>
<sect3 id="UG.GHelp.div.40">
<title>Ejemplo</title>
<para>Estas entradas de recurso cambian los colores del texto y de fondo del
&aacute;rbol de temas (TocArea) y del &aacute;rea de visualizaci&oacute;n
de temas (DisplayArea) para una aplicaci&oacute;n llamada DtCardCatalog.
</para>
<programlisting>DtCardCatalog*DtHelpDialog*TocArea.foreground: yellow
DtCardCatalog*DtHelpDialog*TocArea.background: blue
DtCardCatalog*DtHelpDialog*DisplayArea.foreground: yellow
DtCardCatalog*DtHelpDialog*DisplayArea.background: blue
DtCardCatalog*DtHelpQuickDialog*DisplayArea.foreground: yellow
DtCardCatalog*DtHelpQuickDialog*DisplayArea.background: blue</programlisting>
<para>Las ventanas de ayuda r&aacute;pida no tienen un &aacute;rbol de temas,
por lo tanto se omite el recurso <computeroutput>TocArea</computeroutput>.
</para>
<para id="UG.GHelp.mkr.23"></para>
</sect3>
</sect2>
</sect1>
</chapter>
<!--fickle 1.14 mif-to-docbook 1.7 01/02/96 15:01:23-->
<?Pub Caret>
<?Pub *0000057579>

