<!-- $XConsortium: ch05.sgm /main/10 1996/12/20 20:25:18 rws $ -->
<!-- (c) Copyright 1995 Digital Equipment Corporation. -->
<!-- (c) Copyright 1995 Hewlett-Packard Company. -->
<!-- (c) Copyright 1995 International Business Machines Corp. -->
<!-- (c) Copyright 1995 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1995 Novell, Inc. -->
<!-- (c) Copyright 1995 FUJITSU LIMITED. -->
<!-- (c) Copyright 1995 Hitachi. -->
<chapter id="UG.FMgr.div.1">
<title id="UG.FMgr.mkr.1">Gesti&oacute;n de archivos con el Gestor de archivos</title>
<para id="UG.FMgr.mkr.2">Utilice el Gestor de archivos para crear, buscar
y utilizar objetos de espacio de trabajo: archivos, carpetas y aplicaciones.
Cada objeto est&aacute; representado por un icono en el Gestor de archivos.
</para>
<informaltable id="UG.FMgr.itbl.1" frame="All">
<tgroup cols="1" colsep="1" rowsep="1">
<colspec colwidth="4.00in">
<tbody>
<row>
<entry align="left" valign="top"><para><!--Original XRef content: 'Introducci&oacute;n
a la ventana y al escritorio del Gestor de archivos61'--><xref role="JumpText"
linkend="UG.FMgr.mkr.3"></para></entry></row>
<row>
<entry align="left" valign="top"><para><!--Original XRef content: 'Conceptos
b&aacute;sicos sobre el sistema de archivos62'--><xref role="JumpText" linkend="UG.FMgr.mkr.4"></para></entry>
</row>
<row>
<entry align="left" valign="top"><para><!--Original XRef content: 'Conocimientos
b&aacute;sicos sobre la gesti&oacute;n de archivos64'--><xref role="JumpText"
linkend="UG.FMgr.mkr.5"></para></entry></row>
<row>
<entry align="left" valign="top"><para><!--Original XRef content: 'Manejo
de archivos y carpetas69'--><xref role="JumpText" linkend="UG.FMgr.mkr.12"></para></entry>
</row>
<row>
<entry align="left" valign="top"><para><!--Original XRef content: 'Desplazamiento
hacia carpetas y subcarpetas71'--><xref role="JumpText" linkend="UG.FMgr.mkr.14"></para></entry>
</row>
<row>
<entry align="left" valign="top"><para><!--Original XRef content: 'Supresi&oacute;n
de objetos con la Papelera73'--><xref role="JumpText" linkend="UG.FMgr.mkr.16"></para></entry>
</row>
<row>
<entry align="left" valign="top"><para><!--Original XRef content: 'Uso de
objetos del Gestor de Archivos en el escritorio77'--><xref role="JumpText"
linkend="UG.FMgr.mkr.19"></para></entry></row>
<row>
<entry align="left" valign="top"><para><!--Original XRef content: 'Localizaci&oacute;n
de archivos78'--><xref role="JumpText" linkend="UG.FMgr.mkr.20"></para></entry>
</row>
<row>
<entry align="left" valign="top"><para><!--Original XRef content: 'Personalizaci&oacute;n
de vistas del Gestor de archivos81'--><xref role="JumpText" linkend="UG.FMgr.mkr.23"></para></entry>
</row></tbody></tgroup></informaltable>
<sect1 id="UG.FMgr.div.2" role="Procedure">
<title>Para abrir el Gestor de archivos</title>
<itemizedlist>
<listitem><para>Pulse el control Gestor de archivos, en el Panel frontal.<indexterm>
<primary>Gestor de archivos</primary><secondary>iniciar</secondary></indexterm><indexterm>
<primary>Panel frontal</primary><secondary>control Gestor de archivos</secondary>
</indexterm><indexterm><primary>Gestor de archivos</primary><secondary>control
del Panel frontal</secondary></indexterm><indexterm><primary>iniciar</primary>
<secondary>Gestor de archivos</secondary></indexterm></para>
</listitem>
</itemizedlist>
<graphic id="UG.FMgr.igrph.1" entityref="UG.FMgr.fig.1"></graphic>
</sect1>
<sect1 id="UG.FMgr.div.3">
<title id="UG.FMgr.mkr.3">Introducci&oacute;n a la ventana y al escritorio
del Gestor de archivos</title>
<para><indexterm><primary>Gestor de archivos</primary><secondary>ventana principal</secondary></indexterm>La ventana principal del Gestor de archivos es una
vista de una carpeta del sistema. La carpeta que el usuario est&aacute; viendo
actualmente se denomina <emphasis>carpeta actual</emphasis></para>
<graphic id="UG.FMgr.igrph.2" entityref="UG.FMgr.fig.2"></graphic>
<informaltable>
<tgroup cols="2" colsep="0" rowsep="0">
<colspec colwidth="264*">
<colspec colwidth="264*">
<tbody>
<row>
<entry align="left" valign="top"><para>Ruta de la carpeta actual</para></entry>
<entry align="left" valign="top"><para>Muestra la ruta hacia la carpeta actual
</para></entry></row>
<row>
<entry align="left" valign="top"><para>Barra de men&uacute;s y men&uacute;s
</para></entry>
<entry align="left" valign="top"><para>Contienen los mandatos disponibles
en el Gestor de archivos</para></entry></row>
<row>
<entry align="left" valign="top"><para>&Aacute;rea de visualizaci&oacute;n
de objetos</para></entry>
<entry align="left" valign="top"><para>Muestra los objetos (archivos y carpetas)
existentes en la carpeta de trabajo actual</para></entry></row>
<row>
<entry align="left" valign="top"><para>Iconos de objeto</para></entry>
<entry align="left" valign="top"><para>Son iconos que representan los archivos
y las carpetas de la carpeta actual</para></entry></row></tbody></tgroup>
</informaltable>
</sect1>
<sect1 id="UG.FMgr.div.4">
<title id="UG.FMgr.mkr.4">Conceptos b&aacute;sicos sobre el sistema de archivos</title>
<para>Esta secci&oacute;n describe conceptos b&aacute;sicos sobre el sistema
de archivos.<indexterm><primary>sistema jer&aacute;rquico de archivos</primary>
</indexterm><indexterm><primary>sistema de archivos</primary><secondary>conceptos</secondary></indexterm><indexterm><primary>sistema de archivos</primary><secondary>jer&aacute;rquico</secondary></indexterm></para>
<sect2 id="UG.FMgr.div.5">
<title>Archivos</title>
<para>Un <emphasis>archivo</emphasis> es un contenedor de informaci&oacute;n.
La mayor&iacute;a de los archivos que utiliza un usuario contienen informaci&oacute;n
(datos) en un formato determinado: un documento, una hoja de c&aacute;lculo,
un gr&aacute;fico. El formato es la manera particular en que est&aacute;n
dispuestos los datos dentro del archivo. El formato de un archivo se conoce
como su <emphasis>tipo de datos</emphasis>.</para>
<para>Cuando el Gestor de archivos est&aacute; en uno de sus modos de vista
de iconos, se puede identificar el tipo de datos de un archivo por el icono
utilizado para representar al archivo. Cada tipo de datos tiene un icono diferente.
</para>
<para>La mayor&iacute;a de los programas de aplicaci&oacute;n reconocen un
n&uacute;mero limitado de tipos de datos. Por ejemplo, un editor de documentos
probablemente no puede leer un archivo de hoja de c&aacute;lculo. El escritorio
ayuda al usuario a reconocer diferentes tipos de archivos utilizando una base
de datos de tipos de datos. Un tipo de datos identifica los archivos de un
formato determinado y los asocia a las aplicaciones adecuadas. Estas asociaciones
permiten que el usuario no tenga que recordar mandatos para realizar tareas
frecuentes. En la mayor&iacute;a de los casos, cuando se efect&uacute;a una
doble pulsaci&oacute;n en un archivo, el escritorio ejecuta autom&aacute;ticamente
la aplicaci&oacute;n que reconoce el tipo de datos de ese archivo.</para>
<para>La longitud m&aacute;xima permitida de un nombre de archivo var&iacute;a
de un sistema a otro. Algunos sistemas operativos no permiten nombres de
archivo m&aacute;s largos de 14 caracteres. Si es necesario, consulte al
administrador del sistema.</para>
</sect2>
<sect2 id="UG.FMgr.div.6">
<title>Carpetas<indexterm><primary>carpetas</primary><secondary>definici&oacute;n
de</secondary></indexterm><indexterm><primary>objetos</primary><secondary>carpeta</secondary></indexterm></title>
<para><indexterm><primary>directorios,&lt;Emphasis>V&eacute;ase&lt;Default
Para Font> carpetas&lt;$nopage></primary></indexterm>Una <emphasis>carpeta</emphasis> es un contenedor de archivos, similar a la carpeta de un archivador.
De hecho, el Gestor de archivos utiliza un icono de carpeta para representar
una carpeta. Una carpeta puede contener otras carpetas, a veces denominadas
subcarpetas. Mediante carpetas y subcarpetas, puede crear varios niveles de
organizaci&oacute;n que forman una jerarqu&iacute;a. En otros contextos, las
carpetas reciben frecuentemente el nombre de directorios.</para>
<para>Si hacemos un dibujo de la jerarqu&iacute;a de carpetas con cada subcarpeta
debajo de la carpeta que la contiene &mdash; su carpeta padre &mdash; y trazamos
una l&iacute;nea que conecte cada carpeta con su padre, el dibujo resultante
tendr&iacute;a el aspecto de un &aacute;rbol invertido. Por ello, la jerarqu&iacute;a
de carpetas a menudo se denomina <emphasis>&aacute;rbol de carpetas</emphasis>.<indexterm><primary>subdirectorios</primary><secondary>definici&oacute;n
de</secondary></indexterm><indexterm><primary>subcarpetas</primary><secondary>definici&oacute;n de</secondary></indexterm>
</para>
<para>Dentro de cualquier carpeta individual, cada nombre de archivo debe
ser exclusivo. Sin embargo, hay archivos de carpetas diferentes que pueden
tener el mismo nombre.</para>
<para>Cuando se desplaza de una carpeta a otra, la llamada <emphasis>carpeta
actual<indexterm><primary>carpeta actual</primary></indexterm></emphasis>
constituye su ubicaci&oacute;n actual.</para>
</sect2>
<sect2 id="UG.FMgr.div.7">
<title>Objetos</title>
<para>Puesto que los archivos y las carpetas est&aacute;n representados por
iconos en el Gestor de archivos, el t&eacute;rmino <emphasis>objeto</emphasis>
se utiliza para describir a ambos elementos. Los objetos son entidades discretas
del escritorio que el usuario puede crear y manipular.</para>
<para>En el escritorio, las aplicaciones pueden tambi&eacute;n estar representadas
como objetos. Por ejemplo, el Gestor de aplicaciones contiene objetos que
representan aplicaciones que est&aacute;n disponibles en el sistema.</para>
</sect2>
<sect2 id="UG.FMgr.div.8">
<title>Rutas<indexterm><primary>ruta de archivo</primary></indexterm><indexterm>
<primary>ruta</primary></indexterm><indexterm><primary>ruta</primary></indexterm></title>
<para>A menudo la ubicaci&oacute;n de un archivo se especifica listando las
carpetas y subcarpetas que conducen al archivo; esta lista se denomina <emphasis>ruta</emphasis>. En el Gestor de archivos la ruta de un archivo puede verse
en dos lugares. Primero se muestra en forma de una cadena de iconos de carpeta
(ruta con iconos). En segundo lugar, se muestra en forma de texto en la l&iacute;nea
de ruta situada encima del &aacute;rea de visualizaci&oacute;n. Estas dos
&aacute;reas se pueden desactivar. (Vea <!--Original XRef content: '&ldquo;Para
configurar las cabeceras&ldquo; en la p&aacute;gina&numsp;81'--><xref role="SecTitleAndPageNum"
linkend="UG.FMgr.mkr.24"> para obtener m&aacute;s informaci&oacute;n.)</para>
<sect3 id="UG.FMgr.div.9">
<title>Rutas y nombres de ruta</title>
<para>La ruta a un objeto es una forma de especificar d&oacute;nde est&aacute;
situado el objeto en el sistema de archivos. Existen dos maneras de especificar
la ruta: la ruta absoluta y la ruta relativa.</para>
<sect4 id="UG.FMgr.div.10">
<title>Rutas absolutas</title>
<para>Una ruta es una <emphasis>ruta absoluta<indexterm><primary>ruta absoluta</primary></indexterm></emphasis> si comienza en la carpeta ra&iacute;z. La <emphasis>carpeta ra&iacute;z</emphasis> es la carpeta individual com&uacute;n del sistema
donde comienza la jerarqu&iacute;a. Si una ruta comienza con una barra inclinada
(/), es una ruta absoluta especificada desde la carpeta ra&iacute;z. Por ejemplo,
lo siguiente es la ruta absoluta del archivo <computeroutput>carta:</computeroutput></para>
<programlisting> /usr/dt/config/carta</programlisting>
</sect4>
<sect4 id="UG.FMgr.div.11">
<title>Rutas relativas</title>
<para>Una ruta es una <emphasis>ruta relativa<indexterm><primary>ruta relativa</primary></indexterm></emphasis> si describe la ubicaci&oacute;n de un archivo
o de una carpeta con respecto a la carpeta actual. Si el usuario se encuentra
en una carpeta y desea bajar por el &aacute;rbol de carpetas, no es necesario
que escriba la ruta absoluta. Puede simplemente escribir la ruta comenzando
con el nombre de la carpeta siguiente de la ruta. Si una ruta no comienza
con una barra inclinada, es una ruta relativa. Por ejemplo, si la carpeta
actual es <filename>/usr/dt</filename> y desea ir a la carpeta <filename>/usr/dt/config/cartas</filename>, utilizar&iacute;a la ruta relativa siguiente:
</para>
<programlisting>config/cartas</programlisting>
<para>Existen dos nombres especiales de carpetas que son &uacute;tiles cuando
se especifican rutas relativas. La carpeta &ldquo;.&rdquo; (a veces llamada
&ldquo;punto&rdquo;) representa la carpeta actual. La carpeta &ldquo;..&rdquo;
(a veces llamada &ldquo;punto-punto&rdquo;) representa la carpeta <emphasis>padre</emphasis> (la carpeta situada un nivel m&aacute;s arriba en la jerarqu&iacute;a
de carpetas). Por ejemplo, si la carpeta actual es <computeroutput>/usr/dt/config</computeroutput>, entonces la ruta relativa del archivo <computeroutput>Dtwm</computeroutput> ser&aacute;:</para>
<programlisting>../app-defaults/<symbol role="Variable">idioma</symbol>/Dtwm
</programlisting>
<para>ya que el archivo est&aacute; en la carpeta <computeroutput>/usr/dt/app-defaults/</computeroutput><symbol role="Variable">idioma</symbol>, un nivel por encima
de la carpeta actual y en la subcarpeta app-defaults/<symbol role="Variable">idioma</symbol>.</para>
</sect4>
<sect4 id="UG.FMgr.div.12">
<title>V&eacute;ase tambi&eacute;n</title>
<itemizedlist remap="Bullet1">
<listitem><para><!--Original XRef content: '&ldquo;Para
cambiar a otra carpeta&ldquo; en la p&aacute;gina&numsp;71'--><xref role="SecTitleAndPageNum"
linkend="UG.FMgr.mkr.15"></para>
</listitem>
<listitem><para><!--Original XRef content: '&ldquo;Para buscar
un objeto por nombre&ldquo; en la p&aacute;gina&numsp;79'--><xref role="SecTitleAndPageNum"
linkend="UG.FMgr.mkr.21"></para>
</listitem>
<listitem><para><!--Original XRef content: '&ldquo;Para buscar
un archivo por contenido&ldquo; en la p&aacute;gina&numsp;80'--><xref role="SecTitleAndPageNum"
linkend="UG.FMgr.mkr.22"></para>
</listitem>
</itemizedlist>
<para>Si todav&iacute;a desea saber m&aacute;s sobre el sistema de archivos,
consulte la ayuda en l&iacute;nea o la documentaci&oacute;n del sistema operativo.
Tambi&eacute;n encontrar&aacute; abundante bibliograf&iacute;a que trata sobre
los conceptos b&aacute;sicos de los sistemas de archivos y de la gesti&oacute;n
de archivos.</para>
</sect4>
</sect3>
</sect2>
</sect1>
<sect1 id="UG.FMgr.div.13">
<title id="UG.FMgr.mkr.5">Conocimientos b&aacute;sicos sobre la gesti&oacute;n
de archivos<indexterm><primary>conocimientos b&aacute;sicos sobre la gesti&oacute;n
de archivos</primary></indexterm><indexterm><primary>gesti&oacute;n de archivos,
conocimientos b&aacute;sicos</primary></indexterm><indexterm><primary>gesti&oacute;n
de archivos</primary></indexterm></title>
<para>Para comenzar a utilizar el Gestor de archivos, es necesario que adquiera
unos cuantos conocimientos b&aacute;sicos. Cada icono del Gestor de archivos
representa un objeto que el usuario puede manipular de varias maneras, incluyendo:
</para>
<itemizedlist remap="Bullet1">
<listitem><para>Seleccionar objetos</para>
</listitem>
<listitem><para>Arrastrar y soltar</para>
</listitem>
<listitem><para>Utilizar men&uacute;s emergentes</para>
</listitem>
<listitem><para>Renombrar objetos</para>
</listitem>
<listitem><para>Obtener ayuda en l&iacute;nea sobre objetos</para>
</listitem>
<listitem><para>Abrir objetos</para>
</listitem>
</itemizedlist>
<sect2 id="UG.FMgr.div.14" role="Procedure">
<title id="UG.FMgr.mkr.6">Para seleccionar un archivo o una carpeta individual<indexterm><primary>seleccionar</primary><secondary>archivos</secondary>
</indexterm><indexterm><primary>seleccionar</primary><secondary>carpetas</secondary></indexterm><indexterm><primary>seleccionar</primary><secondary>objetos</secondary></indexterm><indexterm><primary>seleccionar</primary>
<secondary>iconos</secondary></indexterm><indexterm><primary>objetos</primary>
<secondary>seleccionar individualmente</secondary></indexterm><indexterm>
<primary>archivos</primary><secondary>seleccionar individualmente</secondary>
</indexterm><indexterm><primary>carpetas</primary><secondary>seleccionar
individualmente</secondary></indexterm><indexterm><primary>iconos</primary>
<secondary>seleccionar individualmente</secondary></indexterm></title>
<para>Cuando selecciona el icono de un archivo o de una carpeta, su nombre
se resalta. Muchas opciones de los men&uacute;s del Gestor de archivos se
aplican al archivo o carpeta <emphasis>seleccionado</emphasis> actualmente.
El usuario selecciona un objeto para poder utilizar una de las opciones del
men&uacute; Seleccionado sobre ese objeto. El men&uacute; Seleccionado contiene
opciones que afectan s&oacute;lo a los objetos seleccionados actualmente.
El contenido de este men&uacute; cambia a medida que el usuario selecciona
diversas clases de objetos en el &aacute;rea de visualizaci&oacute;n. Estas
opciones aparecen en contraste atenuado hasta que seleccione un icono.</para>
<sect3 id="UG.FMgr.div.15">
<title>Rat&oacute;n</title>
<itemizedlist>
<listitem><para>Pulse una vez sobre el icono.</para>
</listitem>
</itemizedlist>
<sect4 id="UG.FMgr.div.16">
<title>Teclado</title>
<orderedlist>
<listitem><para>Utilice las teclas de tabulaci&oacute;n y de direcci&oacute;n
para poner el resaltado en el icono que desea seleccionar.</para>
</listitem>
<listitem><para>Pulse la Barra espaciadora.</para>
</listitem>
</orderedlist>
<para>Para cancelar la selecci&oacute;n de un archivo o carpeta, seleccione
otro icono o pulse el rat&oacute;n en un &aacute;rea vac&iacute;a de la ventana
Gestor de archivos.</para>
</sect4>
</sect3>
</sect2>
<sect2 id="UG.FMgr.div.17" role="Procedure">
<title id="UG.FMgr.mkr.7">Para seleccionar varios archivos y carpetas<indexterm>
<primary>seleccionar</primary><secondary>varios archivos</secondary></indexterm><indexterm>
<primary>seleccionar</primary><secondary>varias carpetas</secondary></indexterm><indexterm>
<primary>seleccionar</primary><secondary>varios objetos</secondary></indexterm><indexterm>
<primary>seleccionar</primary><secondary>varios iconos</secondary></indexterm><indexterm>
<primary>objetos</primary><secondary>seleccionar varios</secondary></indexterm><indexterm>
<primary>archivos</primary><secondary>seleccionar varios</secondary></indexterm><indexterm>
<primary>carpetas</primary><secondary>seleccionar varias</secondary></indexterm><indexterm>
<primary>iconos</primary><secondary>seleccionar varios</secondary></indexterm></title>
<para>El usuario selecciona varios objetos para poder utilizar una de las
opciones del men&uacute; Seleccionado sobre estos objetos. La selecci&oacute;n
m&uacute;ltiple de archivos es &uacute;til cuando desea suprimir varios archivos
a la vez, o mover un grupo de archivos a una nueva carpeta. Sin embargo, si
selecciona m&aacute;s de un objeto, el &aacute;rea Acciones del men&uacute;
Seleccionado estar&aacute; vac&iacute;a.</para>
<para>Cuando hay varios iconos seleccionados, el arrastre de cualquiera de
esos iconos provoca el arrastre del grupo completo. El men&uacute; Seleccionado
y varios mandatos de men&uacute; que se aplican s&oacute;lo a un &uacute;nico
objeto est&aacute;n inactivos.</para>
<sect3 id="UG.FMgr.div.18">
<title>Rat&oacute;n</title>
<itemizedlist remap="Bullet1">
<listitem><para>Pulse el bot&oacute;n izquierdo del rat&oacute;n en un &aacute;rea
vac&iacute;a de la vista, arrastre el rat&oacute;n para trazar un cuadro
alrededor de los iconos que desea seleccionar, luego libere el bot&oacute;n
del rat&oacute;n.</para>
<para><emphasis>Tambi&eacute;n</emphasis> puede pulsar el bot&oacute;n izquierdo
del
rat&oacute;n para seleccionar el primer icono, mantener pulsada la tecla Control
y pulsar a continuaci&oacute;n el bot&oacute;n izquierdo del rat&oacute;n
para seleccionar
cada icono adicional. Este m&eacute;todo es &uacute;til cuando los iconos
que desea seleccionar no est&aacute;n situados uno a continuaci&oacute;n de
otro.</para>
</listitem>
<listitem><para>Para eliminar un icono individual de un grupo seleccionado,
mantenga pulsada la tecla Control y pulse el icono que desea eliminar.</para>
</listitem>
</itemizedlist>
<sect4 id="UG.FMgr.div.19">
<title>Teclado</title>
<orderedlist>
<listitem><para>Seleccione el primer icono de archivo o de carpeta pulsando
la Barra espaciadora.</para>
</listitem>
<listitem><para>Para cada icono adicional que desee seleccionar, ponga el
resaltado sobre el icono, luego pulse Control+Barra espaciadora.</para>
</listitem>
</orderedlist>
</sect4>
</sect3>
</sect2>
<sect2 id="UG.FMgr.div.20" role="Procedure">
<title id="UG.FMgr.mkr.8">Para arrastrar y soltar un archivo o carpeta<indexterm>
<primary>soltar</primary><secondary>archivos</secondary></indexterm><indexterm>
<primary>soltar</primary><secondary>carpetas</secondary></indexterm><indexterm>
<primary>soltar</primary><secondary>objetos</secondary></indexterm><indexterm>
<primary>objetos</primary><secondary>soltar</secondary></indexterm><indexterm>
<primary>archivos</primary><secondary>soltar</secondary></indexterm><indexterm>
<primary>carpetas</primary><secondary>soltar</secondary></indexterm><indexterm>
<primary>cancelar</primary><secondary>arrastre</secondary></indexterm><indexterm>
<primary>arrastre</primary><secondary>cancelaci&oacute;n</secondary></indexterm><indexterm><primary>arrastrar</primary><secondary>archivos</secondary></indexterm><indexterm>
<primary>arrastrar</primary><secondary>carpetas</secondary></indexterm><indexterm>
<primary>archivos</primary><secondary>arrastrar</secondary></indexterm><indexterm>
<primary>carpetas</primary><secondary>arrastrar</secondary></indexterm><indexterm>
<primary>objetos</primary><secondary>arrastrar</secondary></indexterm><indexterm>
<primary>arrastrar</primary><secondary>objetos</secondary></indexterm></title>
<orderedlist>
<listitem><para>Ponga el puntero del rat&oacute;n sobre el archivo o carpeta.
</para>
</listitem>
<listitem><para>Pulse <emphasis>y mantenga pulsado</emphasis> el bot&oacute;n
1 del rat&oacute;n.</para>
</listitem>
<listitem><para>Arrastre el icono al lugar donde desea soltarlo.</para>
</listitem>
<listitem><para>Libere el bot&oacute;n del rat&oacute;n.</para>
</listitem>
</orderedlist>
<para>Por tanto, la acci&oacute;n para soltar un objeto es <emphasis>pulsar&hellip;arrastrar&hellip;liberar</emphasis>.</para>
<para>Para cancelar un arrastre en progreso, pulse Esc antes de liberar el
bot&oacute;n del rat&oacute;n.</para>
<figure>
<title>Icono de arrastre mostrando el objeto que se arrastra</title>
<graphic id="UG.FMgr.grph.1" entityref="UG.FMgr.fig.3"></graphic>
</figure>
<para>Si hay m&aacute;s de un icono seleccionado, arrastre el grupo completo
arrastrando cualquiera de los iconos seleccionados.</para>
<note>
<para>No puede arrastrar y soltar un objeto sin un rat&oacute;n u otro dispositivo
de puntero.</para>
</note>
<sect3 id="UG.FMgr.div.21">
<title>Tareas b&aacute;sicas de arrastrar y soltar</title>
<itemizedlist remap="Bullet1">
<listitem><para>Para mover un archivo a otra carpeta, suelte el icono sobre
el icono de la carpeta de destino. Asimismo, si est&aacute;n abiertas tanto
la carpeta de origen como la de destino, arrastre el icono desde la ventana
de vista de la carpeta de origen y su&eacute;ltelo en el fondo de la ventana
de vista de la carpeta.</para>
</listitem>
<listitem><para>Para colocar un icono de archivo o de carpeta en el fondo
del espacio de trabajo actual, suelte el icono fuera de cualquier ventana.
En realidad, un objeto de espacio de trabajo es s&oacute;lo una <emphasis>referencia</emphasis> al objeto real, el cual permanece inalterado en la vista
del Gestor de archivos.</para>
</listitem>
<listitem><para>Para imprimir un archivo, suelte el icono del archivo en el
control Impresora del Panel frontal (o en una de las impresoras del subpanel
Impresoras personales).</para>
</listitem>
<listitem><para>Para suprimir un archivo o carpeta, suelte el icono del archivo
o carpeta en el control Papelera del Panel frontal.</para>
</listitem>
</itemizedlist>
<para>Si intenta soltar un icono en una ubicaci&oacute;n que no da soporte
a objetos soltados, el icono vuelve a su ubicaci&oacute;n original en el Gestor
de archivos o en el escritorio.</para>
</sect3>
</sect2>
<sect2 id="UG.FMgr.div.22" role="Procedure">
<title id="UG.FMgr.mkr.9">Para abrir un men&uacute; emergente<indexterm>
<primary>men&uacute;s emergentes</primary><secondary>abrir</secondary></indexterm></title>
<para>Cada objeto del Gestor de archivos tiene un men&uacute; emergente. La
propia ventana del Gestor de archivos tiene un men&uacute; emergente, que
se puede visualizar cuando el puntero est&aacute; en un lugar de la ventana
de vista fuera de los l&iacute;mites de los objetos de archivo o carpeta individuales.
</para>
<sect3 id="UG.FMgr.div.23">
<title>Rat&oacute;n</title>
<orderedlist>
<listitem><para>Se&ntilde;ale al icono cuyo men&uacute; emergente desea abrir
y pulse el bot&oacute;n derecho del rat&oacute;n. (En un rat&oacute;n de dos
botones,
pulse el bot&oacute;n derecho.)</para>
<figure>
<title>Men&uacute; emergente de ejemplo</title>
<graphic id="ug.fmgr.grph.2" entityref="UG.FMgr.fig.4"></graphic>
</figure>
</listitem>
<listitem><para>Para seleccionar un mandato del men&uacute;, arrastre hasta
el mandato, luego libere. Tambi&eacute;n puede pulsar sobre el mandato.</para>
</listitem>
</orderedlist>
<sect4 id="UG.FMgr.div.24">
<title>Teclado</title>
<orderedlist>
<listitem><para>Utilice las teclas de tabulaci&oacute;n y de direcci&oacute;n
para poner el resaltado en el icono cuyo men&uacute; desea abrir.</para>
</listitem>
<listitem><para>Pulse Desplazamiento+F10.</para>
</listitem>
<listitem><para>Para seleccionar un mandato del men&uacute;, utilice las teclas
de direcci&oacute;n para resaltar el mandato, luego pulse Intro.</para>
</listitem>
<listitem><para>Para cancelar el men&uacute; sin seleccionar un mandato, pulse
Esc.</para>
</listitem>
</orderedlist>
</sect4>
</sect3>
</sect2>
<sect2 id="UG.FMgr.div.25" role="Procedure">
<title id="UG.FMgr.mkr.10">Para renombrar un archivo o carpeta<indexterm>
<primary>renombrar</primary><secondary>objetos</secondary></indexterm><indexterm>
<primary>objetos</primary><secondary>renombrar</secondary></indexterm><indexterm>
<primary>renombrar</primary><secondary>archivos</secondary></indexterm><indexterm>
<primary>renombrar</primary><secondary>carpetas</secondary></indexterm><indexterm>
<primary>objetos</primary><secondary>renombrar</secondary></indexterm><indexterm>
<primary>archivos</primary><secondary>renombrar</secondary></indexterm><indexterm>
<primary>carpetas</primary><secondary>renombrar</secondary></indexterm></title>
<note>
<para>No puede cambiar el nombre de acciones.</para>
</note>
<sect3 id="UG.FMgr.div.26">
<title>Rat&oacute;n</title>
<orderedlist>
<listitem><para>Seleccione el nombre del archivo o carpeta pulsando en el
nombre situado debajo de su icono.</para>
</listitem>
<listitem><para>Escriba el nuevo nombre.</para>
</listitem>
<listitem><para>Pulse Intro. Si pulsa el rat&oacute;n fuera del nombre sin
primero pulsar Intro, los cambios se perder&aacute;n.</para>
</listitem>
</orderedlist>
<para>Para cancelar una operaci&oacute;n de cambio de nombre, pulse Esc.</para>
<sect4 id="UG.FMgr.div.27">
<title>Teclado</title>
<orderedlist>
<listitem><para>Utilice las teclas de tabulaci&oacute;n y de direcci&oacute;n
para ir hacia el icono del archivo o carpeta que desea renombrar.</para>
</listitem>
<listitem><para>Pulse la Barra espaciadora para resaltar (seleccionar) el
nombre de icono.</para>
</listitem>
<listitem><para>Seleccione Renombrar en el men&uacute; Seleccionado.</para>
</listitem>
<listitem><para>Escriba el nuevo nombre.</para>
</listitem>
<listitem><para>Pulse Intro.</para>
</listitem>
</orderedlist>
<para>Para cancelar una operaci&oacute;n de cambio de nombre, pulse Esc.</para>
</sect4>
</sect3>
</sect2>
<sect2 id="UG.FMgr.div.28" role="Procedure">
<title id="UG.FMgr.mkr.11">Para obtener ayuda sobre un archivo o carpeta<indexterm><primary>ayuda</primary><secondary>para objetos[help</secondary>
<tertiary>ob]</tertiary></indexterm><indexterm><primary>objetos</primary>
<secondary>obtener ayuda para</secondary></indexterm><indexterm><primary>ayuda</primary><secondary>mostrar para archivo</secondary></indexterm><indexterm>
<primary>ayuda</primary><secondary>mostrar para carpeta</secondary></indexterm><indexterm>
<primary>objetos</primary><secondary>obtener ayuda para</secondary></indexterm><indexterm>
<primary>archivos</primary><secondary>obtener ayuda para</secondary></indexterm><indexterm>
<primary>carpetas</primary><secondary>obtener ayuda para</secondary></indexterm><indexterm>
<primary>ayuda Sobre el Tema</primary></indexterm></title>
<para>La descripci&oacute;n que se muestra cuando solicita ayuda para un icono
describe el tipo de datos asociado al archivo o carpeta. La descripci&oacute;n
est&aacute; especificada en la definici&oacute;n del tipo de datos.</para>
<sect3 id="UG.FMgr.div.29">
<title>Rat&oacute;n</title>
<itemizedlist remap="Bullet1">
<listitem><para>Seleccione el archivo o carpeta, luego pulse F1.</para>
</listitem>
<listitem><para><emphasis>Tambi&eacute;n</emphasis> puede poner el puntero
del rat&oacute;n sobre el objeto y seleccionar ayuda en el men&uacute; emergente
del objeto (que se muestra pulsando el bot&oacute;n derecho del rat&oacute;n).
</para>
</listitem>
<listitem><para><emphasis>Tambi&eacute;n</emphasis> puede seleccionar Sobre
el Tema, en el men&uacute; Ayuda, y luego pulsar el icono del archivo o carpeta.
</para>
</listitem>
</itemizedlist>
<sect4 id="UG.FMgr.div.30">
<title>Teclado</title>
<itemizedlist>
<listitem><para>Utilice las teclas de tabulaci&oacute;n y de direcci&oacute;n
para ir hacia el icono, luego pulse F1.</para>
</listitem>
</itemizedlist>
</sect4>
<sect4 id="UG.FMgr.div.31">
<title>V&eacute;ase tambi&eacute;n</title>
<itemizedlist remap="Bullet1">
<listitem><para>Para saber m&aacute;s acerca de c&oacute;mo utilizar la Ayuda,
vea el <!--Original XRef content: 'Cap&iacute;tulo&numsp;3,

&ldquo;Obtenci&oacute;n de ayuda'--><xref role="ChapNumAndTitle" linkend="UG.GHelp.mkr.1">.
</para>
</listitem>
<listitem><para>Para ver una introducci&oacute;n a la creaci&oacute;n de tipos
de datos y de acciones, vea <!--Original XRef content: '&ldquo;Creaci&oacute;n
de acciones y de tipos de datos personales'--><xref role="SectionTitle" linkend="UG.UAppM.mkr.4">
en el <!--Original XRef content: 'Cap&iacute;tulo&numsp;6, &ldquo;Ejecuci&oacute;n
de aplicaciones desde el escritorio'--><xref role="ChapNumAndTitle" linkend="UG.UAppM.mkr.1">.
</para>
</listitem>
</itemizedlist>
</sect4>
</sect3>
</sect2>
<sect2 id="UG.FMgr.div.32">
<title>Apertura de un archivo o carpeta<indexterm><primary>abrir</primary>
<secondary>objetos</secondary></indexterm><indexterm><primary>objetos</primary>
<secondary>abrir</secondary></indexterm></title>
<para>La acci&oacute;n m&aacute;s b&aacute;sica que puede realizar sobre un
objeto es abrirlo. &ldquo;Abrir&rdquo; es un t&eacute;rmino muy general, y
la acci&oacute;n emprendida depende del tipo de objeto que est&aacute; abriendo.
Por ejemplo, la apertura de una carpeta modifica la vista del Gestor de archivos
para mostrar el contenido de esa carpeta. La apertura de un archivo de datos
generalmente inicia la aplicaci&oacute;n que cre&oacute; al archivo y carga
el archivo de datos.<indexterm><primary>abrir</primary><secondary>archivos</secondary></indexterm><indexterm><primary>abrir</primary><secondary>carpetas</secondary></indexterm><indexterm><primary>abrir</primary><secondary>objetos</secondary></indexterm><indexterm><primary>objetos</primary><secondary>abrir</secondary></indexterm><indexterm><primary>archivos</primary><secondary>abrir</secondary></indexterm><indexterm><primary>carpetas</primary><secondary>abrir</secondary></indexterm><indexterm><primary>men&uacute;</primary><secondary>Acciones</secondary></indexterm><indexterm><primary>doble pulsaci&oacute;n</primary><secondary>acci&oacute;n realizada</secondary></indexterm><indexterm>
<primary>acciones</primary><secondary>doble pulsaci&oacute;n</secondary></indexterm></para>
<sect3 id="UG.FMgr.div.33" role="Procedure">
<title>Para abrir un archivo o carpeta</title>
<itemizedlist remap="Bullet1">
<listitem><para>Efect&uacute;e una doble pulsaci&oacute;n sobre el icono.
</para>
<para>La doble pulsaci&oacute;n sobre un icono ejecuta la <emphasis>acci&oacute;n
predeterminada</emphasis> del objeto, que es siempre la primera acci&oacute;n
del &aacute;rea Acciones del men&uacute; Seleccionado. Para la mayor&iacute;a
de archivos de datos, la acci&oacute;n predeterminada abre el archivo mediante
el inicio de la aplicaci&oacute;n adecuada y la carga del archivo.</para>
</listitem>
<listitem><para><emphasis>O,</emphasis> seleccione el icono, luego vaya a
la barra de men&uacute;s y seleccione Abrir (o Abrir en Ventana Actual o Abrir
en Ventana Nueva) en el men&uacute; Seleccionado.</para>
</listitem>
<listitem><para><emphasis>O,</emphasis> seleccione una opci&oacute;n de Abrir
en el men&uacute; emergente del icono (que se muestra pulsando Desplazamiento+F10
o el bot&oacute;n derecho del rat&oacute;n).</para>
</listitem>
</itemizedlist>
</sect3>
</sect2>
</sect1>
<sect1 id="UG.FMgr.div.34">
<title id="UG.FMgr.mkr.12">Manejo de archivos y carpetas<indexterm><primary>objetos</primary><secondary>manejar</secondary></indexterm></title>
<para>Las principales caracter&iacute;sticas distintivas de un archivo o carpeta
son:</para>
<itemizedlist remap="Bullet1">
<listitem><para>Su nombre y ubicaci&oacute;n en la jerarqu&iacute;a de carpetas
</para>
</listitem>
<listitem><para>Sus permisos de propietario (propiedades).</para>
<para>Para obtener m&aacute;s informaci&oacute;n sobre permisos y c&oacute;mo
establecerlos, vea <!--Original XRef content: '&ldquo;Para cambiar los permisos
para un archivo o carpeta&ldquo; en la p&aacute;gina&numsp;76'--><xref role="SecTitleAndPageNum"
linkend="UG.FMgr.mkr.18">.</para>
</listitem>
<listitem><para>Si est&aacute; o no enlazado a otro archivo. Un archivo enlazado
es una representaci&oacute;n de otro archivo. Los archivos enlazados hacen
que un archivo parezca existir en dos o m&aacute;s carpetas.</para>
</listitem>
</itemizedlist>
<sect2 id="UG.FMgr.div.35" role="Procedure">
<title>Para crear un nuevo archivo o carpeta<indexterm><primary>objetos</primary>
<secondary>crear</secondary></indexterm><indexterm><primary>archivos</primary>
<secondary>crear</secondary></indexterm><indexterm><primary>carpetas</primary>
<secondary>crear</secondary></indexterm><indexterm><primary>crear</primary>
<secondary>objetos</secondary></indexterm><indexterm><primary>crear</primary>
<secondary>archivos</secondary></indexterm><indexterm><primary>crear</primary>
<secondary>carpetas</secondary></indexterm><indexterm><primary>crear</primary>
<secondary>objetos</secondary></indexterm><indexterm><primary>objetos</primary>
<secondary>crear</secondary></indexterm><indexterm><primary>archivos</primary>
<secondary>crear</secondary></indexterm><indexterm><primary>carpetas</primary>
<secondary>crear</secondary></indexterm></title>
<orderedlist>
<listitem><para>Seleccione Archivo nuevo o Carpeta nueva en el men&uacute;
Archivo.</para>
</listitem>
<listitem><para>Escriba el nombre en el campo Archivo nuevo o Carpeta nueva.
</para>
</listitem>
<listitem><para>Pulse OK o pulse Intro.</para>
</listitem>
</orderedlist>
<para>Para cerrar el cuadro de di&aacute;logo Archivo nuevo o Carpeta nueva
sin crear un nuevo archivo o carpeta, Pulse Cancelar o pulse Esc.</para>
<sect3 id="UG.FMgr.div.36">
<title>Otras formas de crear objetos</title>
<itemizedlist remap="Bullet1">
<listitem><para>Copie un objeto existente, luego renombre la copia (vea <!--Original
XRef content: '&ldquo;Para copiar un

archivo o carpeta&ldquo; en la p&aacute;gina&numsp;70'--><xref role="SecTitleAndPageNum"
linkend="UG.FMgr.mkr.13">).</para>
</listitem>
<listitem><para>Cree un nuevo archivo dentro de una aplicaci&oacute;n. Por
ejemplo, el Editor de textos crea un nuevo archivo cuando el usuario guarda
un nuevo documento.</para>
</listitem>
</itemizedlist>
</sect3>
</sect2>
<sect2 id="UG.FMgr.div.37" role="Procedure">
<title>Para mover un archivo o carpeta<indexterm><primary>mover</primary>
<secondary>objetos</secondary></indexterm><indexterm><primary>objetos</primary>
<secondary>mover</secondary></indexterm><indexterm><primary>mover</primary>
<secondary>archivos</secondary></indexterm><indexterm><primary>mover</primary>
<secondary>carpetas</secondary></indexterm><indexterm><primary>objetos</primary>
<secondary>mover</secondary></indexterm><indexterm><primary>archivos</primary>
<secondary>mover</secondary></indexterm><indexterm><primary>carpetas</primary>
<secondary>mover</secondary></indexterm></title>
<note>
<para>Si intenta mover un archivo o subcarpeta de una carpeta en la que no
tiene permiso para hacer cambios, el Gestor de archivos puede crear una copia
del objeto, y mostrar un mensaje de error que le indica que no puede suprimir
el archivo original.</para>
</note>
<sect3 id="UG.FMgr.div.38">
<title>Rat&oacute;n</title>
<orderedlist>
<listitem><para>Haga que est&eacute;n visibles las carpetas de origen y de
destino:</para>
<para>Abra una vista del Gestor de archivos que muestre el contenido de la
carpeta de destino o el icono de la carpeta de destino cerrada.</para>
</listitem>
<listitem><para>Seleccione el archivo o carpeta a mover y arr&aacute;strelo
hasta la carpeta de destino.</para>
</listitem>
</orderedlist>
<para>Si mueve una carpeta, se mover&aacute; la carpeta completa y su contenido.
</para>
<sect4 id="UG.FMgr.div.39">
<title>Teclado</title>
<orderedlist>
<listitem><para>Utilice las teclas de tabulaci&oacute;n y de direcci&oacute;n
para poner el resaltado en el archivo o carpeta a mover.</para>
</listitem>
<listitem><para>Pulse la Barra espaciadora para seleccionar el objeto.</para>
</listitem>
<listitem><para>En el men&uacute; Seleccionado, elija Mover a.</para>
</listitem>
<listitem><para>Escriba un nombre en el campo Carpeta de destino.</para>
<para>Por ejemplo, si desea mover el archivo <computeroutput>informe</computeroutput>
a la carpeta <computeroutput>/u/juan</computeroutput>, escribir&iacute;a <filename>/u/juan</filename></para>
</listitem>
<listitem><para>Pulse OK o pulse Intro.</para>
</listitem>
</orderedlist>
<para>Si mueve una carpeta, se mover&aacute; la carpeta completa y su contenido.
</para>
</sect4>
</sect3>
</sect2>
<sect2 id="UG.FMgr.div.40" role="Procedure">
<title id="UG.FMgr.mkr.13">Para copiar un archivo<indexterm><primary>copiar</primary><secondary>objetos</secondary></indexterm><indexterm><primary>copiar</primary><secondary>archivos</secondary></indexterm><indexterm><primary>copiar</primary><secondary>carpetas</secondary></indexterm><indexterm><primary>objetos</primary><secondary>copiar</secondary></indexterm><indexterm><primary>archivos</primary><secondary>copiar</secondary></indexterm><indexterm><primary>carpetas</primary><secondary><?Pub Caret1>copiar</secondary></indexterm> o
carpeta</title>
<sect3 id="UG.FMgr.div.41">
<title>Rat&oacute;n</title>
<orderedlist>
<listitem><para>Haga que est&eacute;n visibles las carpetas de origen y de
destino:</para>
<para>Abra una vista del Gestor de archivos que muestre el contenido de la
carpeta de destino o el icono de la carpeta de destino cerrada.</para>
</listitem>
<listitem><para>Seleccione el archivo o carpeta a copiar.</para>
</listitem>
<listitem><para>Pulse y mantenga pulsada la tecla Control.</para>
</listitem>
<listitem><para>Arrastre el archivo o carpeta y su&eacute;ltelo en la carpeta
de destino.</para>
<para>Aseg&uacute;rese de que libera el bot&oacute;n del rat&oacute;n antes
de liberar la tecla Control. De lo contrario, mover&aacute; el archivo o carpeta
en lugar de copiarlo.</para>
</listitem>
</orderedlist>
<sect4 id="UG.FMgr.div.42">
<title>Teclado</title>
<orderedlist>
<listitem><para>Seleccione el icono.</para>
</listitem>
<listitem><para>Elija Copiar en el men&uacute; Seleccionado.</para>
</listitem>
<listitem><para>Escriba un nombre en el campo Carpeta de destino.</para>
<para>Recuerde que &eacute;sta debe ser la nueva ruta completa del archivo.
Por ejemplo, si desea copiar el archivo <computeroutput>informe</computeroutput>
en la carpeta <filename>/u/juan</filename>, escribir&iacute;a <filename>/u/juan</filename>.</para>
</listitem>
<listitem><para>Pulse OK o Intro.</para>
</listitem>
</orderedlist>
<para>Para cerrar el cuadro de di&aacute;logo Copiar Archivo sin copiar un
archivo, pulse Cancelar o Esc.</para>
</sect4>
</sect3>
</sect2>
<sect2 id="UG.FMgr.div.43" role="Procedure">
<title>Para crear un enlace simb&oacute;lico<indexterm><primary>enlace simb&oacute;lico,
crear</primary></indexterm><indexterm><primary>simb&oacute;lico, crear enlace</primary></indexterm></title>
<para>Un icono de enlace es una copia de un icono que hace referencia al mismo
archivo o carpeta que el icono original. Los cambios que haga despu&eacute;s
de abrir el icono de enlace tambi&eacute;n aparecer&aacute;n cuando acceda
al archivo o carpeta que hace uso del icono original.</para>
<sect3 id="UG.FMgr.div.44">
<title>Rat&oacute;n</title>
<orderedlist>
<listitem><para>Haga que est&eacute;n visibles las carpetas de origen y de
destino:</para>
<itemizedlist remap="Bullet2">
<listitem><para>Abra una vista del Gestor de archivos que muestre el contenido
de la carpeta de destino.</para>
</listitem>
<listitem><para><emphasis>Tambi&eacute;n</emphasis> puede abrir una vista
del Gestor de archivos que muestre el icono de la carpeta de destino cerrada.
</para>
</listitem>
</itemizedlist>
</listitem>
<listitem><para>Seleccione el archivo o carpeta a copiar.</para>
</listitem>
<listitem><para>Pulse <emphasis>y mantenga pulsadas</emphasis> las teclas
Desplazamiento y Control mientras arrastra y suelta el icono de un archivo
o carpeta en el icono de una nueva carpeta.</para>
<para>Cuando suelta el icono, el Gestor de archivos crea un enlace simb&oacute;lico
en la nueva carpeta que apunta al archivo o carpeta original. Aseg&uacute;rese
de que libera el bot&oacute;n del rat&oacute;n antes de liberar las teclas
Desplazamiento y Control. De lo contrario, mover&aacute; el archivo o carpeta
en lugar de enlazarlo.</para>
</listitem>
</orderedlist>
<sect4 id="UG.FMgr.div.45">
<title>Teclado</title>
<orderedlist>
<listitem><para>Utilice las teclas de tabulaci&oacute;n y de direcci&oacute;n
para poner el resaltado en el icono del archivo o carpeta con el que desea
enlazar.</para>
</listitem>
<listitem><para>Pulse la Barra espaciadora para seleccionar el icono.</para>
</listitem>
<listitem><para>Elija Copiar como Enlace en el men&uacute; Seleccionado.
</para>
</listitem>
<listitem><para>Escriba un nombre en el campo Carpeta de destino, incluyendo
la ruta de la carpeta donde desea que aparezca este icono de enlace. Si desea
que este icono de enlace tenga un nombre diferente que el icono original,
escriba un nuevo nombre en el campo Nombre Para Copiar.</para>
</listitem>
<listitem><para>Pulse OK o pulse Intro.</para>
</listitem>
</orderedlist>
</sect4>
</sect3>
</sect2>
</sect1>
<sect1 id="UG.FMgr.div.46">
<title id="UG.FMgr.mkr.14">Desplazamiento hacia carpetas y subcarpetas<indexterm>
<primary>carpetas</primary><secondary>cambiar</secondary></indexterm><indexterm>
<primary>sistema de archivos</primary><secondary>desplazamiento por el</secondary>
</indexterm><indexterm><primary>subdirectorios</primary><secondary>cambiar
a</secondary></indexterm><indexterm><primary>subcarpetas</primary><secondary>cambiar a</secondary></indexterm></title>
<para>Cada ventana del Gestor de archivos (tambi&eacute;n llamada <emphasis>vista</emphasis>) muestra el contenido de una carpeta individual.</para>
<para>Si no est&aacute; familiarizado con los sistemas jer&aacute;rquicos
de archivos, vea <!--Original XRef content: '&ldquo;Conceptos b&aacute;sicos
sobre el sistema de archivos&ldquo; en la p&aacute;gina&numsp;62'--><xref
role="SecTitleAndPageNum" linkend="UG.FMgr.mkr.4">.</para>
<sect2 id="UG.FMgr.div.47" role="Procedure">
<title id="UG.FMgr.mkr.15">Para cambiar a otra carpeta<indexterm><primary>carpetas</primary><secondary>cambiar a</secondary></indexterm></title>
<para>Puede cambiar a otra carpeta de cualquiera de estas formas:</para>
<itemizedlist remap="Bullet1">
<listitem><para>Efect&uacute;e una doble pulsaci&oacute;n sobre un icono de
carpeta.</para>
</listitem>
<listitem><para>Seleccione un icono de carpeta; en el men&uacute; Seleccionado
elija Abrir en ventana actual, para abrir la carpeta en la ventana actual,
o Abrir en ventana nueva, para abrir la carpeta en una nueva ventana.</para>
</listitem>
<listitem><para>Seleccione el mandato Abrir en ventana actual o Abrir en ventana
nueva en el men&uacute; emergente de la carpeta (que se muestra pulsando Desplazamiento+F10
o el bot&oacute;n derecho del rat&oacute;n).</para>
</listitem>
<listitem><para>Efect&uacute;e una doble pulsaci&oacute;n sobre una carpeta
de la ruta con iconos para cambiar la vista a esa carpeta.</para>
</listitem>
<listitem><para>Seleccione (pulse con el rat&oacute;n) la l&iacute;nea de
la carpeta actual para convertirla en un campo de texto. Escriba el nombre
de la ruta que desea y luego pulse Intro.</para>
</listitem>
<listitem><para>En la l&iacute;nea de la carpeta actual, efect&uacute;e una
doble pulsaci&oacute;n sobre un segmento de la ruta actual. Por ejemplo, si
la carpeta actual es <filename>/usuarios/tom/.dt/tipos</filename>, puede cambiar
a la carpeta <filename>/usuarios/tom</filename> efectuando una doble pulsaci&oacute;n
sobre la palabra <filename>tom</filename>.</para>
</listitem>
</itemizedlist>
</sect2>
<sect2 id="UG.FMgr.div.48" role="Procedure">
<title>Para ir a la carpeta de inicio del usuario</title>
<itemizedlist>
<listitem><para>Seleccione Ir a Inicio en el men&uacute; Archivo.<indexterm>
<primary>desplazamiento</primary><secondary>hacia carpeta de inicio [navigating</secondary><tertiary>ho]</tertiary></indexterm><indexterm><primary>carpeta
de inicio, desplazamiento hacia</primary></indexterm></para>
</listitem>
</itemizedlist>
</sect2>
<sect2 id="UG.FMgr.div.49" role="Procedure">
<title>Para cambiar a la carpeta padre</title>
<itemizedlist remap="Bullet1">
<listitem><para>Seleccione Ir Arriba en el men&uacute; Archivo.</para>
</listitem>
<listitem><para><emphasis>Tambi&eacute;n</emphasis> puede efectuar una doble
pulsaci&oacute;n sobre el icono .. (ir arriba).<indexterm><primary>carpeta
padre, desplazamiento hacia</primary></indexterm></para>
</listitem>
</itemizedlist>
</sect2>
<sect2 id="UG.FMgr.div.50" role="Procedure">
<title>Para abrir una ventana de terminal en la carpeta actual<indexterm>
<primary>abrir</primary><secondary>ventana de terminal en directorio actual</secondary></indexterm><indexterm><primary>ventana de terminal</primary>
<secondary>abrir en directorio actual desde Gestor de archivos</secondary>
</indexterm></title>
<para>Este procedimiento abre una ventana de emulador de terminal con la
misma carpeta actual que la ventana del Gestor de archivos. Esta es una forma
r&aacute;pida de escribir un mandato para el contenido de la carpeta que se
est&aacute; viendo actualmente.</para>
<itemizedlist>
<listitem><para>Seleccione Abrir Terminal en el men&uacute; Archivo.</para>
</listitem>
</itemizedlist>
<note>
<para>Debe tener permiso de ejecuci&oacute;n sobre una carpeta para poder
abrir una ventana de terminal desde ella.</para>
</note>
<para>Para saber c&oacute;mo utilizar emuladores de terminal, vea el <!--Original
XRef content: 'Cap&iacute;tulo&numsp;12, &ldquo;Uso  de Terminal'--><xref
role="ChapNumAndTitle" linkend="UG.UTrmE.mkr.1">.</para>
</sect2>
</sect1>
<sect1 id="UG.FMgr.div.51">
<title>Ejecuci&oacute;n de una acci&oacute;n para un archivo o carpeta<indexterm>
<primary>objetos</primary><secondary>ejecutar acci&oacute;n de</secondary>
</indexterm><indexterm><primary>acciones</primary><secondary>ejecutar</secondary>
</indexterm><indexterm><primary>ejecutar acciones</primary></indexterm></title>
<para>Las acciones act&uacute;an sobre objetos, y son una parte b&aacute;sica
del trabajo con ellos. Por ejemplo, la impresi&oacute;n del contenido de un
objeto utiliza la acci&oacute;n Imprimir. El inicio de una aplicaci&oacute;n
para un objeto de archivo de datos utiliza una acci&oacute;n Abrir o alguna
otra acci&oacute;n de aplicaci&oacute;n.</para>
<para>El men&uacute; Seleccionado contiene una lista de mandatos seguida de
una lista de acciones que puede utilizar con el icono seleccionado. El contenido
de la parte de acciones del men&uacute; Seleccionado cambia dependiendo del
tipo de icono que est&eacute; seleccionado actualmente.</para>
<graphic id="UG.FMgr.igrph.3" entityref="UG.FMgr.fig.5"></graphic>
<para>La acci&oacute;n listada al principio de la parte de acciones del men&uacute;
(la acci&oacute;n predeterminada) es la acci&oacute;n que se emprender&aacute;
cuando efect&uacute;e una doble pulsaci&oacute;n sobre un archivo o carpeta.
En el men&uacute; mostrado en la figura, la acci&oacute;n predeterminada es
Abrir en Ventana Actual.</para>
<sect2 id="UG.FMgr.div.52" role="Procedure">
<title>Para ejecutar la acci&oacute;n predeterminada</title>
<para>La acci&oacute;n predeterminada es la primera acci&oacute;n listada
en la parte de acciones del men&uacute; Seleccionado.</para>
<itemizedlist>
<listitem><para>Efect&uacute;e una doble pulsaci&oacute;n sobre el icono del
objeto.<indexterm><primary>acciones</primary><secondary>ejecutar acci&oacute;n
predeterminada</secondary></indexterm><indexterm><primary>acciones predeterminadas</primary></indexterm></para>
</listitem>
</itemizedlist>
</sect2>
<sect2 id="UG.FMgr.div.53" role="Procedure">
<title>Para ejecutar otras acciones</title>
<orderedlist>
<listitem><para>Seleccione el icono del objeto.</para>
</listitem>
<listitem><para>Elija la acci&oacute;n que desea ejecutar en el men&uacute;
Seleccionado o en el men&uacute; emergente del objeto.</para>
</listitem>
</orderedlist>
</sect2>
</sect1>
<sect1 id="UG.FMgr.div.54">
<title id="UG.FMgr.mkr.16">Supresi&oacute;n de objetos con la Papelera<indexterm>
<primary>Papelera</primary><secondary>uso</secondary></indexterm></title>
<para>La Papelera recoge los archivos y carpetas que el usuario suprime. No
se eliminan realmente del sistema de archivos hasta que se &ldquo;vac&iacute;a&rdquo;
el contenido de la Papelera. S&oacute;lo podr&aacute; cambiar su decisi&oacute;n
y <emphasis>restaurar</emphasis> un archivo puesto en la Papelera si &eacute;sta
no se ha vaciado.</para>
<sect2 id="UG.FMgr.div.55" role="Procedure">
<title>Para abrir la ventana Papelera<indexterm><primary>Papelera</primary>
<secondary>abrir</secondary></indexterm><indexterm><primary>Papelera</primary>
<secondary>abrir</secondary></indexterm></title>
<itemizedlist>
<listitem><para>Pulse el control Papelera del Panel frontal.</para>
</listitem>
</itemizedlist>
<graphic id="UG.FMgr.igrph.4" entityref="UG.FMgr.fig.6"></graphic>
</sect2>
<sect2 id="UG.FMgr.div.56" role="Procedure">
<title id="UG.FMgr.mkr.17">Para poner un objeto en la Papelera</title>
<itemizedlist remap="Bullet1">
<listitem><para>Seleccione Echar en la Papelera en el men&uacute; emergente
del objeto (que se muestra pulsando Desplazamiento+F10 o el bot&oacute;n derecho
del rat&oacute;n).</para>
</listitem>
<listitem><para><emphasis>O,</emphasis> seleccione el icono del objeto, luego
elija Echar en la Papelera en el men&uacute; Seleccionado.</para>
</listitem>
<listitem><para><emphasis>O</emphasis>, arrastre y suelte el icono del objeto
en el control Papelera del Panel frontal.</para>
</listitem>
<listitem><para><emphasis>O</emphasis>, arrastre un icono del objeto a la
ventana Papelera abierta.</para>
</listitem>
</itemizedlist>
</sect2>
<sect2 id="UG.FMgr.div.57" role="Procedure">
<title>Para recuperar un archivo o carpeta de la Papelera<indexterm><primary>Papelera</primary><secondary>recuperaci&oacute;n de objetos de</secondary>
</indexterm><indexterm><primary>objetos</primary><secondary>recuperaci&oacute;n
de la Papelera</secondary></indexterm><indexterm><primary>restaurar</primary>
<secondary>elementos de la Papelera</secondary></indexterm><indexterm><primary>objetos</primary><secondary>recuperar de la Papelera</secondary></indexterm><indexterm>
<primary>archivos</primary><secondary>recuperar de la Papelera</secondary>
</indexterm><indexterm><primary>carpetas</primary><secondary>recuperar de
la Papelera</secondary></indexterm></title>
<itemizedlist remap="Bullet1">
<listitem><para>Arrastre el objeto desde la ventana Papelera hasta el Gestor
de archivos.</para>
</listitem>
<listitem><para><emphasis>O</emphasis>, en la ventana Papelera, seleccione
el objeto que desea restaurar y elija Reponer en el men&uacute; Archivo.
</para>
</listitem>
<listitem><para><emphasis>O</emphasis>, elija Reponer en el men&uacute; emergente
del objeto (que se muestra pulsando Desplazamiento+F10 o el bot&oacute;n derecho
del rat&oacute;n).</para>
</listitem>
</itemizedlist>
</sect2>
<sect2 id="UG.FMgr.div.58" role="Procedure">
<title>Para suprimir un archivo o carpeta de forma definitiva<indexterm>
<primary>Papelera</primary><secondary>vaciar</secondary></indexterm><indexterm>
<primary>suprimir</primary><secondary>archivos</secondary></indexterm><indexterm>
<primary>Papelera</primary><secondary>vaciar</secondary></indexterm></title>
<para>Cuando suprime un archivo de forma definitiva, no se puede recuperar
(a menos que tenga un mecanismo de copia de seguridad.)</para>
<orderedlist>
<listitem><para>Abra la Papelera.<indexterm><primary>carpetas</primary><secondary>suprimir</secondary></indexterm><indexterm><primary>suprimir</primary><secondary>carpetas</secondary></indexterm></para>
</listitem>
<listitem><para>Seleccione los objetos que desea vaciar de la Papelera.</para>
<para>Seleccione objetos individuales, o elija Seleccionar Todo en el men&uacute;
Archivo.</para>
</listitem>
<listitem><para>Elija Eliminar Definitivamente en el men&uacute; Archivo o
en el men&uacute; emergente del objeto (que se muestra pulsando Desplazamiento+F10
o el bot&oacute;n derecho del rat&oacute;n).</para>
</listitem>
<listitem><para>Pulse OK en el cuadro de di&aacute;logo de confirmaci&oacute;n.
</para>
</listitem>
</orderedlist>
<note>
<para>La Papelera se vaciar&aacute; autom&aacute;ticamente cuando finalice
la sesi&oacute;n.</para>
</note>
</sect2>
</sect1>
<sect1 id="UG.FMgr.div.59">
<title>Posesi&oacute;n y seguridad de archivos</title>
<para>Existen tres grupos de usuarios que pueden acceder a archivos: <emphasis>propietario</emphasis>, <emphasis>grupo</emphasis>, y <emphasis>otros</emphasis>.
El acceso a archivos est&aacute; dividido en tres tipos de permisos: <emphasis>lectura</emphasis>, <emphasis>escritura</emphasis>, y <emphasis>ejecuci&oacute;n</emphasis>.</para>
<sect2 id="UG.FMgr.div.60">
<title>&iquest;Qui&eacute;n tiene acceso?</title>
<para>Las tres clases b&aacute;sicas de usuarios son:</para>
<itemizedlist remap="Bullet1">
<listitem><para><emphasis>Propietario</emphasis> &ndash; Generalmente es la
persona que cre&oacute; el objeto.</para>
</listitem>
<listitem><para><emphasis>Grupo</emphasis> &ndash; Usuarios que el administrador
del sistema ha agrupado juntos. Por ejemplo, los miembros de un departamento
podr&iacute;an pertenecer al mismo <emphasis>grupo</emphasis>.</para>
</listitem>
<listitem><para><emphasis>Otros</emphasis> &ndash; Todos los dem&aacute;s
usuarios del sistema.</para>
</listitem>
</itemizedlist>
</sect2>
<sect2 id="UG.FMgr.div.61">
<title>Tipos de permisos de acceso</title>
<para>Los permisos de acceso para un archivo especifican c&oacute;mo pueden
acceder al archivo el propietario, los miembros del grupo y otros usuarios.
</para>
<itemizedlist remap="Bullet1">
<listitem><para><emphasis>Permiso de lectura</emphasis> &ndash; Permite el
acceso para copiar o ver el contenido del objeto.</para>
</listitem>
<listitem><para><emphasis>Permiso de escritura</emphasis> &ndash; Permite
el acceso para cambiar el contenido del objeto o eliminar el objeto.</para>
</listitem>
<listitem><para><emphasis>Permiso de ejecuci&oacute;n</emphasis> &ndash; Para
un archivo, permite el acceso para <emphasis>ejecutar</emphasis> el archivo
(para archivos ejecutables, scripts y acciones). Para una carpeta, permite
el acceso para ejecutar mandatos, scripts y acciones dentro de esa carpeta.
</para>
</listitem>
</itemizedlist>
<para>Si el usuario no tiene permiso para escribir dentro de una carpeta,
&eacute;sta tendr&aacute; este aspecto:</para>
<graphic id="UG.FMgr.igrph.5" entityref="UG.FMgr.fig.7"></graphic>
<para>Si el usuario no tiene permiso de lectura o de ejecuci&oacute;n para
una carpeta, &eacute;sta tendr&aacute; este aspecto:</para>
<graphic id="UG.FMgr.igrph.6" entityref="UG.FMgr.fig.8"></graphic>
<sect3 id="UG.FMgr.div.62">
<title>Ejemplos</title>
<para>Para hacer que una carpeta sea privada:</para>
<itemizedlist remap="Bullet1">
<listitem><para>Cambie las propiedades de la carpeta, otorg&aacute;ndose a
s&iacute; mismo (el propietario) permiso de lectura, de escritura y de ejecuci&oacute;n,
pero sin dar permisos para grupo ni otros. Esto significa que s&oacute;lo
usted y el usuario root pueden ver el contenido de la carpeta.</para>
</listitem>
</itemizedlist>
<para>Para hacer que un objeto que ha usted ha creado est&eacute; disponible
para su uso por cualquier usuario, pero protegerlo contra la sobreescritura
accidental:</para>
<itemizedlist remap="Bullet1">
<listitem><para>Cambie las propiedades del archivo, otorgando permiso de lectura
y de ejecuci&oacute;n al propietario, al grupo y a otros. No otorgue permiso
de escritura a nadie.</para>
</listitem>
</itemizedlist>
</sect3>
</sect2>
<sect2 id="UG.FMgr.div.63">
<title>Permisos predeterminados</title>
<para>Los permisos predeterminados que se utilizaron cuando cre&oacute; un
nuevo archivo o carpeta pueden ser modificados por el administrador del sistema.
Para determinar cu&aacute;les son sus permisos predeterminados actuales,
cree un nuevo archivo o carpeta, luego abra el cuadro de di&aacute;logo Permisos
para ese archivo o carpeta.</para>
<para>Consulte al administrador del sistema respecto a c&oacute;mo cambiar
sus permisos predeterminados.</para>
</sect2>
<sect2 id="UG.FMgr.div.64" role="Procedure">
<title>Para cambiar el propietario de un archivo o carpeta<indexterm><primary>objetos</primary><secondary>modificar propiedad de</secondary></indexterm><indexterm>
<primary>propiedad, modificar en Gestor de archivos</primary></indexterm><indexterm>
<primary>cambiar</primary><secondary>propiedades de archivo</secondary></indexterm><indexterm>
<primary>cambiar</primary><secondary>propiedades de carpeta</secondary></indexterm><indexterm>
<primary>objetos</primary><secondary>cambiar propiedades de</secondary></indexterm><indexterm>
<primary>archivos</primary><secondary>cambiar propiedades de</secondary></indexterm><indexterm>
<primary>carpetas</primary><secondary>cambiar propiedades de</secondary></indexterm><indexterm>
<primary>propiedades de objeto</primary><secondary>cambiar</secondary></indexterm><indexterm>
<primary>propiedades de archivo</primary><secondary>cambiar</secondary></indexterm><indexterm>
<primary>propiedades de carpeta</primary><secondary>cambiar</secondary></indexterm></title>
<para>Para cambiar la propiedad de un archivo o carpeta debe ser el propietario
o el administrador del sistema (usuario root).</para>
<orderedlist>
<listitem><para>Seleccione el icono del objeto.</para>
</listitem>
<listitem><para>Elija Cambiar Permisos en el men&uacute; Seleccionado o en
el men&uacute; emergente del objeto (que se muestra pulsando Desplazamiento+F10
o el bot&oacute;n derecho del rat&oacute;n).</para>
</listitem>
<listitem><para>Escriba el nombre del nuevo propietario en el campo de texto
Nombre del Propietario.</para>
</listitem>
<listitem><para>Pulse OK o pulse Intro.</para>
</listitem>
</orderedlist>
<note>
<para>Si otorga la propiedad del archivo a otro usuario, no podr&aacute; volver
a cambiar los permisos a menos que ese usuario le devuelva la propiedad.
</para>
</note>
<para>Si no tiene permiso para cambiar las propiedades, algunos controles
del cuadro de di&aacute;logo Permisos no estar&aacute;n disponibles.</para>
</sect2>
<sect2 id="UG.FMgr.div.65" role="Procedure">
<title id="UG.FMgr.mkr.18">Para cambiar los permisos para un archivo o carpeta<indexterm><primary>objetos</primary><secondary>cambiar permisos de</secondary>
</indexterm><indexterm><primary>permisos</primary><secondary>cambiar</secondary>
</indexterm><indexterm><primary>permiso de escritura, cambiar</primary></indexterm><indexterm>
<primary>permiso de lectura, cambiar</primary></indexterm><indexterm><primary>permiso de ejecuci&oacute;n, cambiar</primary></indexterm><indexterm><primary>cambiar</primary><secondary>propiedades de archivo</secondary></indexterm><indexterm>
<primary>cambiar</primary><secondary>propiedades de carpeta</secondary></indexterm><indexterm>
<primary>objetos</primary><secondary>cambiar propiedades de</secondary></indexterm><indexterm>
<primary>archivos</primary><secondary>cambiar propiedades de</secondary></indexterm><indexterm>
<primary>carpetas</primary><secondary>cambiar propiedades de</secondary></indexterm><indexterm>
<primary>propiedades de objeto</primary><secondary>cambiar</secondary></indexterm><indexterm>
<primary>propiedades de archivo</primary><secondary>cambiar</secondary></indexterm><indexterm>
<primary>propiedades de carpeta</primary><secondary>cambiar</secondary></indexterm></title>
<para>Para cambiar los permisos de un archivo o carpeta debe ser el propietario
o el administrador del sistema (usuario root).</para>
<orderedlist>
<listitem><para>Seleccione el icono del archivo o carpeta.</para>
</listitem>
<listitem><para>Elija Cambiar Permisos en el men&uacute; Seleccionado o en
el men&uacute; emergente del icono (que se muestra pulsando Desplazamiento+F10
o el bot&oacute;n derecho del rat&oacute;n).</para>
</listitem>
<listitem><para>Seleccione los permisos para el archivo o carpeta.</para>
<para>Los permisos seleccionados en la fila de Grupo indican los privilegios
de acceso de cualquier usuario perteneciente al grupo nombrado. Los permisos
seleccionados en la fila de Otros se aplican a todos los dem&aacute;s usuarios.
</para>
<informaltable>
<tgroup cols="2" colsep="0" rowsep="0">
<colspec colwidth="228*">
<colspec colwidth="228*">
<tbody>
<row>
<entry align="left" valign="top"><para>Lectura</para></entry>
<entry align="left" valign="top"><para>El archivo se puede leer</para></entry>
</row>
<row>
<entry align="left" valign="top"><para>Escritura</para></entry>
<entry align="left" valign="top"><para>El archivo se puede modificar</para></entry>
</row>
<row>
<entry align="left" valign="top"><para>El archivo se puede ejecutar</para></entry>
<entry align="left" valign="top"><para>Ejecuci&oacute;n</para></entry></row>
</tbody></tgroup></informaltable>
<para>Si otorga la propiedad del archivo a otro usuario, no podr&aacute; volver
a cambiar los permisos a menos que ese usuario le devuelva la propiedad.
Si no tiene permiso para cambiar las propiedades, algunos controles del cuadro
de di&aacute;logo Permisos no est&aacute;n disponibles.</para>
</listitem>
<listitem><para>Pulse OK o Intro.</para>
</listitem>
</orderedlist>
<note>
<para>La fila de permisos de Grupo muestra los permisos de usuarios pertenecientes
al grupo listado en el campo de texto Nombre del Grupo. Puede especificar
un grupo diferente escribiendo un nuevo nombre en este campo.</para>
</note>
</sect2>
</sect1>
<sect1 id="UG.FMgr.div.66">
<title id="UG.FMgr.mkr.19">Uso de objetos del Gestor de Archivos en el escritorio</title>
<para>El escritorio le permite poner cualquier icono de archivo o de carpeta
directamente sobre el fondo del espacio de trabajo actual para lograr un
acceso r&aacute;pido. Cualquier icono que suelte en el escritorio permanece
donde lo coloque.</para>
<para>El Gestor de archivos proporciona una forma de ver todos los objetos
del sistema de archivos. Sin embargo, el objeto s&oacute;lo es visible cuando
est&aacute; viendo la carpeta en la que est&aacute; contenido.</para>
<para>Para hacer que un objeto sea m&aacute;s accesible, puede colocarlo directamente
en el fondo del espacio de trabajo. El escritorio es el &aacute;rea o superficie
sobre la que se disponen las ventanas. Cuando un objeto est&aacute; situado
all&iacute;, se denomina <emphasis>objeto del espacio de trabajo</emphasis>.
Existe un escritorio separado para cada espacio de trabajo.</para>
<para>La colocaci&oacute;n de un objeto en el espacio de trabajo no altera
el archivo o carpeta original. De hecho, el icono que aparece en el espacio
de trabajo es en realidad s&oacute;lo una forma r&aacute;pida de acceder al
archivo o carpeta real. Cualquier operaci&oacute;n que realice en el objeto
del espacio de trabajo se efect&uacute;a realmente sobre el archivo o carpeta
al que representa.</para>
<sect2 id="UG.FMgr.div.67">
<title>Espacios de trabajo del escritorio</title>
<para>Puede tener varios espacios de trabajo en el escritorio, de modo que
puede definir su entorno de trabajo colocando los archivos y carpetas en los
espacios de trabajo donde los utilice con m&aacute;s frecuencia, o en m&aacute;s
de un espacio de trabajo, si es necesario.</para>
<sect3 id="UG.FMgr.div.68">
<title>Men&uacute;s emergentes<indexterm><primary>men&uacute;s emergentes</primary><secondary>para objetos</secondary></indexterm></title>
<para>Cada espacio de trabajo tiene su propio men&uacute; emergente, que se
abre mediante el bot&oacute;n derecho del rat&oacute;n o pulsando Desplazamiento+F10
cuando el icono est&aacute; seleccionado. Este men&uacute; contiene mandatos
para manejar el objeto, incluyendo todas las acciones que aparecen en el men&uacute;
Seleccionado del Gestor de archivos cuando el objeto est&aacute; seleccionado.
El men&uacute; emergente del Espacio de trabajo es similar al men&uacute;
emergente disponible en las ventanas del Gestor de archivos, pero contiene
unos cuantos mandatos diferentes.</para>
</sect3>
</sect2>
<sect2 id="UG.FMgr.div.69" role="Procedure">
<title>Para colocar un archivo o carpeta en el fondo del espacio de trabajo<indexterm>
<primary>objetos</primary><secondary>colocar en el fondo del espacio de trabajo</secondary></indexterm><indexterm><primary>archivos</primary><secondary>colocar en el fondo del espacio de trabajo</secondary></indexterm><indexterm>
<primary>carpetas</primary><secondary>colocar en el fondo del espacio de trabajo</secondary></indexterm><indexterm><primary>fondo del espacio de trabajo</primary><secondary>colocar un archivo o carpeta en el</secondary></indexterm></title>
<para>Este procedimiento crea una copia del icono en el fondo del espacio
de trabajo. Los cambios que haga en la copia del fondo del espacio de trabajo
tambi&eacute;n se aplicar&aacute;n al objeto original que est&aacute; todav&iacute;a
en el Gestor de archivos.</para>
<orderedlist>
<listitem><para>Conmute al espacio de trabajo donde desea que aparezca el
objeto.</para>
</listitem>
<listitem><para>Luego:</para>
<itemizedlist remap="Bullet2">
<listitem><para>Arrastre y suelte el icono del objeto en el espacio de trabajo.
</para>
</listitem>
<listitem><para><emphasis>O bien,</emphasis> seleccione el icono, luego elija
el mandato Poner en el Espacio de Trabajo, en el men&uacute; Seleccionado
o en el men&uacute; emergente del icono (que se muestra pulsando Desplazamiento+F10
o el bot&oacute;n derecho del rat&oacute;n).</para>
</listitem>
</itemizedlist>
</listitem>
</orderedlist>
<para>Puede repetir estos pasos para colocar un icono del escritorio en tantos
espacios de trabajo como desee.</para>
</sect2>
<sect2 id="UG.FMgr.div.70" role="Procedure">
<title>Para mostrar el men&uacute; emergente de un objeto del espacio de
trabajo<indexterm><primary>objetos</primary><secondary>men&uacute; emergente
de</secondary></indexterm><indexterm><primary>men&uacute;s emergentes</primary>
<secondary>de objetos</secondary></indexterm></title>
<sect3 id="UG.FMgr.div.71">
<title>Rat&oacute;n</title>
<orderedlist>
<listitem><para>Se&ntilde;ale al icono del objeto.</para>
</listitem>
<listitem><para>Pulse el bot&oacute;n derecho del rat&oacute;n.</para>
</listitem>
<listitem><para>Elija un mandato del men&uacute; arrastrando hasta el mandato
y luego libere el bot&oacute;n del rat&oacute;n.</para>
</listitem>
</orderedlist>
<sect4 id="UG.FMgr.div.72">
<title>Teclado</title>
<orderedlist>
<listitem><para>Coloque el resaltado en el icono del objeto pulsando Alt+Tabulador.
</para>
</listitem>
<listitem><para>Pulse Desplazamiento+F10.</para>
</listitem>
<listitem><para>Elija un mandato del men&uacute; utilizando las teclas de
direcci&oacute;n para resaltar el mandato, luego pulse Intro.</para>
</listitem>
</orderedlist>
<para>Para cancelar el men&uacute; sin seleccionar un mandato, pulse Esc.
</para>
</sect4>
</sect3>
</sect2>
<sect2 id="UG.FMgr.div.73" role="Procedure">
<title>Para eliminar un objeto del espacio de trabajo<indexterm><primary>espacios de trabajo</primary><secondary>eliminar objetos de</secondary></indexterm><indexterm>
<primary>objetos</primary><secondary>eliminar del espacio de trabajo</secondary>
</indexterm><indexterm><primary>eliminar</primary><secondary>archivos o carpetas
del espacio de trabajo</secondary></indexterm><indexterm><primary>objetos</primary><secondary>eliminar del espacio de trabajo</secondary></indexterm><indexterm>
<primary>archivos</primary><secondary>eliminar del espacio de trabajo</secondary>
</indexterm><indexterm><primary>carpetas</primary><secondary>eliminar del
espacio de trabajo</secondary></indexterm><indexterm><primary>espacios de
trabajo</primary><secondary>eliminar objetos del</secondary></indexterm><indexterm>
<primary>espacios de trabajo</primary><secondary>eliminar archivos o carpetas
del</secondary></indexterm></title>
<orderedlist>
<listitem><para>Conmute al espacio de trabajo donde reside el objeto.</para>
</listitem>
<listitem><para>Localice el icono del objeto en el escritorio</para>
</listitem>
<listitem><para>Elija Eliminar del Espacio de trabajo, en el men&uacute; emergente
del objeto.</para>
</listitem>
</orderedlist>
<para>La eliminaci&oacute;n de un objeto del espacio de trabajo no altera
el objeto original. Es decir, el objeto sigue existiendo en el Gestor de archivos.
</para>
</sect2>
</sect1>
<sect1 id="UG.FMgr.div.74">
<title id="UG.FMgr.mkr.20">Localizaci&oacute;n de archivos<indexterm><primary>archivos</primary><secondary>localizar</secondary></indexterm><indexterm>
<primary>buscar</primary><secondary>objetos</secondary></indexterm><indexterm>
<primary>buscar</primary><secondary>archivos</secondary></indexterm></title>
<para>Llevar un control de muchos archivos puede convertirse r&aacute;pidamente
en algo dif&iacute;cil. El Gestor de archivos ayuda al proporcionar la capacidad
para buscar un archivo o carpeta por su nombre. Puede tambi&eacute;n buscar
archivos bas&aacute;ndose en el contenido del archivo.</para>
<sect2 id="UG.FMgr.div.75" role="Procedure">
<title id="UG.FMgr.mkr.21">Para buscar un objeto por nombre<indexterm><primary>objetos</primary><secondary>buscar por nombre</secondary></indexterm><indexterm>
<primary>archivos</primary><secondary>buscar por nombre</secondary></indexterm><indexterm>
<primary>nombre, buscar archivo por</primary></indexterm></title>
<orderedlist>
<listitem><para>Elija Buscar en el men&uacute; Archivo.</para>
<graphic id="ug.fmgr.igrph.7" entityref="UG.FMgr.fig.9"></graphic>
</listitem>
<listitem><para>Escriba el nombre del archivo o carpeta que desea buscar en
el campo Nombre de archivo o Nombre de carpeta.</para>
<para>Cuando especifica un nombre de archivo o de carpeta puede incluir caracteres
comodines, tales como el asterisco (<filename>*</filename>) y el signo de
interrogaci&oacute;n (<filename>?</filename>). El <filename>*</filename>
coincide con cualquier cadena de caracteres (incluyendo su ausencia), y el <filename>?</filename> coincide con cualquier car&aacute;cter individual.<indexterm>
<primary>comodines</primary><secondary>para buscar archivos</secondary></indexterm><indexterm>
<primary>buscar</primary><secondary>objetos usando comodines</secondary></indexterm> Por
ejemplo:</para>
<informaltable>
<tgroup cols="2" colsep="0" rowsep="0">
<colspec colwidth="77*">
<colspec colwidth="451*">
<tbody>
<row>
<entry align="left" valign="top"><para><filename>ba*</filename></para></entry>
<entry align="left" valign="top"><para>Coincide con todos los nombres que
comiencen con la cadena <filename moreinfo="refentry">ba</filename></para></entry>
</row>
<row>
<entry align="left" valign="top"><para><filename>ba?</filename></para></entry>
<entry align="left" valign="top"><para>Coincide con todos los nombres de tres
caracteres que comiencen con la cadena <filename moreinfo="refentry">ba</filename></para></entry>
</row>
<row>
<entry align="left" valign="top"><para><filename>*.dt</filename></para></entry>
<entry align="left" valign="top"><para>Coincide con todos los nombres que
finalicen con el sufijo <filename>.dt</filename></para></entry></row>
<row>
<entry align="left" valign="top"><para><filename>*.???</filename></para></entry>
<entry align="left" valign="top"><para>Coincide con todos los nombres que
tengan un sufijo de tres caracteres</para></entry></row></tbody></tgroup>
</informaltable>
<para>El nombre de archivo y el contenido se pueden especificar utilizando
la misma sintaxis de <emphasis>expresi&oacute;n regular</emphasis> permitida
por el mandato <command>find</command>. (Consulte la p&aacute;gina del manual
de <command>find</command> y la p&aacute;gina del manual de <command>grep</command> para obtener m&aacute;s informaci&oacute;n.)</para>
</listitem>
<listitem><para>Escriba en el campo Buscar Carpeta la carpeta donde desea
que comience la b&uacute;squeda. (Por omisi&oacute;n, este campo contiene
el nombre de la carpeta actual.)</para>
<para>El mandato Buscar buscar&aacute; en esta carpeta y en todas sus subcarpetas.
</para>
</listitem>
<listitem><para>Pulse Iniciar o pulse Intro.</para>
<para>El Gestor de archivos comienza a buscar en la carpeta especificada en
Buscar Carpeta y en las carpetas que contiene los archivos que coincidan
con el nombre proporcionado. Las coincidencias encontradas se listan en la
lista Archivos encontrados. Una vez encontrado un objeto, puede seleccionarlo
y pulsar Abrir Carpeta para abrir la carpeta donde reside el objeto o pulsar
Poner en el Espacio de trabajo para colocar su icono en el fondo actual.
</para>
<para>Para detener la b&uacute;squeda, pulse el bot&oacute;n Detener o pulse
Intro.</para>
</listitem>
</orderedlist>
</sect2>
<sect2 id="UG.FMgr.div.76" role="Procedure">
<title id="UG.FMgr.mkr.22">Para buscar un archivo por contenido<indexterm>
<primary>contenido, buscar archivo por</primary></indexterm><indexterm><primary>archivos</primary><secondary>buscar por contenido</secondary></indexterm></title>
<orderedlist>
<listitem><para>Elija Buscar en el men&uacute; Archivo.</para>
</listitem>
<listitem><para><emphasis>Opcional</emphasis>. Puede utilizar el campo de
texto Nombre de Archivo o Carpeta para delimitar, y por tanto acelerar, la
b&uacute;squeda.</para>
<para>Si entra un nombre parcial (utilizando comodines), el Gestor de archivos
examina s&oacute;lo los archivos que coinciden con el campo Nombre de archivo
o carpeta. Si deja en blanco el campo Nombre de Archivo o Carpeta, el Gestor
de archivos busca cada archivo en la carpeta de b&uacute;squeda. Los nombres
se pueden especificar utilizando la misma sintaxis de <emphasis>expresi&oacute;n
regular</emphasis> permitida por el mandato grep. (Consulte la p&aacute;gina
de manual de <command>grep</command> para obtener m&aacute;s informaci&oacute;n.)
</para>
</listitem>
<listitem><para>Escriba en el campo Contenido del Archivo la cadena de texto
que desea buscar.</para>
<para>No se hace distinci&oacute;n entre may&uacute;sculas y min&uacute;sculas
para la cadena. No es necesario utilizar palabras completas. Por ejemplo,
si escribe <command>fi</command> se encontrar&aacute; tanto &ldquo;fiesta&rdquo;
como &ldquo;Final&rdquo;.</para>
<para>Se puede especificar el contenido utilizando la misma sintaxis de <emphasis>expresi&oacute;n regular</emphasis> permitida por el mandato <command>grep</command>. (Consulte la p&aacute;gina de manual de <command>grep</command>
para obtener m&aacute;s informaci&oacute;n.)</para>
</listitem>
<listitem><para>Escriba en el campo Buscar Carpeta el nombre de la carpeta
donde desea que comience la b&uacute;squeda. (Por omisi&oacute;n, este campo
contiene el nombre de la carpeta actual.)</para>
</listitem>
<listitem><para>Pulse Iniciar o pulse Intro.</para>
<para>El Gestor de archivos comienza a buscar en la carpeta especificada,
y en las carpetas de aqu&eacute;lla, archivos que contengan la cadena indicada
en Contenido del Archivo. Las coincidencias encontradas se listan en la lista
Archivos encontrados. Una vez encontrado un objeto, puede seleccionarlo en
la lista y luego pulsar Abrir Carpeta para abrir la carpeta donde reside el
objeto o pulsar Poner en el Espacio de trabajo para colocar su icono en el
fondo actual.</para>
<para>Para detener la b&uacute;squeda en cualquier momento, pulse el bot&oacute;n
Detener o pulse Intro.</para>
</listitem>
</orderedlist>
</sect2>
</sect1>
<sect1 id="UG.FMgr.div.77">
<title id="UG.FMgr.mkr.23">Personalizaci&oacute;n de vistas del Gestor de
archivos<indexterm><primary>vistas del Gestor de archivos</primary><secondary>cambiar</secondary></indexterm><indexterm><primary>vistas del Gestor de archivos</primary><secondary>personalizar &lt;$startrange></secondary></indexterm><indexterm>
<primary>personalizar</primary><secondary>vistas del Gestor de archivos&lt;$startrange></secondary></indexterm><indexterm><primary>vistas</primary><secondary>control
del Gestor de archivos</secondary></indexterm></title>
<para>El Gestor de archivos proporciona varias maneras de ver el contenido
de carpetas. El usuario puede:</para>
<itemizedlist remap="Bullet1">
<listitem><para>Cambiar la estructura b&aacute;sica de visualizaci&oacute;n
para pasar de ver una sola carpeta a ver una vista en &aacute;rbol. Vea <!--Original
XRef content: '&ldquo;Para mostrar la vista en &aacute;rbol&ldquo; en  la
p&aacute;gina&numsp;82'--><xref role="SecTitleAndPageNum" linkend="UG.FMgr.mkr.25">.
</para>
</listitem>
<listitem><para>Determinar el orden de clasificaci&oacute;n de objetos. Vea <!--Original
XRef content: '&ldquo;Para cambiar el  orden de clasificaci&oacute;n de los
iconos&ldquo; en la p&aacute;gina&numsp;84'--><xref role="SecTitleAndPageNum"
linkend="UG.FMgr.mkr.26">.</para>
</listitem>
<listitem><para>Ocultar (filtrar) determinados objetos. Vea <!--Original XRef
content: '&ldquo;Para mostrar u ocultar  archivos y carpetas&ldquo; en la
p&aacute;gina&numsp;85'--><xref role="SecTitleAndPageNum" linkend="UG.FMgr.mkr.28">.
</para>
</listitem>
<listitem><para>Cambiar el estilo utilizado para objetos (nombres e iconos
peque&ntilde;os o grandes, nombres solos, o una larga lista de nombres junto
con propiedades).</para>
</listitem>
</itemizedlist>
<sect2 id="UG.FMgr.div.78" role="Procedure">
<title id="UG.FMgr.mkr.24">Para configurar las cabeceras</title>
<orderedlist>
<listitem><para>Elija Establecer opciones de vista, en el men&uacute; Vista.
</para>
</listitem>
<listitem><para>Determine las cabeceras que se han de mostrar:</para>
<itemizedlist remap="Bullet2">
<listitem><para>Seleccione Mostrar Ruta con Iconos para mostrar la ruta de
la carpeta actual como una cadena de iconos de carpeta en la parte superior
de la ventana.</para>
</listitem>
<listitem><para>Seleccione Ruta de Texto para mostrar la ruta completa de
la carpeta actual en un campo de texto encima del panel de visualizaci&oacute;n.
</para>
</listitem>
<listitem><para>Seleccione L&iacute;nea de Mensajes para mostrar una cuenta
del n&uacute;mero de archivos de la carpeta. La l&iacute;nea aparecer&aacute;
en la parte inferior de la ventana.</para>
</listitem>
</itemizedlist>
</listitem>
<listitem><para>Para aplicar la opci&oacute;n elegida y cerrar el cuadro de
di&aacute;logo Establecer Opciones de Vista, pulse OK.</para>
<para>Para aplicar la opci&oacute;n elegida y dejar abierto el cuadro de di&aacute;logo
Establecer opciones de vista, pulse Aplicar.<indexterm><primary>Gestor de
archivos</primary><secondary>determinar cabeceras para</secondary></indexterm></para>
</listitem>
</orderedlist>
</sect2>
<sect2 id="UG.FMgr.div.79" role="Procedure">
<title>Para configurar c&oacute;mo se disponen los iconos</title>
<orderedlist>
<listitem><para>Elija Establecer opciones de vista, en el men&uacute; Vista.<indexterm>
<primary>iconos</primary><secondary>disposici&oacute;n en vista del Gestor
de archivos</secondary></indexterm><indexterm><primary>vistas del Gestor
de archivos</primary><secondary>disposici&oacute;n de iconos en</secondary>
</indexterm></para>
</listitem>
<listitem><para>Determine c&oacute;mo desea disponer los iconos:</para>
<itemizedlist remap="Bullet2">
<listitem><para>Seleccione En su Sitio para dejar los iconos donde se han
soltado.</para>
</listitem>
<listitem><para>Seleccione Filas y Columnas para alinear autom&aacute;ticamente
dentro de una cuadr&iacute;cula los iconos que suelte.</para>
</listitem>
</itemizedlist>
</listitem>
<listitem><para>Para aplicar la opci&oacute;n elegida y cerrar el cuadro de
di&aacute;logo Establecer Opciones de Vista, pulse OK.</para>
<para>Para aplicar la opci&oacute;n elegida y dejar abierto el cuadro de di&aacute;logo
Establecer opciones de vista, pulse Aplicar.<indexterm><primary>vistas del
Gestor de archivos</primary><secondary>personalizar &lt;$endrange></secondary>
</indexterm><indexterm><primary>personalizar</primary><secondary>vistas del
Gestor de archivos&lt;$endrange></secondary></indexterm></para>
</listitem>
</orderedlist>
</sect2>
<sect2 id="UG.FMgr.div.80">
<title>Uso de la vista en &aacute;rbol</title>
<para><indexterm><primary>vista en &aacute;rbol, en el Gestor de archivos&lt;$startrange></primary></indexterm><indexterm><primary>vistas del Gestor de archivos</primary>
<secondary>&aacute;rbol &lt;$startrange></secondary></indexterm>La vista en
&aacute;rbol se parece a un esquema. Los archivos y carpetas contenidos en
una carpeta est&aacute;n listados debajo de esa carpeta en forma de lista
sangrada</para>
<figure>
<title>Vista en &aacute;rbol del Ge stor de archivos</title>
<graphic id="UG.FMgr.grph.3" entityref="UG.FMgr.fig.10"></graphic>
</figure>
<para>En la vista en &aacute;rbol, una carpeta puede tener tres estados. Los
estados se muestran y cambian utilizando los botones de la izquierda de la
carpeta. Puede tambi&eacute;n abrir y cerrar las ramas del &aacute;rbol seleccionando
una carpeta y luego pulsando las teclas + y - del teclado (estas son las teclas
del centro, no las del teclado num&eacute;rico):</para>
<informaltable>
<tgroup cols="2" colsep="0" rowsep="0">
<colspec colwidth="64*">
<colspec colwidth="464*">
<tbody>
<row>
<entry align="left" valign="top"><para>+</para></entry>
<entry align="left" valign="top"><para>La carpeta est&aacute; en el estado
de cerrada. No se muestra su contenido. Cuando se pulsa el bot&oacute;n, la
carpeta se ampl&iacute;a parcial o totalmente, dependiendo de la opci&oacute;n
de la vista en &aacute;rbol que est&eacute; en vigor.</para></entry></row>
<row>
<entry align="left" valign="top"><para>-</para></entry>
<entry align="left" valign="top"><para>La carpeta est&aacute; en el estado
de totalmente ampliada. Se muestran todos los objetos de la carpeta. Cuando
se pulsa el bot&oacute;n, se cierra totalmente la carpeta.</para></entry>
</row>
<row>
<entry align="left" valign="top"><para>+/-</para></entry>
<entry align="left" valign="top"><para>La carpeta est&aacute; en el estado
de parcialmente ampliada. El &uacute;nico contenido que se muestra son las
carpetas que contiene. (Esta vista s&oacute;lo es posible si se utiliza la
opci&oacute;n Carpetas de la vista en &aacute;rbol y luego la opci&oacute;n
Archivos.) Cuando se pulsa el bot&oacute;n, la carpeta se ampl&iacute;a y
muestra los nombres de archivo.</para></entry></row></tbody></tgroup></informaltable>
</sect2>
<sect2 id="UG.FMgr.div.81" role="Procedure">
<title id="UG.FMgr.mkr.25">Para mostrar la vista en &aacute;rbol</title>
<para>La vista en &aacute;rbol muestra una carpeta y los archivos y carpetas
situados por debajo de aqu&eacute;lla.</para>
<orderedlist>
<listitem><para>Cambie a la carpeta donde desea que comience la vista en &aacute;rbol.
</para>
</listitem>
<listitem><para>Elija Establecer opciones de vista, en el men&uacute; Vista.
</para>
</listitem>
<listitem><para>Seleccione Por &aacute;rbol, en el cuadro Mostrar.</para>
</listitem>
<listitem><para>Seleccione una de las opciones de vista en &aacute;rbol:</para>
<informaltable>
<tgroup cols="2" colsep="0" rowsep="0">
<colspec colwidth="140*">
<colspec colwidth="388*">
<tbody>
<row>
<entry align="left" valign="top"><para>S&oacute;lo carpetas</para></entry>
<entry align="left" valign="top"><para>El &aacute;rbol muestra s&oacute;lo
carpetas. Para ver archivos, efect&uacute;e una doble pulsaci&oacute;n sobre
un nombre de carpeta. Esta es la vista predeterminada.</para></entry></row>
<row>
<entry align="left" valign="top"><para>Carpetas,</para><para>despu&eacute;s</para><para>archivos</para></entry>
<entry align="left" valign="top"><para>Primero s&oacute;lo se muestran carpetas.
Pulse el bot&oacute;n archivos [+] situado junto a cada carpeta para ver su
contenido. La primera pulsaci&oacute;n muestra las subcarpetas. La segunda
pulsaci&oacute;n muestra los archivos que hay dentro. Cuando pulsa el bot&oacute;n
por tercera vez, la carpeta se contrae de nuevo.</para></entry></row>
<row>
<entry align="left" valign="top"><para>Carpetas y archivos</para></entry>
<entry align="left" valign="top"><para>El &aacute;rbol muestra autom&aacute;ticamente
tanto carpetas como archivos.</para></entry></row></tbody></tgroup></informaltable>
</listitem>
<listitem><para>Para aplicar las opciones elegidas y cerrar el cuadro de di&aacute;logo
Establecer opciones de vista, pulse OK.</para>
<para>Para aplicar las opciones elegidas y dejar abierto el cuadro de di&aacute;logo
Establecer opciones de vista, pulse Aplicar.</para>
</listitem>
</orderedlist>
<para>Puede alterar el aspecto de los archivos y carpetas de la vista en &aacute;rbol
cambiando los valores del cuadro Mostrar, en el cuadro de di&aacute;logo
Establecer opciones de vista. Los cambios en las preferencias se aplican
s&oacute;lo a la sesi&oacute;n actual. Para hacer que sean permanentes, vea
<!--Original XRef content: '&ldquo;Para guardar las  preferencias actuales
como valores predeterminados&ldquo; en la p&aacute;gina&numsp;85'--><xref
role="SecTitleAndPageNum" linkend="UG.FMgr.mkr.27">.</para>
<para>Si efect&uacute;a una doble pulsaci&oacute;n en una carpeta de una vista
en &aacute;rbol, se abre una nueva vista de esa carpeta que no est&aacute;
en el modo de vista en &aacute;rbol.<indexterm><primary>vista en &aacute;rbol,
en el Gestor de archivos&lt;$endrange></primary></indexterm><indexterm><primary>vistas del Gestor de archivos</primary><secondary>&aacute;rbol&lt;$endrange></secondary></indexterm></para>
</sect2>
<sect2 id="UG.FMgr.div.82" role="Procedure">
<title>Para mostrar la vista de carpetas</title>
<para><indexterm><primary>vista de carpetas en el Gestor de archivos</primary>
</indexterm><indexterm><primary>vistas del Gestor de archivos</primary><secondary>carpeta</secondary></indexterm>La vista de carpetas muestra una carpeta y
todos los archivos y carpetas de esa carpeta.</para>
<orderedlist>
<listitem><para>Cambie a la carpeta que desea ver.</para>
</listitem>
<listitem><para>Elija Establecer opciones de vista, en el men&uacute; Vista.
</para>
</listitem>
<listitem><para>Seleccione Por carpeta individual, en el cuadro Mostrar.</para>
</listitem>
<listitem><para>Para aplicar las opciones elegidas y cerrar el cuadro de di&aacute;logo
Establecer opciones de vista, pulse OK.</para>
<para>Para aplicar las opciones elegidas y dejar abierto el cuadro de di&aacute;logo
Establecer opciones de vista, pulse Aplicar.</para>
</listitem>
</orderedlist>
<para>Puede alterar el aspecto de los archivos y carpetas de la vista de carpetas
cambiando los valores del cuadro Mostrar, en el cuadro de di&aacute;logo
Establecer opciones de vista. Los cambios en las preferencias se aplican
s&oacute;lo a la sesi&oacute;n actual. Para hacer que sean permanentes, vea
<!--Original XRef content: '&ldquo;Para guardar las  preferencias actuales
como valores predeterminados&ldquo; en la p&aacute;gina&numsp;85'--><xref
role="SecTitleAndPageNum" linkend="UG.FMgr.mkr.27">.</para>
</sect2>
<sect2 id="UG.FMgr.div.83" role="Procedure">
<title>Para cambiar la representaci&oacute;n de los objetos<indexterm><primary>objetos</primary><secondary>orden de clasificaci&oacute;n en el Gestor de
archivos</secondary></indexterm><indexterm><primary>orden de clasificaci&oacute;n</primary><secondary>de objetos</secondary></indexterm><indexterm><primary>orden de clasificaci&oacute;n</primary><secondary>cambiar en Gestor de archivos</secondary></indexterm><indexterm><primary>vistas del Gestor de archivos</primary><secondary>cambiar orden de clasificaci&oacute;n de</secondary>
</indexterm></title>
<orderedlist>
<listitem><para>Elija Establecer opciones de vista, en el men&uacute; Vista.
</para>
</listitem>
<listitem><para>Seleccione la representaci&oacute;n que prefiera en el cuadro
Representaci&oacute;n.</para>
<itemizedlist remap="Bullet2">
<listitem><para>Por nombre: No se mostrar&aacute;n iconos en el Gestor de
archivos. El Gestor de archivos indica los objetos que son carpetas a&ntilde;adiendo
una barra inclinada (/) a continuaci&oacute;n de sus nombres. Los programas
ejecutables tienen un asterisco (*) a continuaci&oacute;n de su nombre.</para>
</listitem>
<listitem><para>Por iconos grandes: Esta es la opci&oacute;n predeterminada.
El Gestor de archivos muestra los objetos con su nombre y un icono grande.
</para>
</listitem>
<listitem><para>Por iconos peque&ntilde;os: El Gestor de archivos muestra
los objetos con su nombre y un icono peque&ntilde;o.</para>
</listitem>
<listitem><para>Por nombre, fecha, tama&ntilde;o, ...: El Gestor de archivos
muestra los objetos con la fecha y el tama&ntilde;o de los archivos, adem&aacute;s
del nombre de archivo y el icono.</para>
</listitem>
</itemizedlist>
</listitem>
<listitem><para>Pulse OK o Aplicar.<indexterm><primary>Ordenar objetos (mandato
del men&uacute; Vista)</primary></indexterm></para>
</listitem>
</orderedlist>
</sect2>
<sect2 id="UG.FMgr.div.84" role="Procedure">
<title id="UG.FMgr.mkr.26">Para cambiar el orden de clasificaci&oacute;n de
los iconos<indexterm><primary>objetos</primary><secondary>orden de clasificaci&oacute;n
en el Gestor de archivos</secondary></indexterm><indexterm><primary>orden
de clasificaci&oacute;n</primary><secondary>de objetos</secondary></indexterm><indexterm>
<primary>orden de clasificaci&oacute;n</primary><secondary>cambiar en Gestor
de archivos</secondary></indexterm><indexterm><primary>vistas del Gestor
de archivos</primary><secondary>cambiar orden de clasificaci&oacute;n de</secondary>
</indexterm></title>
<orderedlist>
<listitem><para>Elija Establecer opciones de vista, en el men&uacute; Vista.
</para>
</listitem>
<listitem><para>Seleccione el orden de clasificaci&oacute;n que prefiera en
el cuadro Ordenar, y el sentido de clasificaci&oacute;n en el cuadro Direcci&oacute;n.
</para>
<itemizedlist remap="Bullet2">
<listitem><para>Alfab&eacute;ticamente: De la A a la Z (Ascendente) o de la
Z a la A (Descendente). Los iconos con nombres que comienzan con letras may&uacute;sculas
aparecen primero. Los iconos con nombres que comienzan con letras min&uacute;sculas
se disponen en la parte inferior.</para>
</listitem>
<listitem><para>Por tipo de archivo: Por tipo de objeto. Por ejemplo, los
archivos, las carpetas y las acciones son tipos diferentes de objetos. Dentro
de cada grupo del mismo tipo, los iconos se ordenan alfab&eacute;ticamente
(seg&uacute;n el orden en que los tipos de datos se insertan en la base de
datos).</para>
</listitem>
<listitem><para>Por fecha: Seg&uacute;n la fecha en que los archivos se modificaron
por &uacute;ltima vez: del m&aacute;s antiguo al m&aacute;s nuevo (Ascendente)
o del m&aacute;s nuevo al m&aacute;s antiguo (Descendente).</para>
</listitem>
<listitem><para>Por tama&ntilde;o: Seg&uacute;n el tama&ntilde;o del archivo:
del m&aacute;s peque&ntilde;o al m&aacute;s grande (Ascendente) o del m&aacute;s
grande al m&aacute;s peque&ntilde;o (Descendente).</para>
</listitem>
</itemizedlist>
</listitem>
<listitem><para>Pulse OK o Aplicar.<indexterm><primary>Ordenar objetos (mandato
del men&uacute; Vista)</primary></indexterm></para>
</listitem>
</orderedlist>
<para>Si ha seleccionado En su Sitio para Colocaci&oacute;n, los iconos se
ordenan s&oacute;lo cuando elige Ordenar Objetos en el men&uacute; Vista o
cuando pulsa Aplicar en el cuadro de di&aacute;logo Establecer Opciones de
Vista. Si Colocaci&oacute;n est&aacute; establecido en Filas y Columnas, los
iconos se ordenan cada vez que hay un cambio en el contenido de la carpeta,
o cuando elige Actualizar en el men&uacute; Vista.</para>
</sect2>
<sect2 id="UG.FMgr.div.85" role="Procedure">
<title>Ordenar objetos<indexterm><primary>objetos</primary><secondary>ordenar</secondary></indexterm><indexterm><primary>ordenar</primary><secondary>archivos y carpetas</secondary></indexterm><indexterm><primary>objetos</primary>
<secondary>ordenar</secondary></indexterm><indexterm><primary>archivos</primary>
<secondary>ordenar</secondary></indexterm><indexterm><primary>carpetas</primary>
<secondary>ordenar</secondary></indexterm><indexterm><primary>Ordenar objetos
(mandato del men&uacute; Vista)</primary></indexterm><indexterm><primary>objetos</primary><secondary>alinear en vista del Gestor de archivos</secondary>
</indexterm><indexterm><primary>vistas del Gestor de archivos</primary><secondary>alinear iconos en</secondary></indexterm></title>
<para>El mandato Ordenar Objetos ordena los objetos de la vista actual (seg&uacute;n
los valores del cuadro de di&aacute;logo Establecer Opciones de Vista) y los
alinea seg&uacute;n un patr&oacute;n cuadricular. Los valores existentes en
otras ventanas del Gestor de archivos no se ven afectados.</para>
<itemizedlist>
<listitem><para>Elija Ordenar objetos, en el men&uacute; Vista.</para>
</listitem>
</itemizedlist>
<para>El mandato Ordenar objetos no est&aacute; disponible si la preferencia
Colocaci&oacute;n se ha establecido en Filas y columnas.</para>
</sect2>
<sect2 id="UG.FMgr.div.86" role="Procedure">
<title id="UG.FMgr.mkr.27">Para guardar las preferencias actuales como valores
predeterminados<indexterm><primary>vistas del Gestor de archivos</primary>
<secondary>guardar</secondary></indexterm><indexterm><primary>Gestor de archivos</primary><secondary>guardar preferencias actuales como valores predeterminados</secondary></indexterm><indexterm><primary>preferencias del Gestor de archivos,
guardar</primary></indexterm><indexterm><primary>cambiar</primary><secondary>preferencias predeterminadas del Gestor de archivos</secondary></indexterm></title>
<para>Cuando aplica cambios utilizando el cuadro de di&aacute;logo Establecer
preferencias, los cambios s&oacute;lo son efectivos para la sesi&oacute;n
actual. Si desea guardar las preferencias para que se utilicen la pr&oacute;xima
vez que abra el Gestor de archivos:</para>
<orderedlist>
<listitem><para>Establezca las preferencias que desee y apl&iacute;quelas
(utilizando Establecer opciones de vista y Establecer opciones de filtro,
del men&uacute; Vista).</para>
</listitem>
<listitem><para>Elija Guardar como opciones predeterminadas, en el men&uacute;
Vista.</para>
</listitem>
<listitem><para>Pulse OK.</para>
</listitem>
</orderedlist>
<para>Estos cambios en la vista predeterminada no ser&aacute;n efectivos
hasta la pr&oacute;xima vez que pulse el control Gestor de archivos, en el
Panel frontal.</para>
<para>Despu&eacute;s de guardar las preferencias actuales, todas las nuevas
vistas que abra del Gestor de archivos utilizar&aacute;n las nuevas preferencias
y la nueva lista de filtro.</para>
</sect2>
<sect2 id="UG.FMgr.div.87">
<title>Ocultaci&oacute;n de archivos y carpetas</title>
<para>Los archivos ocultos y las carpetas ocultas son aqu&eacute;llos cuyos
tipos de archivo est&aacute;n seleccionados en la <emphasis>lista de filtro</emphasis>.</para>
<para>El criterio para ocultar o mostrar un archivo o carpeta est&aacute;
basado en su tipo de datos. Utilice el mandato Establecer Opciones de Filtro
para cambiar los tipos de datos que se muestran y los que se ocultan. (Vea
<!--Original XRef content: '&ldquo;Para especificar los tipos de datos a--><!--
ocultar'--><xref role="SectionTitle" linkend="ug.fmgr.mkr.29">m&aacute;s adelante.)
De forma predeterminada, los tipos de datos ocultos son DOT_FILE, DOT_FOLDER
y CURRENT_FOLDER.</para>
</sect2>
<sect2 id="UG.FMgr.div.88" role="Procedure">
<title id="UG.FMgr.mkr.28">Para mostrar u ocultar archivos y carpetas<indexterm>
<primary>archivos ocultos</primary></indexterm><indexterm><primary>ocultos</primary><secondary>archivos</secondary></indexterm><indexterm><primary>carpetas</primary><secondary>ocultas</secondary></indexterm><indexterm><primary>archivos punto</primary></indexterm><indexterm><primary>.. (directorio padre)</primary></indexterm></title>
<itemizedlist>
<listitem><para>Elija Mostrar objetos ocultos, en el men&uacute; Vista.</para>
</listitem>
</itemizedlist>
<para>Cuando selecciona el mandato por segunda vez se invierte la acci&oacute;n
(de mostrar a ocultar y viceversa).</para>
<para>El criterio para ocultar o mostrar un archivo o carpeta est&aacute;
basado en su tipo de datos. Utilice el mandato Establecer Opciones de Filtro
para cambiar los tipos de datos que se muestran y los que se ocultan. (Vea
<!--Original XRef content: '&ldquo;Para especificar los tipos de datos a
ocultar'--><xref role="SectionTitle" linkend="UG.FMgr.mkr.29"> m&aacute;s
adelante.) De forma predeterminada, los tipos de datos ocultos son DOT_FILE,
DOT_FOLDER y CURRENT_FOLDER.</para>
</sect2>
<sect2 id="UG.FMgr.div.89" role="Procedure">
<title id="UG.FMgr.mkr.29">Para especificar los tipos de datos a ocultar<indexterm><primary>ocultar</primary><secondary>objetos</secondary></indexterm><indexterm>
<primary>objetos</primary><secondary>ocultar</secondary></indexterm><indexterm>
<primary>ocultar</primary><secondary>archivos</secondary></indexterm><indexterm>
<primary>ocultar</primary><secondary>carpetas</secondary></indexterm><indexterm>
<primary>objetos</primary><secondary>ocultar</secondary></indexterm><indexterm>
<primary>archivos</primary><secondary>ocultar</secondary></indexterm><indexterm>
<primary>carpetas</primary><secondary>ocultar</secondary></indexterm></title>
<orderedlist>
<listitem><para>Elija Establecer opciones de filtro, en el men&uacute; Vista.
</para>
<para>Los tipos de datos que ya se han elegido para ocultar est&aacute;n resaltados.
</para>
</listitem>
<listitem><para>En el cuadro Tipos de datos a ocultar, seleccione los tipos
de datos que desea que est&eacute;n ocultos. Los tipos de datos que ya est&aacute;n
ocultos aparecen resaltados.</para>
<para><emphasis>O bien</emphasis>, para restaurar la lista de filtro predeterminada
(DOT_FILE, DOT_FOLDER y CURRENT_FOLDER), pulse Predeterminados.</para>
</listitem>
<listitem><para><emphasis>Opcional</emphasis>. Escriba un patr&oacute;n de
nombre en el campo Tambi&eacute;n oculto (Opcional) para especificar nombres
adicionales de archivo y de carpeta que se han de ocultar.</para>
<para>La lista de filtro especifica los archivos que <emphasis>no</emphasis>
se han de mostrar. Si selecciona todos los tipos de objeto o escribe un asterisco
(*) en el campo Cadena de filtro, no se mostrar&aacute; <emphasis>ning&uacute;n</emphasis> archivo. Si escribe <filename>*.txt</filename>, cualquier archivo
cuyo nombre finalice con <filename>.txt</filename> se a&ntilde;adir&aacute;
a la lista de filtro y no se mostrar&aacute;.</para>
<para>Usuarios expertos: La Cadena de filtro puede ser cualquier <emphasis>expresi&oacute;n regular</emphasis>. Consulte la p&aacute;gina de manual <filename moreinfo="RefEntry">regexp(5)</filename> para obtener m&aacute;s informaci&oacute;n.
</para>
</listitem>
<listitem><para>Pulse OK.</para>
</listitem>
</orderedlist>
<para>Si desea ver los resultados antes de cerrar el cuadro de di&aacute;logo,
pulse en Aplicar.</para>
<para>Para restaurar la lista de filtro predeterminada, elija Predeterminados.
Esto restaura los valores predeterminados, pero no surte efecto hasta que
se pulsa Aplicar u OK.</para>
</sect2>
<sect2 id="UG.FMgr.div.90">
<title>Examen de iconos</title>
<para><indexterm><primary>iconos</primary><secondary>examinar en Gestor de
archivos</secondary></indexterm><indexterm><primary>Gestor de archivos</primary>
<secondary>examinar iconos en</secondary></indexterm>Los archivos cuyos nombres
finalizan con <filename>.pm</filename> o <filename>.bm</filename> contienen
iconos. Estos son los archivos que el Gestor de archivos utiliza para crear
iconos. De forma predeterminada, debe abrir estos archivos si desea ver los
iconos que contienen. Si habilita el examen de iconos, el Gestor de archivos
muestra el contenido de los archivos <filename>.pm</filename> o <filename>.bm</filename> para que no tenga que abrirlos para ver su contenido.</para>
<figure>
<title>Icono con el examen de iconos habilitado (izquierda) e inhabilitado
(derecha)</title>
<graphic id="UG.FMgr.grph.4" entityref="UG.FMgr.fig.11"></graphic>
</figure>
<sect3 id="UG.FMgr.div.91" role="Procedure">
<title>Para habilitar el examen de iconos</title>
<orderedlist>
<listitem><para>Copie el archivo <filename>/usr/dt/ejemplos/tipos/</filename><symbol role="Variable">idioma</symbol><filename>/IconBrowse.dt</filename> en la carpeta <symbol role="Variable">DirectorioInicio</symbol><filename>/.dt/tipos</filename>.
</para>
</listitem>
<listitem><para>Abra el Gestor de aplicaciones y efect&uacute;e una doble
pulsaci&oacute;n en Recargar acciones, en el grupo de aplicaciones Herramientas_Escritorio.
</para>
</listitem>
</orderedlist>
<note>
<para>El &aacute;rea m&aacute;xima predeterminada de visualizaci&oacute;n
para los iconos es de 38x38 pixels. Por tanto, si un archivo de im&aacute;genes
es mayor que 38x38, se recortar&aacute; la imagen y s&oacute;lo se mostrar&aacute;
la zona superior izquierda de 38x38 pixels. Puede aumentar el tama&ntilde;o
del &aacute;rea de visualizaci&oacute;n para iconos si desea que sean totalmente
visibles im&aacute;genes mayores (vea <!--Original XRef content: '&ldquo;Para
 cambiar el tama&ntilde;o del &aacute;rea de visualizaci&oacute;n de iconos'--><xref
role="SectionTitle" linkend="UG.FMgr.mkr.30">). Sin embargo, un &aacute;rea
de visualizaci&oacute;n mayor har&aacute; m&aacute;s lenta la apertura de
carpetas, y los iconos estar&aacute;n m&aacute;s separados en las vistas de
carpetas.</para>
</note>
</sect3>
<sect3 id="UG.FMgr.div.92" role="Procedure">
<title>Para inhabilitar el examen de iconos</title>
<orderedlist>
<listitem><para><indexterm><primary>examinar iconos</primary></indexterm><indexterm>
<primary>Gestor de archivos</primary><secondary>inhabilitaci&oacute;n del
examen de iconos en el</secondary></indexterm>Elimine su copia personal del
archivo <computeroutput>IconBrowse.dt</computeroutput>.</para>
</listitem>
<listitem><para>Abra el Gestor de aplicaciones y efect&uacute;e una doble
pulsaci&oacute;n en Recargar acciones, en el grupo de aplicaciones Herramientas_Escritorio.
</para>
</listitem>
</orderedlist>
</sect3>
</sect2>
<sect2 id="UG.FMgr.div.93" role="Procedure">
<title id="UG.FMgr.mkr.30">Para cambiar el tama&ntilde;o del &aacute;rea de
visualizaci&oacute;n de iconos<indexterm><primary>iconos</primary><secondary>cambiar tama&ntilde;o del &aacute;rea de visualizaci&oacute;n en Gestor de
archivos</secondary></indexterm><indexterm><primary>Gestor de archivos</primary>
<secondary>cambiar tama&ntilde;o del &aacute;rea de visualizaci&oacute;n de
iconos en el</secondary></indexterm></title>
<orderedlist>
<listitem><para>Abra una ventana de terminal y escriba <command>dtpad ~/.Xdefaults</command>.</para>
</listitem>
<listitem><para>Cuando se muestra el archivo, puede estar vac&iacute;o o puede
ya haber texto en &eacute;l. En cualquiera de los dos casos, a&ntilde;ada
las cuatro l&iacute;neas de texto siguientes al archivo:</para>
<para remap="CodeIndent1"><programlisting>Dtfile*smallIconWidth:24 
Dtfile*smallIconHeight:24
Dtfile*largeIconWidth:38 
Dtfile*largeIconHeight:38</programlisting></para>
<para>Cuando escriba estas l&iacute;neas, sustituya los n&uacute;meros predeterminados
del final de cada l&iacute;nea por el nuevo tama&ntilde;o de &aacute;rea de
visualizaci&oacute;n que desee.</para>
</listitem>
<listitem><para>Elija Guardar, en el men&uacute; Archivo.</para>
</listitem>
<listitem><para>Elija Cerrar, en el men&uacute; Archivo.</para>
</listitem>
</orderedlist>
<note>
<para>El cambio no ser&aacute; efectivo hasta que salga del escritorio y vuelva
a iniciar la sesi&oacute;n. Si deseara volver al tama&ntilde;o predeterminado
del &aacute;rea de visualizaci&oacute;n, vuelva a escribir los tama&ntilde;os
predeterminados o simplemente elimine las cuatro l&iacute;neas que a&ntilde;adi&oacute;,
luego salga y reinicie el escritorio.</para>
</note>
</sect2>
</sect1>
</chapter>
<!--fickle 1.14 mif-to-docbook 1.7 01/02/96 15:01:23-->
<?Pub *0000120758>
