<!-- $XConsortium: glossary.sgm /main/5 1996/06/20 18:28:14 rws CHECKEDOUT
$ -->
<!-- (c) Copyright 1995 Digital Equipment Corporation. -->
<!-- (c) Copyright 1995 Hewlett-Packard Company. -->
<!-- (c) Copyright 1995 International Business Machines Corp. -->
<!-- (c) Copyright 1995 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1995 Novell, Inc. -->
<!-- (c) Copyright 1995 FUJITSU LIMITED. -->
<!-- (c) Copyright 1995 Hitachi. -->
<glossary id="UG.Gloss.div.1">
<title>Glosario</title>
<glossentry><glossterm>Gestor de informaci&oacute;n</glossterm>
<glossdef>
<para>Aplicaci&oacute;n de software que permite examinar y efectuar b&uacute;squedas
en conjuntos de documentaci&oacute;n en l&iacute;nea llamados bibliotecas
de informaci&oacute;n.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Ajuste autom&aacute;tico de texto</glossterm>
<glossdef>
<para>1) Aplicaci&oacute;n de correo: ventana Componer: men&uacute; Formato:
Utilizar para que el texto escrito en la ventana Componer pase a la pr&oacute;xima
l&iacute;nea autom&aacute;ticamente sin que sea necesario presionar Intro.
</para>
<para>2) Aplicaci&oacute;n de correo: cuadro de di&aacute;logo Imprimir: Utilizar
para evitar truncar las l&iacute;neas demasiado largas para caber en la p&aacute;gina
impresa.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>acci&oacute;n</glossterm>
<glossdef>
<para>Estructura de control del escritorio que proporciona un m&eacute;todo
para ejecutar aplicaciones y mandatos, y otras actividades tales como imprimir,
eliminar archivos y cambiar directorios. Las acciones est&aacute;n definidas
en una base de datos de archivos de configuraci&oacute;n.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>activo</glossterm>
<glossdef>
<para><?Pub Caret>Ventana, elemento de ventana o icono que est&aacute; actualmente
bajo la influencia de la entrada procedente del teclado y del rat&oacute;n.
Las ventanas activas est&aacute;n diferenciadas de las dem&aacute;s ventanas
del espacio de trabajo por un color o tono caracter&iacute;stico de la barra
de t&iacute;tulo. Un elemento de ventana activo se indica mediante un resaltado
o un cursor de selecci&oacute;n.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Agenda</glossterm>
<glossdef>
<para>Aplicaci&oacute;n de software que permite planificar citas y crear listas
de tareas.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>alias</glossterm>
<glossdef>
<para>Nombre o nombres alternativos asignados a un programa o a una direcci&oacute;n
de correo electr&oacute;nico. En el correo electr&oacute;nico, es una direcci&oacute;n
para enviar correo a un grupo de usuarios. Se puede crear un alias para enviar
correo electr&oacute;nico a un grupo peque&ntilde;o o grande de personas.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>anexo</glossterm>
<glossdef>
<para>En la Aplicaci&oacute;n de correo, objeto de datos dentro de un mensaje
de correo que se muestra en forma de icono en la Lista de anexos. Un anexo
puede ser texto, sonido o un gr&aacute;fico. Se pueden a&ntilde;adir (adjuntar)
varios mensajes a un &uacute;nico mensaje de correo electr&oacute;nico.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>aplicaci&oacute;n</glossterm>
<glossdef>
<para>V&eacute;ase <emphasis>aplicaci&oacute;n de software</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Aplicaci&oacute;n de correo</glossterm>
<glossdef>
<para>Aplicaci&oacute;n que le permite enviar, recibir y componer mensajes
de correo electr&oacute;nico.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>aplicaci&oacute;n de software</glossterm>
<glossdef>
<para>Programa inform&aacute;tico que proporciona herramientas al usuario
para hacer tareas. El Gestor de estilos, el Editor de textos y el Gestor de
archivos son ejemplos de aplicaciones de software.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Aplicar</glossterm>
<glossdef>
<para>Opci&oacute;n que hace que sea efectiva una selecci&oacute;n (o grupo
de selecciones) de un cuadro de di&aacute;logo.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Arbol de temas</glossterm>
<glossdef>
<para>En un cuadro de di&aacute;logo de la ayuda general, lista ampliable
y contra&iacute;ble de temas que se pueden seleccionar para mostrar informaci&oacute;n
de ayuda.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>archivo</glossterm>
<glossdef>
<para>Unidad de datos, tal como un texto, un programa, una imagen, etc., que
se almacena en una carpeta (directorio).</para>
</glossdef>
</glossentry>
<glossentry><glossterm>archivo de configuraci&oacute;n</glossterm>
<glossdef>
<para>Archivo que se utiliza para personalizar las propiedades de una aplicaci&oacute;n.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>archivo hist&oacute;rico</glossterm>
<glossdef>
<para>Lista de los mandatos, archivos, carpetas o temas de ayuda a los que
se ha accedido m&aacute;s recientemente.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Area de conmutaci&oacute;n de espacios de trabajo</glossterm>
<glossdef>
<para>Area rectangular en el centro del Panel frontal que contiene los conmutadores
de espacios de trabajo, el control Bloquear, el bot&oacute;n Salir y el indicador
luminoso de espera.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Area de estado</glossterm>
<glossdef>
<para>Parte de una ventana donde se muestra informaci&oacute;n que indica
el estado de un objeto o el estado de una vista particular de un objeto.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Area de fondo</glossterm>
<glossdef>
<para>Area subyacente de una ventana en la que se muestran elementos tales
como botones y listas.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Area de fondo del espacio de trabajo</glossterm>
<glossdef>
<para>Parte de la pantalla no cubierta por ventanas ni iconos.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Area de trabajo</glossterm>
<glossdef>
<para>Parte de una ventana donde aparecen los controles y el texto.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>arrastrar</glossterm>
<glossdef>
<para>Pulsar y mantener pulsado un bot&oacute;n cualquiera de rat&oacute;n
mientras se desplaza el puntero&mdash;y el objeto sobre el que est&aacute;&mdash;en
la pantalla.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>arrastrar y soltar</glossterm>
<glossdef>
<para>Manipular directamente un icono utilizando un dispositivo de puntero
para mover y colocar el icono en otro lugar. Tambi&eacute;n recibe el nombre
de transferencia por arrastre.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>asignaci&oacute;n</glossterm>
<glossdef>
<para>M&eacute;todo de utilizar una acci&oacute;n para ejecutar otra. Tambi&eacute;n,
asociar entidades de un conjunto con las de otro conjunto.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Ayuda</glossterm>
<glossdef>
<para>Bot&oacute;n u opci&oacute;n de men&uacute; que se utiliza para acceder
a informaci&oacute;n sobre objetos, opciones, tareas y mensajes de error.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ayuda Sobre el Tema</glossterm>
<glossdef>
<para>Cuando elige la opci&oacute;n Sobre el tema, en el men&uacute; Ayuda,
el cursor adopta la forma de un signo de interrogaci&oacute;n y el usuario
puede obtener informaci&oacute;n acerca de un determinado mandato, operaci&oacute;n,
cuadro de di&aacute;logo o control pulsando el rat&oacute;n sobre ese objeto.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>barra de desplazamiento</glossterm>
<glossdef>
<para>Control situado a la derecha o en la parte inferior de una ventana que
le permite mostrar contenido de la ventana que no es visible en ese momento.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>barra de divisi&oacute;n</glossterm>
<glossdef>
<para>Casilla situada en un separador o barra de separaci&oacute;n que le
permite aumentar o reducir el tama&ntilde;o de un panel de ventana utilizando
el rat&oacute;n. Puede desplazarse hasta la barra de divisi&oacute;n utilizando
el teclado.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>barra de men&uacute;s</glossterm>
<glossdef>
<para>Parte de la ventana de la aplicaci&oacute;n, situada entre la barra
de t&iacute;tulo y el &aacute;rea de trabajo, donde se listan nombres de men&uacute;s.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>barra de t&iacute;tulo</glossterm>
<glossdef>
<para>El &aacute;rea superior de una ventana que contiene el t&iacute;tulo
de la ventana, el bot&oacute;n del men&uacute; de la ventana, y los botones
de maximizar y minimizar. V&eacute;ase tambi&eacute;n t&iacute;tulo de ventana.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>biblioteca de informaci&oacute;n</glossterm>
<glossdef>
<para>Conjunto de estantes para libros.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bloqueo de pantalla</glossterm>
<glossdef>
<para>Funci&oacute;n que bloquea la pantalla de la estaci&oacute;n de trabajo,
impidiendo la entrada adicional de datos hasta que se entre la contrase&ntilde;a
de usuario v&aacute;lida.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>borde de redimensionar</glossterm>
<glossdef>
<para>Control que se utiliza para cambiar el tama&ntilde;o de una ventana
o de un panel de una ventana.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bot&oacute;n</glossterm>
<glossdef>
<para>T&eacute;rmino gen&eacute;rico para un control de ventana. V&eacute;ase
bot&oacute;n de acci&oacute;n.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bot&oacute;n izquierdo del rat&oacute;n</glossterm>
<glossdef>
<para>En un rat&oacute;n configurado para la mano derecha, el bot&oacute;n
situado m&aacute;s a la izquierda; en un rat&oacute;n configurado para la
mano izquierda, el bot&oacute;n situado m&aacute;s a la derecha. El bot&oacute;n
1 del rat&oacute;n se utiliza principalmente para la selecci&oacute;n, y es
el bot&oacute;n predeterminado para la instrucci&oacute;n &ldquo;pulsar&rdquo;.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bot&oacute;n 2 del rat&oacute;n</glossterm>
<glossdef>
<para>En un rat&oacute;n de tres botones, el bot&oacute;n central. En un rat&oacute;n
de dos botones, e bot&oacute;n derecho si el rat&oacute;n est&aacute; configurado
para la mano derecha, o el bot&oacute;n izquierdo si esta configurado para
la mano izquierda. El bot&oacute;n 2 del rat&oacute;n tiene dos modos: Transferir
y Ajustar.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bot&oacute;n derecho del rat&oacute;n</glossterm>
<glossdef>
<para>En un rat&oacute;n, el bot&oacute;n m&aacute;s a la derecha cuando el
rat&oacute;n est&aacute; configurado para la mano derecha; el bot&oacute;n
m&aacute;s a la izquierda cuando est&aacute; configurado para la mano izquierda.
El bot&oacute;n derecho del rat&oacute;n activa men&uacute;s emergentes.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bot&oacute;n Bloquear</glossterm>
<glossdef>
<para>Control del Panel frontal que se utiliza para bloquear la pantalla.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bot&oacute;n de acci&oacute;n</glossterm>
<glossdef>
<para>Control que inicia de forma inmediata una acci&oacute;n por parte de
una aplicaci&oacute;n, generalmente ejecutando un mandato (tal como Aplicar),
mostrando una ventana o un men&uacute;.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bot&oacute;n de flecha</glossterm>
<glossdef>
<para>Elemento de una barra de desplazamiento que se utiliza para desplazar
el contenido de una ventana seg&uacute;n peque&ntilde;os incrementos. Tambi&eacute;n,
control del Panel frontal que se utiliza para abrir un subpanel.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bot&oacute;n de maximizar</glossterm>
<glossdef>
<para>Bot&oacute;n en la barra de t&iacute;tulo de una ventana que el usuario
elige para mostrar la ventana en su tama&ntilde;o m&aacute;ximo.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bot&oacute;n de minimizar</glossterm>
<glossdef>
<para>Bot&oacute;n en la barra de t&iacute;tulo de una ventana que el usuario
elige para mostrar la ventana como icono.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bot&oacute;n de rat&oacute;n</glossterm>
<glossdef>
<para>Mecanismo de un rat&oacute;n que el usuario pulsa para hacer selecciones.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bot&oacute;n de selecci&oacute;n</glossterm>
<glossdef>
<para>Control exclusivo cuyo valor viene indicado por la presencia o ausencia
de un indicador gr&aacute;fico; generalmente forma parte de un grupo de botones
de selecci&oacute;n. Un bot&oacute;n de selecci&oacute;n tiene dos estados,
activado y desactivado.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bot&oacute;n del men&uacute; de la ventana</glossterm>
<glossdef>
<para>Control situado en la esquina superior izquierda de una ventana, junto
a la barra de t&iacute;tulo. Cuando se elige, se muestra el men&uacute; de
la ventana.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bot&oacute;n Salir</glossterm>
<glossdef>
<para>Control del Panel frontal que se utiliza para finalizar la sesi&oacute;n
en el escritorio.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Buz&oacute;n de entrada</glossterm>
<glossdef>
<para>Contenedor principal o predeterminado de la Aplicaci&oacute;n de correo.
El Buz&oacute;n de entrada recibe todo el correo entrante. Los mensajes se
pueden sacar del Buz&oacute;n de entrada y colocar en diversos contenedores.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>cabecera</glossterm>
<glossdef>
<para>En la Aplicaci&oacute;n de correo, informaci&oacute;n b&aacute;sica
sobre un mensaje de correo electr&oacute;nico que aparece en el contenedor
de correo. Una cabecera de mensaje muestra el nombre del remitente, el tema,
la fecha y hora en que se recibi&oacute; y el tama&ntilde;o del mensaje.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Calculadora</glossterm>
<glossdef>
<para>Aplicaci&oacute;n de software que imita el funcionamiento de una calculadora
port&aacute;til.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>campo de texto</glossterm>
<glossdef>
<para>Area rectangular de una ventana donde se escribe informaci&oacute;n.
Los campos de texto con foco de teclado tienen un cursor parpadeante de inserci&oacute;n
de texto.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Cancelar</glossterm>
<glossdef>
<para>Bot&oacute;n de acci&oacute;n que elimina una ventana sin aplicar ning&uacute;n
cambio efectuado en esa ventana.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>carpeta</glossterm>
<glossdef>
<para>Icono que representa un directorio.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>carpeta actual</glossterm>
<glossdef>
<para>Carpeta que est&aacute; abierta actualmente en una vista activa del
Gestor de archivos.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>carpeta de inicio</glossterm>
<glossdef>
<para>Carpeta donde el usuario guarda archivos personales y directorios adicionales.
De forma predeterminada, las ventanas del Gestor de archivos y del Emulador
de terminal est&aacute;n situadas en la carpeta de inicio cuando las abre
por primera vez. En el contexto de actividades desde la l&iacute;nea de mandatos,
se puede denominar directorio de inicio.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>carpeta padre</glossterm>
<glossdef>
<para>Carpeta que contiene subcarpetas y archivos. En el contexto de actividades
desde la l&iacute;nea de mandatos, se puede denominar directorio padre.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>car&aacute;cter de salto de l&iacute;nea</glossterm>
<glossdef>
<para>Car&aacute;cter invisible que se&ntilde;ala el final de una l&iacute;nea
de texto en un documento. Indica a una impresora o pantalla que divida una
l&iacute;nea y comience una nueva.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>casilla de verificaci&oacute;n</glossterm>
<glossdef>
<para>Control no exclusivo cuyo valor viene indicado por la presencia o ausencia
de una marca de selecci&oacute;n. Una casilla de verificaci&oacute;n tiene
dos estados, activado y desactivado.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>CDE</glossterm>
<glossdef>
<para>Acr&oacute;nimo de Common Desktop Environment (Entorno com&uacute;n
de escritorio), interfaz gr&aacute;fica de usuario que funciona bajo UNIX.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Cerrar</glossterm>
<glossdef>
<para>Opci&oacute;n de men&uacute; que se utiliza para eliminar una ventana
y todas las ventanas secundarias asociadas de todos los espacios de trabajo.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Cita de grupo</glossterm>
<glossdef>
<para>En la Agenda, cita para un grupo de personas, que se planifica utilizando
el Editor de citas de grupo.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>cliente</glossterm>
<glossdef>
<para>Sistema o aplicaci&oacute;n de software que solicita servicios de otra
aplicaci&oacute;n, generalmente a trav&eacute;s de una red.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>cola</glossterm>
<glossdef>
<para>Lista ordenada de trabajos en espera de ejecutarse.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Configurar</glossterm>
<glossdef>
<para>Bot&oacute;n de los cuadro de di&aacute;logo Imprimir de Agenda, Gestor
de informaci&oacute;n, Aplicaci&oacute;n de correo y Editor de textos para
poner en pantalla el cuadro de di&aacute;logo Configurar impresi&oacute;n.
Ver <emphasis>Configurar impresi&oacute;n</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Configurar impresi&oacute;n</glossterm>
<glossdef>
<para>Cuadro de di&aacute;logo que permite especificar opciones de la impresora
seleccionada, como por ejemplo la orientaci&oacute;n de la p&aacute;gina (vertical
u horizontal), impresi&oacute;n en una o dos caras y la bandeja de impresora
a utilizar. Agenda, Gestor de informaci&oacute;n, Aplicaci&oacute;n de correo
y Editor de textos ponen este cuadro de di&aacute;logo en pantalla cuando
se hace doble clic en el bot&oacute;n Configurar de su cuadro de di&aacute;logo
de impresi&oacute;n.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>conmutador de espacios de trabajo</glossterm>
<glossdef>
<para>Control que le permite seleccionar un espacio de trabajo de entre varios.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>conmutar</glossterm>
<glossdef>
<para>Cambiar el estado de un control de dos estados, tal como un bot&oacute;n
de selecci&oacute;n, utilizando el rat&oacute;n o el teclado.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>contenedor</glossterm>
<glossdef>
<para>Control con la finalidad de contener objetos o datos. Son ejemplos de
contenedores una carpeta y un cuaderno. En la Aplicaci&oacute;n de correo,
el buz&oacute;n de correo del usuario y el sistema de archivo que contiene
todos los mensajes de correo. Una vez que un mensaje se coloca en un contenedor,
lo puede visualizar, modificar, suprimir, imprimir, incluir, reenviar y responder
a &eacute;l.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>contenedor del correo</glossterm>
<glossdef>
<para>Buz&oacute;n de correo electr&oacute;nico y sistema de archivo que contiene
todos los mensajes de correo. Una vez que un mensaje se coloca en un contenedor,
lo puede visualizar, modificar, suprimir, imprimir, incluir, reenviar y responder
a &eacute;l.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>contrase&ntilde;a</glossterm>
<glossdef>
<para>Secuencia de caracteres que el usuario escribe para mostrar su identidad
al sistema.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>contraste atenuado</glossterm>
<glossdef>
<para>Contraste reducido para indicar resaltado de no disponible.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>control</glossterm>
<glossdef>
<para>T&eacute;rmino gen&eacute;rico para elementos diversos (tales como botones,
casillas de verificaci&oacute;n y barras de desplazamiento) que realizan una
acci&oacute;n o indican un valor de opci&oacute;n. V&eacute;ase control del
Panel frontal.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>control Aplicaci&oacute;n de correo</glossterm>
<glossdef>
<para>Control del Panel frontal que se utiliza para iniciar la Aplicaci&oacute;n
de correo. Cuando se suelta un archivo en el control se carga el archivo en
la ventana de composici&oacute;n de la Aplicaci&oacute;n de correo.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>control de la Ayuda sobre el tema</glossterm>
<glossdef>
<para>Control del Panel frontal que se utiliza para acceder a informaci&oacute;n
de ayuda sobre un tema.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>control del Panel frontal</glossterm>
<glossdef>
<para>Objeto del Panel frontal que se utiliza como interfaz con servicios
b&aacute;sicos del sistema y con tareas y operaciones efectuados con frecuencia.
Los controles del Panel frontal predeterminado son: Reloj, Agenda, Aplicaci&oacute;n
de correo, Editor de textos, Visor de ayuda, Gestor de archivos, Impresora,
Gestor de estilos, Gestor de aplicaciones y Papelera.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>control deslizante</glossterm>
<glossdef>
<para>Control que utiliza una pista y un indicador para establecer un valor
de entre los valores disponibles. La posici&oacute;n del indicador del control
(o de un indicador separado) proporciona el valor establecido actualmente.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>control Impresora</glossterm>
<glossdef>
<para>Control del Panel frontal que se utiliza para iniciar la aplicaci&oacute;n
de software Impresora. Cuando suelta un archivo sobre el control se muestra
un cuadro de di&aacute;logo que puede utilizar para imprimir el archivo en
la impresora predeterminada.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>CreadorApl</glossterm>
<glossdef>
<para>Aplicaci&oacute;n de software que se utiliza para crear una interfaz
gr&aacute;fica de usuario.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Crear acci&oacute;n</glossterm>
<glossdef>
<para>Aplicaci&oacute;n de software que le permite asociar un icono a un mandato
para que &eacute;ste se pueda emitir pulsando el icono. Crear acci&oacute;n
tambi&eacute;n se utiliza para definir tipos espec&iacute;ficos de datos para
archivos de datos de una aplicaci&oacute;n y para asociar iconos a esos tipos
de datos.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>cuadro de desplazamiento</glossterm>
<glossdef>
<para>Parte de una barra de desplazamiento que muestra la posici&oacute;n
de la informaci&oacute;n visible respecto a la cantidad total de informaci&oacute;n
disponible de una ventana. El usuario pulsa el rat&oacute;n sobre un cuadro
de desplazamiento para ver informaci&oacute;n que no es visible actualmente.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>cuadro de di&aacute;logo</glossterm>
<glossdef>
<para>Ventana, mostrada por una aplicaci&oacute;n, que requiere que el usuario
entre datos.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>cursor</glossterm>
<glossdef>
<para>Dispositivo gr&aacute;fico que indica el &aacute;rea que recibir&aacute;
entrada procedente del teclado o de un dispositivo de puntero.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>cursor de texto</glossterm>
<glossdef>
<para>Cursor que muestra el punto de inserci&oacute;n para entrada de texto.
Generalmente este cursor adopta la forma de una doble T. Comp&aacute;rese
con cursor de ubicaci&oacute;n y puntero.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>desplazar (&ldquo;scroll&rdquo;)</glossterm>
<glossdef>
<para>Desplazar el cursor por los datos seg&uacute;n un incremento cada vez.
Cuando se realiza el desplazamiento, los datos se desplazan dentro de la ventana
para indicar la posici&oacute;n actual del cursor.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>destino de soltar</glossterm>
<glossdef>
<para>Gr&aacute;fico rectangular que representa la zona de soltar en una aplicaci&oacute;n.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>direcci&oacute;n</glossterm>
<glossdef>
<para>Ubicaci&oacute;n de un usuario para el correo electr&oacute;nico.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>directorio</glossterm>
<glossdef>
<para>Conjunto de archivos y directorios. En las aplicaciones con interfaz
gr&aacute;fica de usuario, puede recibir el nombre de carpeta.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>directorio de inicio del usuario</glossterm>
<glossdef>
<para>Directorio donde el usuario guarda archivos personales y directorios
adicionales. En las aplicaciones con interfaz gr&aacute;fica de usuario,
puede recibir el nombre de carpeta de inicio.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>directorio padre</glossterm>
<glossdef>
<para>Directorio que contiene subdirectorios y archivos. En las aplicaciones
con interfaz gr&aacute;fica de usuario, puede recibir el nombre de carpeta
padre.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>directorio ra&iacute;z</glossterm>
<glossdef>
<para>En un sistema de archivos jer&aacute;rquico, el directorio que contiene
todos los dem&aacute;s directorios y archivos. Est&aacute; representado por
una barra inclinada (/) en los sistemas UNIX.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>DirectorioInicio</glossterm>
<glossdef>
<para>Simboliza el directorio de inicio del usuario. Por ejemplo, si el directorio
de inicio es /usuarios/ana, entonces /DirectorioInicio/bitmaps/smile.bm equivale
a /usuarios/ana/bitmaps/smile.bm.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Editor de citas</glossterm>
<glossdef>
<para>En la Agenda, ventana que el usuario utiliza para planificar, cambiar
o suprimir una cita.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Editor de iconos</glossterm>
<glossdef>
<para>Aplicaci&oacute;n de software que se utiliza para crear nuevos iconos
y modificar los existentes.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Editor de textos</glossterm>
<glossdef>
<para>Aplicaci&oacute;n de software que se utiliza para crear y editar documentos.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>efectuar una doble pulsaci&oacute;n</glossterm>
<glossdef>
<para>Pulsar un bot&oacute;n de rat&oacute;n dos veces en r&aacute;pida sucesi&oacute;n
sin desplazar el puntero del rat&oacute;n. A menos que se indique otra cosa,
se supone el bot&oacute;n izquierdo del rat&oacute;n. La doble pulsaci&oacute;n
se puede utilizar a veces como alternativa para seleccionar opciones de men&uacute;.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ejecutar</glossterm>
<glossdef>
<para>Permiso de acceso para un archivo o carpeta (directorio). Para archivos,
el permiso de ejecutar permite al usuario ejecutar un programa o un archivo
de script del shell. Para carpetas (directorios), el permiso de ejecutar
permite al usuario acceder al contenido de la carpeta (directorio).</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ejecutar</glossterm>
<glossdef>
<para>Iniciar una aplicaci&oacute;n o acci&oacute;n.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>elegir</glossterm>
<glossdef>
<para>Utilizar el rat&oacute;n o el teclado para escoger una opci&oacute;n
de men&uacute;, un bot&oacute;n o un icono los cuales inician una acci&oacute;n.
Comp&aacute;rese con seleccionar.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>elemento</glossterm>
<glossdef>
<para>T&eacute;rmino gen&eacute;rico para una entidad que se puede considerar
como aut&oacute;noma en un contexto m&aacute;s amplio, por ejemplo, un &iacute;tem
de una lista o un control de una ventana.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>elemento seleccionado, selecci&oacute;n actual</glossterm>
<glossdef>
<para>Elemento resaltado actualmente en una lista.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>email</glossterm>
<glossdef>
<para>Abreviatura de &ldquo;electronic mail&rdquo; (correo electr&oacute;nico).
Generalmente el correo electr&oacute;nico designa mensajes de texto enviados
a un usuario por m&eacute;todos electr&oacute;nicos y que se reciben en un
buz&oacute;n electr&oacute;nico. A veces conocido simplemente como &ldquo;correo&rdquo;.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>emulador de terminal</glossterm>
<glossdef>
<para>Ventana que emula un tipo determinado de terminal para ejecutar programas
sin ventana. Las ventanas de emulador de terminal se utilizan generalmente
para escribir mandatos para interactuar con el sistema operativo de la estaci&oacute;n
de trabajo.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>enlace</glossterm>
<glossdef>
<para>Sin&oacute;nimo de enlace simb&oacute;lico.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>enlace simb&oacute;lico</glossterm>
<glossdef>
<para>Tipo de enlace que es capaz de apuntar a un archivo o directorio que
reside en otro dispositivo f&iacute;sico de almacenamiento o en otra partici&oacute;n
f&iacute;sica.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>escritorio</glossterm>
<glossdef>
<para>V&eacute;ase espacio de trabajo.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Escritura</glossterm>
<glossdef>
<para>Permiso para modificar el contenido de un archivo o de una carpeta.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>espacio de trabajo</glossterm>
<glossdef>
<para>Pantalla que se muestra actualmente, los iconos y ventanas que contiene,
y el &aacute;rea libre de la pantalla donde se pueden colocar iconos.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>estante para libros</glossterm>
<glossdef>
<para>Conjunto de libros electr&oacute;nicos sobre temas relacionados. Conjunto
l&oacute;gico de informaci&oacute;n (puede constar de varios libros relacionados)
que incluye un &iacute;ndice de texto completo. Un estante para libros y una
hoja de estilo son el conjunto m&iacute;nimo que puede incluirse en una biblioteca.
Ver tambi&eacute;n <emphasis>biblioteca de informaci&oacute;n</emphasis>.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>etiqueta</glossterm>
<glossdef>
<para>Texto que aparece junto a un icono o control y que designa al elemento.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>etiqueta de acci&oacute;n</glossterm>
<glossdef>
<para>Nombre que se muestra bajo el icono de una acci&oacute;n. V&eacute;ase
nombre de acci&oacute;n.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>familia de ayudas</glossterm>
<glossdef>
<para>Conjunto de vol&uacute;menes de ayudas que proporcionan informaci&oacute;n
en l&iacute;nea sobre aplicaciones relacionadas.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>filtro</glossterm>
<glossdef>
<para>Se utiliza para mostrar s&oacute;lo los objetos que cumplen determinados
criterios, tales como una coincidencia de patrones de nombre, y para ocultar
todos los dem&aacute;s objetos de la vista.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>fin de sesi&oacute;n</glossterm>
<glossdef>
<para>Terminaci&oacute;n de una sesi&oacute;n de escritorio.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>finalizar la sesi&oacute;n</glossterm>
<glossdef>
<para>Terminar o finalizar el acceso a un sistema o sesi&oacute;n de escritorio.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>foco</glossterm>
<glossdef>
<para>Lugar, indicado por el resaltado, hacia el que se dirige la entrada
procedente del teclado.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>font</glossterm>
<glossdef>
<para>Juego completo de caracteres (letras, d&iacute;gitos y caracteres especiales)
de un s&oacute;lo tama&ntilde;o y tipo de letra. Por ejemplo, Helv&eacute;tica
negrita de 10 puntos.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Gestor de aplicaciones</glossterm>
<glossdef>
<para>Ventana que contiene objetos que representan las acciones del sistema
disponibles para el usuario.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Gestor de archivos</glossterm>
<glossdef>
<para>Aplicaci&oacute;n de software que gestiona los archivos y directorios
del sistema.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Gestor de ayuda</glossterm>
<glossdef>
<para>Volumen especial de ayudas que lista toda la ayuda en l&iacute;nea
registrada del sistema.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Gestor de espacios de trabajo</glossterm>
<glossdef>
<para>Aplicaci&oacute;n de software que controla el tama&ntilde;o, la ubicaci&oacute;n
y el funcionamiento de las ventanas de m&uacute;ltiples espacios de trabajo.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Gestor de estilos</glossterm>
<glossdef>
<para>Aplicaci&oacute;n de software que se utiliza para personalizar algunos
de los elementos visuales y comportamientos de dispositivos del sistema en
el entorno del espacio de trabajo, incluyendo colores y fonts, y los comportamientos
del teclado, rat&oacute;n, ventanas y del inicio de sesi&oacute;n.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Gestor de impresi&oacute;n</glossterm>
<glossdef>
<para>Aplicaci&oacute;n de software que muestra todas las impresoras del sistema.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Gestor de sesiones</glossterm>
<glossdef>
<para>Aplicaci&oacute;n de software que controla las operaciones de guardar
sesiones, restaurar sesiones, bloquear y desbloquear la pantalla, y el uso
de protectores de pantalla. Cuando se guarda una sesi&oacute;n, se conserva
el estado del entorno de escritorio (ubicaci&oacute;n de iconos, tama&ntilde;o
y ubicaci&oacute;n de ventanas abiertas, estado abierto/cerrado de aplicaciones,
paleta actual de colores, etc) para que se pueda restaurar en el pr&oacute;ximo
inicio de sesi&oacute;n.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Gestor de ventanas</glossterm>
<glossdef>
<para>Aplicaci&oacute;n de software que proporciona a los usuarios la posibilidad
de manipular ventanas del espacio de trabajo; por ejemplo, abrir, redimensionar,
mover y cerrar ventanas.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>grupo</glossterm>
<glossdef>
<para>Conjunto de usuarios a los que se hace referencia mediante un nombre
com&uacute;n. Tambi&eacute;n, clase de permiso que determina un acceso de
grupo a archivos.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>grupo de aplicaciones</glossterm>
<glossdef>
<para>Carpeta del Gestor de aplicaciones que contiene una aplicaci&oacute;n
de software o un grupo de aplicaciones de software espec&iacute;ficos.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>hiperenlace</glossterm>
<glossdef>
<para>En el texto de la Ayuda, texto o gr&aacute;fico sobre el que pulsa el
rat&oacute;n para visualizar otro tema de la Ayuda.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>host</glossterm>
<glossdef>
<para>Sistema inform&aacute;tico.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>icono</glossterm>
<glossdef>
<para>Representaci&oacute;n gr&aacute;fica de un objeto que consta de una
imagen, un fondo de la imagen y una etiqueta. Un icono se puede manipular
directamente.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>icono de acci&oacute;n</glossterm>
<glossdef>
<para>Icono que representa una acci&oacute;n en una ventana del Gestor de
archivos o del Gestor de aplicaciones, o en el espacio de trabajo. Un icono
de acci&oacute;n se genera creando un archivo ejecutable vac&iacute;o con
el mismo nombre que la acci&oacute;n que representa.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>icono de aplicaci&oacute;n</glossterm>
<glossdef>
<para>V&eacute;ase icono de acci&oacute;n.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>icono de espacio de trabajo</glossterm>
<glossdef>
<para>Icono que se ha copiado desde el Gestor de archivos al espacio de trabajo.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>icono de ventana</glossterm>
<glossdef>
<para>Una ventana minimizada.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>indicador de l&iacute;nea de mandatos</glossterm>
<glossdef>
<para>Indicador, generalmente %, >, o $, que muestra que el sistema est&aacute;
preparado para aceptar mandatos. En una ventana de emulaci&oacute;n de terminal,
el indicador de l&iacute;nea de mandatos se visualiza pulsando Intro.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>indicador luminoso de espera</glossterm>
<glossdef>
<para>Control que parpadea al invocar una acci&oacute;n en el Panel frontal
antes de la aparici&oacute;n de una ventana o al recargar acciones.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Indice</glossterm>
<glossdef>
<para>En un volumen de ayudas, lista alfab&eacute;tica de palabras o frases
que se pueden buscar para encontrar ayuda acerca de un tema. El Sistema de
ayudas muestra el &iacute;ndice cuando el usuario elige el bot&oacute;n &Iacute;ndice
en un cuadro de di&aacute;logo de un bot&oacute;n de ayuda.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Indice de ayuda</glossterm>
<glossdef>
<para>Listado alfab&eacute;tico de temas de ayuda.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>infolib</glossterm>
<glossdef>
<para>Conjunto de archivos que forman parte de una biblioteca de informaci&oacute;n.
Ver <emphasis>biblioteca de informaci&oacute;n</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>iniciar la sesi&oacute;n</glossterm>
<glossdef>
<para>Proporcionar un nombre de usuario y una contrase&ntilde;a para obtener
acceso a un sistema o sesi&oacute;n de escritorio.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>inicio de sesi&oacute;n</glossterm>
<glossdef>
<para>Proceso de obtener acceso a un sistema.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Instalar icono</glossterm>
<glossdef>
<para>Opci&oacute;n de un subpanel que se utiliza para instalar iconos en
el Panel frontal utilizando las operaciones de arrastrar y soltar.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ITE</glossterm>
<glossdef>
<para>&ldquo;Internal Terminal Emulator&rdquo; (emulador interno de terminal).
ITE permite el uso de una pantalla de mapa de bits como terminal (mediante
el modo de l&iacute;nea de mandatos desde la pantalla de inicio de sesi&oacute;n).
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Items</glossterm>
<glossdef>
<para>Elementos de una lista o men&uacute;.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Lectura</glossterm>
<glossdef>
<para>Permiso para ver los datos de un archivo o para listar los archivos
y carpetas (directorios) de una carpeta (directorio).</para>
</glossdef>
</glossentry>
<glossentry><glossterm>libro</glossterm>
<glossdef>
<para>Libro electr&oacute;nico. Ver tambi&eacute;n <emphasis>estante para
libros</emphasis> y <emphasis>biblioteca de informaci&oacute;n</emphasis>.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>lista</glossterm>
<glossdef>
<para>Control que contiene elementos de entre los que el usuario selecciona.
Tambi&eacute;n se denomina lista de selecci&oacute;n.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Lista de citas</glossterm>
<glossdef>
<para>Lista cronol&oacute;gica de citas que muestra la Agenda.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>lista de libros</glossterm>
<glossdef>
<para>Lista de libros y estantes de libros disponibles a trav&eacute;s del
Gestor de informaci&oacute;n.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>mapa de bits</glossterm>
<glossdef>
<para>Imagen almacenada en formato de trama de puntos. Generalmente hace referencia
a una imagen limitada a dos colores (un color de primer plano y un color de
fondo). Comp&aacute;rese con mapa de pixels.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>mapa de pixels</glossterm>
<glossdef>
<para>Imagen almacenada en formato de trama de puntos. Generalmente hace referencia
a una imagen que puede tener m&aacute;s de dos colores. Comp&aacute;rese
con mapa de bits.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>marco de ventana</glossterm>
<glossdef>
<para>Parte visible de una ventana que rodea a una aplicaci&oacute;n de software.
Un marco de ventana puede contener hasta cinco controles: barra de t&iacute;tulo,
bordes de redimensionar, bot&oacute;n de minimizar, bot&oacute;n de maximizar
y el bot&oacute;n del men&uacute; de la ventana.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Maximizar</glossterm>
<glossdef>
<para>Opci&oacute;n que ampl&iacute;a una ventana a su tama&ntilde;o m&aacute;ximo
posible. mensaje de error Mensaje que requiere la atenci&oacute;n inmediata
del usuario. Los mensajes de error se utilizan para comunicar un mensaje acerca
de un error del usuario.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>men&uacute;</glossterm>
<glossdef>
<para>Lista de opciones de entre las que el usuario selecciona para realizar
una determinada tarea de aplicaci&oacute;n. V&eacute;ase tambi&eacute;n submen&uacute;.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>men&uacute; de la ventana</glossterm>
<glossdef>
<para>Men&uacute; que se muestra al elegir el bot&oacute;n del men&uacute;
de la ventana. El men&uacute; proporciona opciones para manipular la ubicaci&oacute;n
o el tama&ntilde;o de la ventana, tales como Mover, Tama&ntilde;o, Minimizar
y Maximizar.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>men&uacute; del espacio de trabajo</glossterm>
<glossdef>
<para>Men&uacute; que se muestra al se&ntilde;alar un &aacute;rea libre del
espacio de trabajo y pulsar el bot&oacute;n derecho del rat&oacute;n.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>men&uacute; desplegable</glossterm>
<glossdef>
<para>Men&uacute; de opciones relacionadas que se abre a partir de una elecci&oacute;n
en cascada cuando se pulsa el bot&oacute;n izquierdo del rat&oacute;n en una
opci&oacute;n de barra de men&uacute;s o sobre el bot&oacute;n del men&uacute;
de la ventana.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>men&uacute; emergente</glossterm>
<glossdef>
<para>Men&uacute; que, a petici&oacute;n, se muestra junto al objeto al que
est&aacute; asociado. Generalmente los men&uacute;s emergentes se abren pulsando
el bot&oacute;n 3 del rat&oacute;n o las teclas Desplazamiento+F10.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Minimizar</glossterm>
<glossdef>
<para>Convertir una ventana en un icono. El bot&oacute;n de acci&oacute;n
que minimiza una ventana est&aacute; situado cerca de la esquina superior
derecha del marco de la ventana.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>mnemot&eacute;cnico</glossterm>
<glossdef>
<para>Car&aacute;cter individual que est&aacute; subrayado en un nombre de
mandato. El mnemot&eacute;cnico indica que puede elegir el mandato tecleando
esa letra. Los mnemot&eacute;cnicos se utilizan m&aacute;s com&uacute;nmente
en mandatos de men&uacute; pero otros botones pueden tambi&eacute;n tener
mnemot&eacute;cnicos.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Mover</glossterm>
<glossdef>
<para>Opci&oacute;n del men&uacute; de la ventana que se utiliza para poner
una ventana en una ubicaci&oacute;n diferente de la pantalla.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>m&eacute;todo abreviado</glossterm>
<glossdef>
<para>T&eacute;rmino general para describir una operaci&oacute;n de rat&oacute;n
que simplifica el llenado de un cuadro de di&aacute;logo. Por ejemplo: Como
m&eacute;todo abreviado, efect&uacute;e una doble pulsaci&oacute;n sobre un
elemento del cuadro de lista Nombre de archivo para seleccionarlo y elija
OK, todo ello en una sola acci&oacute;n.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>nombre base</glossterm>
<glossdef>
<para>Nombre de archivo de un archivo de icono exceptuando los sufijos correspondientes
al tama&ntilde;o (.l, .m, .s, .t) y al tipo (.bm, .pm). Por ejemplo, el nombre
base de un archivo de icono llamado miicono.m.pm es miicono.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>nombre de acci&oacute;n</glossterm>
<glossdef>
<para>Nombre asociado a una acci&oacute;n, que de forma predeterminada se
muestra bajo el icono correspondiente a la acci&oacute;n. V&eacute;ase etiqueta
de acci&oacute;n.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>nombre de archivo</glossterm>
<glossdef>
<para>Nombre del archivo tal como est&aacute; almacenado en una carpeta (directorio)
de un dispositivo de almacenamiento. Un nombre de archivo consta de un nombre
base y sufijos. Un nombre completo de archivo tambi&eacute;n incluye la ruta.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>nombre de usuario</glossterm>
<glossdef>
<para>Identificador para hacer que el sistema reconozca un usuario. A veces
se denomina nombre de inicio de sesi&oacute;n. Por ejemplo, un usuario cuyo
nombre sea John Doe podr&iacute;a tener jdoe como nombre de usuario. La pantalla
de inicio de sesi&oacute;n solicita el nombre de usuario.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>objeto</glossterm>
<glossdef>
<para>Cualquier elemento de datos de tipo l&oacute;gico que tiene un comportamiento
asociado. Por ejemplo, en el Gestor de archivos, los archivos, las carpetas,
las acciones y las aplicaciones se consideran todos ellos objetos. Cada tipo
de objeto tiene acciones espec&iacute;ficas asociadas. Generalmente, cada
objeto est&aacute; representado por un icono.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>objeto del espacio de trabajo</glossterm>
<glossdef>
<para>Objeto que reside en un espacio de trabajo, en lugar de dentro de un
visor de una ventana. Los objetos del espacio de trabajo incluyen ventanas,
iconos (ventanas minimizadas) y objetos que se han arrastrado desde el Gestor
de archivos y desde el Gestor de aplicaciones para soltarlos en un espacio
de trabajo.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>OK</glossterm>
<glossdef>
<para>Opci&oacute;n que acepta la informaci&oacute;n contenida en una ventana
y la cierra. Si la ventana contiene informaci&oacute;n que se ha cambiado,
se aplican esos cambios antes de cerrar la ventana.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>opci&oacute;n de men&uacute;</glossterm>
<glossdef>
<para>Elemento de un men&uacute; que representa una opci&oacute;n (por ejemplo,
Copiar, en el men&uacute; Editar).</para>
</glossdef>
</glossentry>
<glossentry><glossterm>paginar</glossterm>
<glossdef>
<para>Avanzar cada vez una ventana completa de texto en una ventana, generalmente
utilizando una barra de desplazamiento.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>paleta</glossterm>
<glossdef>
<para>Gama de opciones representadas gr&aacute;ficamente, tales como colores
o conjuntos de herramientas, que el usuario puede seleccionar en una aplicaci&oacute;n.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Panel frontal</glossterm>
<glossdef>
<para>Ventana en una posici&oacute;n central que contiene controles para acceder
a aplicaciones y a utilidades, incluyendo el conmutador de espacios de trabajo.
El Panel frontal reside en todos los espacios de trabajo.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Panel principal</glossterm>
<glossdef>
<para>Parte del Panel frontal excluyendo los subpaneles.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Papelera</glossterm>
<glossdef>
<para>Contenedor para archivos o carpetas suprimidos.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>pausar</glossterm>
<glossdef>
<para>Suspender temporalmente un proceso sin finalizarlo.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>permiso</glossterm>
<glossdef>
<para>Valor que determina c&oacute;mo los usuarios o grupos de usuarios pueden
acceder a un archivo o carpeta (directorio).</para>
</glossdef>
</glossentry>
<glossentry><glossterm>permisos de acceso</glossterm>
<glossdef>
<para>Permisos otorgados a un usuario o a un grupo de usuarios para efectuar
operaciones diversas en un archivo o carpeta (directorio). V&eacute;ase permiso.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>personalizaci&oacute;n</glossterm>
<glossdef>
<para>Proceso de cambiar valores para modificar el aspecto y el comportamiento
del escritorio y de aplicaciones que se ejecutan en &eacute;l.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>plantilla</glossterm>
<glossdef>
<para>En la Aplicaci&oacute;n de correo, archivo ASCII que el usuario puede
crear para incluir c&oacute;modamente informaci&oacute;n que escribe con frecuencia,
tal como el nombre y la direcci&oacute;n de correo, en los mensajes de correo.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>portapapeles</glossterm>
<glossdef>
<para>Almacenamiento intermedio que guarda temporalmente los &uacute;ltimos
datos que se han cortado, copiado o pegado.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>primer plano</glossterm>
<glossdef>
<para>Contenido de una ventana y el color o sombreado utilizado para diferenciarlo
del fondo de la ventana.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>programa</glossterm>
<glossdef>
<para>Secuencia de instrucciones que un sistema puede interpretar y ejecutar.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Propiedades</glossterm>
<glossdef>
<para>Opci&oacute;n de men&uacute; que se utiliza para establecer caracter&iacute;sticas
de un elemento, tales como su fecha o nombre, o para mostrar caracter&iacute;sticas
distintivas de un elemento, tales como tipos de letras.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Protector de pantalla</glossterm>
<glossdef>
<para>Opci&oacute;n que, tras un per&iacute;odo de tiempo especificado, apaga
la pantalla de la estaci&oacute;n de trabajo o cambia las im&aacute;genes
que se muestran, prolongando as&iacute; la vida de la pantalla.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>pulsar (el rat&oacute;n)</glossterm>
<glossdef>
<para>Pulsar y liberar un bot&oacute;n de rat&oacute;n sin desplazar el puntero
del rat&oacute;n. A menos que se indique otra cosa, se supone el bot&oacute;n
1 del rat&oacute;n.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>puntero</glossterm>
<glossdef>
<para>Cursor que muestra el &aacute;rea que recibir&aacute; entrada procedente
de un dispositivo de puntero. El puntero puede adoptar la forma de una flecha,
una doble T, una cruz u otro signo gr&aacute;fico. V&eacute;ase tambi&eacute;n
cursor.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>punto de inserci&oacute;n</glossterm>
<glossdef>
<para>Punto en el que aparecen en la pantalla los datos tecleados en el teclado
o pegados desde el portapapeles o archivo. Dentro de texto, sin&oacute;nimo
de cursor.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>rat&oacute;n</glossterm>
<glossdef>
<para>Dispositivo para desplazar el puntero y hacer selecciones.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>recurso</glossterm>
<glossdef>
<para>Mecanismo del Sistema de ventana XTM para especificar un atributo (aspecto
o comportamiento) de una ventana o aplicaci&oacute;n. Generalmente los recursos
se designan con el nombre de los elementos que controlan.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>reiniciar</glossterm>
<glossdef>
<para>Detener un proceso e iniciarlo de nuevo.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Reloj</glossterm>
<glossdef>
<para>Control del Panel frontal que muestra la hora local.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>resaltar (v), resaltado (n)</glossterm>
<glossdef>
<para>(v) Hacer que algo destaque en la pantalla al seleccionarlo o elegirlo.
(n) Indicador visual de que algo est&aacute; seleccionado.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Restablecer</glossterm>
<glossdef>
<para>Bot&oacute;n u opci&oacute;n de men&uacute; que se utiliza para devolver
un elemento a la condici&oacute;n que ten&iacute;a cuando se abri&oacute;
por &uacute;ltima vez o cuando se aplicaron los cambios m&aacute;s recientes,
lo que sea m&aacute;s reciente.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Restaurar</glossterm>
<glossdef>
<para>Opci&oacute;n de men&uacute; que se utiliza para devolver una ventana
al tama&ntilde;o y posici&oacute;n que ocupaba antes de minimizarla o maximizarla.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Retroceder</glossterm>
<glossdef>
<para>En el Gestor de archivos, bot&oacute;n y opci&oacute;n del men&uacute;
Desplazarse que se utiliza para recorrer enlaces en sentido inverso al que
se recorrieron. root, usuario root V&eacute;ase superusuario.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ruta</glossterm>
<glossdef>
<para>Cadena de texto que especifica la posici&oacute;n de una carpeta (directorio)
en la jerarqu&iacute;a.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>secci&oacute;n</glossterm>
<glossdef>
<para>Unidad de documentaci&oacute;n puesta en pantalla en una ventana de
lectura del Gestor de informaci&oacute;n para examinar.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Seleccionar impresora</glossterm>
<glossdef>
<para>Administrador de impresi&oacute;n: Utilizar para obtener informaci&oacute;n
acerca de impresoras disponibles y para seleccionara la impresora a utilizar.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>seleccionar</glossterm>
<glossdef>
<para>A&ntilde;adir resaltado u otra se&ntilde;al visual a una opci&oacute;n
o elemento para que se pueda utilizar o habilitar. La selecci&oacute;n no
implica el inicio de una acci&oacute;n sino un cambio de estado, tal como
el resaltado de un elemento de una lista o la activaci&oacute;n de una casilla
de verificaci&oacute;n.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>selecci&oacute;n ampliada</glossterm>
<glossdef>
<para>A&ntilde;adir varios elementos a un conjunto seleccionado mediante el
aumento de la t&eacute;cnica de selecci&oacute;n. Por ejemplo, puede aumentar
una selecci&oacute;n desplazando el puntero hacia un nuevo elemento y pulsando
simult&aacute;neamente Control y el bot&oacute;n de Selecci&oacute;n del rat&oacute;n.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>selectores</glossterm>
<glossdef>
<para>Peque&ntilde;os cuadrados visualizados en las esquinas y puntos centrales
de un elemento gr&aacute;fico seleccionado. Parte de un nombre de archivo,
a&ntilde;adida al final, que est&aacute; separada de otros</para>
</glossdef>
</glossentry>
<glossentry><glossterm>selectores de movimiento del Panel frontal</glossterm>
<glossdef>
<para>Area situada a cada extremo del Panel frontal que se utiliza para mover
el Panel y llevarlo al frente del espacio de trabajo.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>servidor</glossterm>
<glossdef>
<para>Sistema que proporciona servicios a un cliente.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>servidor de aplicaciones</glossterm>
<glossdef>
<para>Sistema host que proporciona acceso a una aplicaci&oacute;n de software.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>servidor de archivos</glossterm>
<glossdef>
<para>Sistema host que almacena archivos de datos utilizados por aplicaciones.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>servidor de impresi&oacute;n</glossterm>
<glossdef>
<para>Sistema host al que est&aacute;n conectadas una o m&aacute;s impresoras,
o el proceso de UNIX que gestiona esas impresoras.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>servidor de sesiones</glossterm>
<glossdef>
<para>Sistema que proporciona sesiones en red. Los archivos de sesi&oacute;n
residen en el servidor de sesiones y se utilizan cada vez que el usuario inicia
la sesi&oacute;n en un sistema de la red.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>sesi&oacute;n</glossterm>
<glossdef>
<para>Tiempo transcurrido entre el inicio de sesi&oacute;n y el fin de sesi&oacute;n
de un usuario. Tambi&eacute;n, una configuraci&oacute;n determinada de espacios
de trabajo, que incluye valores del Gestor de estilos, aplicaciones abiertas,
y el tama&ntilde;o y posici&oacute;n de objetos.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>sesi&oacute;n actual</glossterm>
<glossdef>
<para>Sesi&oacute;n que guarda el Gestor de sesiones cuando el usuario finaliza
la sesi&oacute;n. A menos que especifique otra cosa, est&aacute; sesi&oacute;n
se abre autom&aacute;ticamente en el inicio de sesi&oacute;n siguiente, permiti&eacute;ndole
continuar el trabajo en el punto donde lo dej&oacute;. Comp&aacute;rese con
sesi&oacute;n de inicio.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>sesi&oacute;n de inicio</glossterm>
<glossdef>
<para>Opci&oacute;n al finalizar la sesi&oacute;n para designar una sesi&oacute;n
determinada, distinta de la actual, como aqu&eacute;lla a la que volver&aacute;
autom&aacute;ticamente en el pr&oacute;ximo inicio de sesi&oacute;n.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>se&ntilde;alar</glossterm>
<glossdef>
<para>Mover el rat&oacute;n hasta que el puntero descanse sobre un elemento
o &aacute;rea determinados de la pantalla.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>sistema de archivos jer&aacute;rquico</glossterm>
<glossdef>
<para>Forma de organizar los datos en un sistema inform&aacute;tico mediante
el uso de una jerarqu&iacute;a de contenedores, a menudo llamados carpetas
(directorios), y de archivos. En este esquema, las carpetas pueden contener
otras carpetas y archivos. El anidamiento sucesivo de carpetas crea los niveles
de organizaci&oacute;n, que constituye la jerarqu&iacute;a.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>sobreescribir</glossterm>
<glossdef>
<para>Sin&oacute;nimo de sustituir.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>soltar</glossterm>
<glossdef>
<para>Despu&eacute;s de iniciar el arrastre de un objeto, el acto de liberar
el bot&oacute;n del rat&oacute;n. Si el objeto se suelta en un &aacute;rea
adecuada, se inicia una acci&oacute;n.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>subcarpeta</glossterm>
<glossdef>
<para>Carpeta contenida dentro de otra carpeta (a veces llamada la carpeta
padre). En el contexto de actividades desde la l&iacute;nea de mandatos,
puede recibir el nombre de subdirectorio.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>subdirectorio</glossterm>
<glossdef>
<para>Directorio contenido dentro de otro directorio (a veces llamado el directorio
padre). En las aplicaciones con interfaz gr&aacute;fica de usuario, puede
recibir el nombre de subcarpeta.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>submen&uacute;</glossterm>
<glossdef>
<para>Men&uacute; que se muestra eligiendo una opci&oacute;n en un men&uacute;.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>subpanel</glossterm>
<glossdef>
<para>Prolongaci&oacute;n del Panel frontal que abre proporcionando acceso
a elementos adicionales. Generalmente los subpaneles contienen grupos de elementos
relacionados.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>sufijo</glossterm>
<glossdef>
<para>Parte de un nombre de archivo, a&ntilde;adida al final, que est&aacute;
separada de otros sufijos o del nombre base del archivo mediante alguna clase
de signos de puntuaci&oacute;n, tales como un punto (.).</para>
</glossdef>
</glossentry>
<glossentry><glossterm>sufijo de archivo</glossterm>
<glossdef>
<para>Sufijo a&ntilde;adido al final de un nombre de archivo, a menudo utilizado
para tipificar archivos o para categorizar archivos para el usuario.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>superusuario</glossterm>
<glossdef>
<para>Identidad de inicio de sesi&oacute;n que habilita permisos especiales
para modificar archivos del sistema que la mayor&iacute;a de los usuarios
no tienen permiso para modificar. El superusuario tambi&eacute;n se denomina
&ldquo;usuario root&rdquo; o &ldquo;root&rdquo; debido a que su ID de usuario
es root. En la mayor&iacute;a de los sistemas, s&oacute;lo unos pocos usuarios
tienen permiso para convertirse en superusuario.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>tecla de ayuda</glossterm>
<glossdef>
<para>Tecla designada, generalmente la tecla F1, que se utiliza para solicitar
informaci&oacute;n de ayuda en l&iacute;nea acerca del elemento sobre el
que est&aacute; situado el cursor actualmente. Algunos teclados tienen una
tecla dedicada de Ayuda que puede sustituir a la tecla F1.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>tecla modificadora</glossterm>
<glossdef>
<para>Tecla que cuando se pulsa y mantiene pulsada junto con otra tecla o
bot&oacute;n de rat&oacute;n cambia el significado de la segunda tecla o de
la pulsaci&oacute;n de rat&oacute;n. Por ejemplo, Control, Alt y Desplazamiento.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>teclas de desplazamiento</glossterm>
<glossdef>
<para>Teclas del teclado que se utilizan para desplazar la posici&oacute;n
actual del cursor. Incluyen las teclas de direcci&oacute;n (con o sin la tecla
Control); la tecla Tabulador (con o sin las teclas Control o Desplazamiento);
las teclas Inicio y Fin (con o sin la tecla Control); y las teclas Retroceso
p&aacute;gina y Avance p&aacute;gina.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>teclas de direcci&oacute;n</glossterm>
<glossdef>
<para>Las cuatro teclas direccionales de un teclado. V&eacute;ase tambi&eacute;n
teclas de desplazamiento.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>teclas de m&eacute;todo abreviado</glossterm>
<glossdef>
<para>Secuencia de teclas del teclado que se utiliza para activar una opci&oacute;n
de men&uacute;. Por ejemplo: Pulse Alt+F para elegir Imprimir, del men&uacute;
Archivo.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Terminal</glossterm>
<glossdef>
<para>En el Panel frontal, elemento del subpanel Aplicaciones personales que
se utiliza para abrir una ventana de terminal.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>tipo de archivo</glossterm>
<glossdef>
<para>Caracter&iacute;sticas de un archivo que determinan c&oacute;mo se utiliza.
El tipo de un archivo se puede determinar a partir de una porci&oacute;n de
su nombre (por ejemplo, la extensi&oacute;n de archivo) o por su contenido.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>tipo de datos</glossterm>
<glossdef>
<para>Mecanismo que asocia archivos de datos determinados con las aplicaciones
y acciones adecuadas. Los tipos de datos pueden determinar el tipo de un
archivo bas&aacute;ndose en convenios de denominaci&oacute;n de archivos,
tales como un nombre de extensi&oacute;n determinado, o sobre la base del
contenido del archivo.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>tipo de objeto</glossterm>
<glossdef>
<para>Mecanismo del escritorio que se utiliza para asociar determinados archivos
de datos con las aplicaciones y acciones adecuadas. La tipificaci&oacute;n
de objetos define los criterios para tipificar el archivo (por ejemplo, el
nombre o el contenido), el aspecto (el icono utilizado en el Gestor de archivos)
y el comportamiento del objeto (por ejemplo, lo que sucede cuando se efect&uacute;a
una doble pulsaci&oacute;n sobre &eacute;l).</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Trabajos de impresi&oacute;n</glossterm>
<glossdef>
<para>Aplicaci&oacute;n de software que proporciona informaci&oacute;n acerca
de trabajos de una impresora individual.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>trama de fondo</glossterm>
<glossdef>
<para>Trama que cubre el fondo del espacio de trabajo. trama de fondo del
espacio de trabajo</para>
</glossdef>
</glossentry>
<glossentry><glossterm>transferencia por arrastre</glossterm>
<glossdef>
<para>V&eacute;ase arrastrar y soltar.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>valor predeterminado</glossterm>
<glossdef>
<para>Valor que establece autom&aacute;ticamente una aplicaci&oacute;n.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>variables de entorno</glossterm>
<glossdef>
<para>Variables est&aacute;ndar de UNIX que son utilizadas por el shell y
por aplicaciones.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ventana</glossterm>
<glossdef>
<para>Area rectangular de la pantalla. Generalmente las aplicaciones de software
tienen una ventana principal a partir de la cual se pueden abrir ventanas
secundarias, llamadas cuadros de di&aacute;logo.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ventana activa</glossterm>
<glossdef>
<para>Ventana que recibe entrada del teclado.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ventana de ayuda</glossterm>
<glossdef>
<para>Ventana secundaria que muestra informaci&oacute;n de ayuda.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ventana de composici&oacute;n</glossterm>
<glossdef>
<para>En la Aplicaci&oacute;n de correo, ventana que se utiliza para crear
nuevos mensajes de correo electr&oacute;nico. En la barra de men&uacute;s
de la ventana de composici&oacute;n existen varias opciones disponibles para
la composici&oacute;n de mensajes.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ventana de lectura</glossterm>
<glossdef>
<para>Ventana del Gestor de informaci&oacute;n que muestra tablas de texto
y gr&aacute;ficos de libros.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ventana de lista de libros</glossterm>
<glossdef>
<para>Cuadro de di&aacute;logo del Gestor de informaci&oacute;n que suministra
acceso a informaci&oacute;n almacenada en una biblioteca de informaci&oacute;n
para ponerla en pantalla o imprimirla.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Visor de ayuda</glossterm>
<glossdef>
<para>Aplicaci&oacute;n de software que muestra ayuda en l&iacute;nea.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>vista de Agenda</glossterm>
<glossdef>
<para>D&iacute;a, semana, mes o a&ntilde;o que se muestra en la ventana principal
de la Agenda.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>vista en &aacute;rbol</glossterm>
<glossdef>
<para>Vista de una carpeta o de archivos que incluye todas las carpetas de
nivel inferior de la ruta de b&uacute;squeda.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>volumen de ayudas</glossterm>
<glossdef>
<para>Conjunto completo de informaci&oacute;n de ayuda acerca de un tema.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>zona de soltar</glossterm>
<glossdef>
<para>Area del espacio de trabajo, que incluye los controles del Panel frontal
Papelera, Gestor de impresi&oacute;n y Aplicaci&oacute;n de correo, en la
que puede soltarse un icono. Se pueden soltar iconos en el espacio de trabajo
para lograr un acceso r&aacute;pido.</para>
</glossdef>
</glossentry>
</glossary>
<!--fickle 1.14 mif-to-docbook 1.7 01/02/96 15:01:23-->
<?Pub *0000081457>
