<!-- $XConsortium: ch01.sgm /main/2 1996/12/17 15:30:04 rws $ -->
<!-- (c) Copyright 1996 Digital Equipment Corporation. -->
<!-- (c) Copyright 1996 Hewlett-Packard Company. -->
<!-- (c) Copyright 1996 International Business Machines Corp. -->
<!-- (c) Copyright 1996 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1996 Novell, Inc. -->
<!-- (c) Copyright 1996 FUJITSU LIMITED. -->
<!-- (c) Copyright 1996 Hitachi. -->
<chapter id="INFOUG.Gstart.div.1">
<title id="INFOUG.Gstart.mkr.1">Einf&uuml;hrung</title>
<para>Das Common Desktop Environment bietet einen Standardsatz von Online-Dokumentation,
die die verschiedenen CDE- und Motif-Komponenten behandelt. Das CDE-Desktop
enth&auml;lt den Informationsmanager, damit Sie auf diese Dokumentation zugreifen,
sie lesen und durchsuchen k&ouml;nnen. Mit dem Informationsmanager k&ouml;nnen
Sie auch auf Online-Dokumentation zugreifen, die von anderen auf Ihrem Desktop
installierten Anwendungen zur Verf&uuml;gung gestellt wird.</para>
<para>Der Rest dieses Kapitels beschreibt:</para>
<itemizedlist>
<listitem><para><xref linkend="INFOUG.Gstart.div.2"></para>
</listitem>
<listitem><para><xref linkend="INFOUG.Gstart.div.3"></para>
</listitem>
<listitem><para><xref linkend="INFOUG.Gstart.div.6"></para>
</listitem>
<listitem><para><xref linkend="INFOUG.Gstart.div.10"></para>
</listitem>
</itemizedlist>
<sect1 id="INFOUG.Gstart.div.2">
<title id="INFOUG.Gstart.mkr.2">Wie die Informationen organisiert sind<indexterm>
<primary>Informationsbibliotheken</primary><secondary>Organisation der</secondary>
</indexterm></title>
<para>Wenn Sie mit dem Informationsmanager Informationen nachschlagen, erscheint
zuerst eine <firstterm>Informationsbibliothek</firstterm> (auch "Infobiblio"
genannt). Eine Informationsbibliothek ist in ein oder mehrere <firstterm>
B&uuml;cherregale</firstterm> aufgeteilt. In jedem B&uuml;cherregal finden
Sie ein oder mehrere <firstterm>B&uuml;cher</firstterm>, die die meisten der
Elemente enthalten, die Sie auch in einem Hardcopy-Buch erwarten w&uuml;rden.
</para>
<para>Ein Online-Buch enth&auml;lt, wie ein Hardcopy-Buch, <firstterm>Abschnitte
</firstterm>, die haupts&auml;chlich Text, jedoch auch Grafiken und Tabellen
enthalten k&ouml;nnen. Die B&uuml;cherliste f&uuml;r ein Buch zeigt alle darin
enthaltenen Abschnitte.</para>
<note>
<para>Sie k&ouml;nnen viele Informationsbibliotheken auf Ihrem System verf&uuml;gbar
haben.</para>
</note>
<para>Die folgende Abbildung veranschaulicht die Struktur einer Informationsbibliothek.
</para>
<figure>
<title id="InfoUGD.Gstart.infolib1">Informationsbibliothek</title>
<graphic id="INFOUG.Gstart.igrph.1" entityref="INFOUG.Gstart.fig.1"></graphic>
</figure>
</sect1>
<sect1 id="INFOUG.Gstart.div.3">
<title id="INFOUG.Gstart.mkr.3">Starten des Informationsmanagers<indexterm>
<primary>Informationsmanager</primary><secondary>starten</secondary></indexterm></title>
<para>Sie k&ouml;nnen den Informationsmanager starten durch:</para>
<itemizedlist>
<listitem><para>Klicken auf das Bedienelement &ldquo;Informationsmanager&rdquo;
im Bedienfeld.</para>
<sidebar>
<graphic id="INFOUG.Gstart.igrph.2" entityref="INFOUG.Gstart.fig.2"></graphic>
</sidebar>
</listitem>
<listitem><para>Klicken auf das Symbol f&uuml;r Informationsmanager in der
Bedientafel &ldquo;Informationsmanager&rdquo;.</para>
<sidebar>
<graphic id="INFOUG.Gstart.igrph.3" entityref="INFOUG.Gstart.fig.3"></graphic>
</sidebar>
</listitem>
<listitem><para>Ziehen und &Uuml;bergeben des Informationsbibliothek-Symbols
(im Fenster &ldquo;Dateimanager&rdquo;) auf das Bedienelement &ldquo;Informationsmanager&rdquo;
im Bedienfeld.</para>
<sidebar>
<graphic id="INFOUG.Gstart.igrph.4" entityref="INFOUG.Gstart.fig.4"></graphic>
</sidebar>
</listitem>
<listitem><para>Eingeben des Befehls <command>dtinfo</command> vom Terminal-Fenster
aus.</para>
</listitem>
</itemizedlist>
<para>Beim Start des Informationsmanagers wird das Fenster &ldquo;B&uuml;cherliste&rdquo;
angezeigt. Wie in der folgenden Abbildung zu sehen ist, zeigt das Fenster
&ldquo;B&uuml;cherliste&rdquo; die verf&uuml;gbaren Informationsbibliotheken
an.</para>
<figure>
<title id="InfoUGD.Gstart.booklist1">Fenster &ldquo;B&uuml;cherliste&rdquo;</title>
<graphic id="INFOUG.Gstart.igrph.5" entityref="INFOUG.Gstart.fig.5"></graphic>
</figure>
<para>Der Inhalt von Informationsbibliotheken ist hierarchisch organisiert,
soda&szlig; Sie von allgemeiner zu spezifischer Information gelangen. Die
Hierarchie besteht aus B&uuml;cherregalen, B&uuml;chern, Kapiteln und Abschnitten.
</para>
<itemizedlist>
<listitem><para>Sie &ouml;ffnen ein beliebiges Element in der Hierarchie,
indem Sie auf den nach rechts deutenden Pfeil daneben klicken. Der Informationsmanager
expandiert das Element, um dessen Inhalt zu zeigen.</para>
</listitem>
<listitem><para>Um ein Element (Kapitel, Buch, B&uuml;cherregal) zu schlie&szlig;en,
klicken Sie daneben auf den nach unten deutenden Pfeil. Der Informationsmanager
kollabiert das Element und entfernt dessen Inhalt vom Bildschirm.</para>
</listitem>
<listitem><para>Um einen Abschnitt eines Buches zu durchsuchen, w&auml;hlen
Sie den Namen des Abschnitts aus und klicken dann auf die Taste &ldquo;Ansicht
(Fernglas)&rdquo; in der Funktionsleiste, oder doppelklicken Sie einfach auf
den Namen des Abschnitts. Der Informationsmanager &ouml;ffnet das Lesefenster,
das den Inhalt des ausgew&auml;hlten Abschnitts anzeigt. Die folgende Abbildung
zeigt, wie Text im Lesefenster erscheint.</para>
</listitem>
</itemizedlist>
<figure>
<title id="InfoUGD.Gstart.readwin1">Lesefenster</title>
<graphic id="INFOUG.Gstart.igrph.6" entityref="INFOUG.Gstart.fig.6"></graphic>
</figure>
<para>W&auml;hrend ein Abschnitt angezeigt wird, k&ouml;nnen Sie auf die Tasten
&ldquo;Vorausgehenden Abschnitt durchsuchen&rdquo; und &ldquo;N&auml;chsten
Abschnitt durchsuchen&rdquo; (in der Funktionsleiste) klicken, um zu fr&uuml;heren
oder sp&auml;teren Abschnitten zu gelangen.</para>
<graphic id="INFOUG.Gstart.igrph.7" entityref="INFOUG.Gstart.fig.7"></graphic>
<para>Durch das Klicken auf Hypertext-Verweise (fett und unterstrichen dargestellt)
k&ouml;nnen Sie zu anderen Stellen im Buch springen.</para>
<note>
<para>Sie k&ouml;nnen das Fenster &ldquo;B&uuml;cherliste&rdquo; oder das
Lesefenster ge&ouml;ffnet lassen, soda&szlig; Sie w&auml;hrend der Arbeit
leicht darauf zugreifen k&ouml;nnen. Sie k&ouml;nnen diese Fenster auch in
Symbolgr&ouml;&szlig;e darstellen.</para>
</note>
<sect2 id="INFOUG.Gstart.div.4">
<title id="INFOUG.Gstart.mkr.4">&Ouml;ffnen einer Informationsbibliothek<indexterm>
<primary>Informationsmanager</primary><secondary>mit bestimmter Informationsbibliothek
starten</secondary></indexterm><indexterm><primary>Informationsbibliothek</primary><secondary>&ouml;ffnen</secondary></indexterm></title>
<para>Wenn Sie den Informationsmanager starten, &ouml;ffnet er eine oder mehrere
Standard-Informationsbibliotheken. Falls die gew&uuml;nschte Informationsbibliothek
nicht im Standardsatz enthalten ist, k&ouml;nnen Sie folgenderma&szlig;en
bewirken, da&szlig; der Informationsmanager beim Start die Bibliothek &ouml;ffnet:
</para>
<itemizedlist>
<listitem><para>Durch Ziehen des Symbols f&uuml;r die Informationsbibliothek
vom Dateimanagerfenster auf das Bedienelement &ldquo;Informationsmanager&rdquo;
im Bedienfeld.</para>
</listitem>
<listitem><para>Durch Doppelklicken auf das Symbol f&uuml;r die Bibliothek.
</para>
</listitem>
<listitem><para>Durch Eingeben des Befehls <command>dtinfo</command> vom Terminal-Fenster
aus und durch Angeben des Bibliothekspfades f&uuml;r die Option <literal>-l</literal>.</para>
</listitem>
</itemizedlist>
<para>Wenn der Informationsmanager bereits l&auml;uft, k&ouml;nnen Sie eine
Informationsbibliothek durch Ziehen ihres Symbols in das Fenster &ldquo;B&uuml;cherliste&rdquo;
oder das Lesefenster laden. Sie k&ouml;nnen eine Informationsbibliothek ebenfalls
laden, indem Sie auf die Taste &ldquo;Infobiblio laden&rdquo; klicken oder
die Option &ldquo;Hinzuf&uuml;gen&rdquo; im Men&uuml; &ldquo;Bearbeiten&rdquo;
des Fensters &ldquo;B&uuml;cherliste&rdquo; ausw&auml;hlen.</para>
</sect2>
</sect1>
<sect1 id="INFOUG.Gstart.div.5">
<title id="INFOUG.Gstart.mkr.5">Beenden des Informationsmanagers<indexterm>
<primary>Informationsmanager</primary><secondary>beenden</secondary></indexterm></title>
<para>Um den Informationsmanager zu beenden:</para>
<itemizedlist>
<listitem><para>W&auml;hlen Sie im Fenster &ldquo;B&uuml;cherliste&rdquo;
aus dem Men&uuml; &ldquo;Datei&rdquo; die Option &ldquo;Beenden&rdquo; aus.
</para>
</listitem>
<listitem><para>W&auml;hlen Sie im Lesefenster aus dem Men&uuml; &ldquo;Anzeigemodul&rdquo;
die Option &ldquo;Beenden&rdquo; aus.</para>
</listitem>
</itemizedlist>
<para>Sie k&ouml;nnen beide Fenster auch verlassen, indem Sie auf die Fenstermen&uuml;taste
(in der oberen linken Ecke) doppelklicken.</para>
</sect1>
<sect1 id="INFOUG.Gstart.div.6">
<title id="INFOUG.Gstart.mkr.6">Hilfe anfordern<indexterm><primary>Informationsmanager</primary><secondary>Hilfe zu</secondary></indexterm><indexterm><primary>Hilfe</primary></indexterm></title>
<para>So fordern Sie Hilfe an:<indexterm><primary>Ausw&auml;hlen</primary>
<secondary>Hilfe</secondary></indexterm></para>
<itemizedlist remap="Bullet1">
<listitem><para>Dr&uuml;cken Sie auf F1 oder die Hilfetaste<indexterm><primary>F1&ndash;Taste</primary></indexterm><indexterm><primary>Hilfetaste</primary>
</indexterm></para>
</listitem>
<listitem><para>W&auml;hlen Sie ein Element aus dem Men&uuml; &ldquo;Hilfe&rdquo;
des Informationsmanagers aus.</para>
</listitem>
<listitem><para>Klicken Sie auf die Taste &ldquo;Hilfe&rdquo; in einem Dialogfenster.
</para>
</listitem>
</itemizedlist>
<para>Die schnellste und einfachste Methode, Hilfe anzufordern, ist durch
Dr&uuml;cken der Taste F1. Der Informationsmanager zeigt dann das Hilfethema
an, das sich auf Ihre derzeitige Aktivit&auml;t bezieht.</para>
<para>Einige Tastaturen haben eine dedizierte Hilfetaste, die die Funktion
der Taste F1 &uuml;bernehmen kann.</para>
<sect2 id="INFOUG.Gstart.div.7">
<title id="INFOUG.Gstart.mkr.7">Men&uuml; &ldquo;Hilfe&rdquo;<indexterm><primary>Men&uuml; &ldquo;Hilfe&rdquo;</primary></indexterm></title>
<para>Der Informationsmanager stellt ein Men&uuml; &ldquo;Hilfe&rdquo; zur
Verf&uuml;gung, mit dem Sie bestimmte Arten von Hilfe anfordern k&ouml;nnen.
</para>
<sidebar>
<para><graphic id="INFOUG.Gstart.igrph.8" entityref="INFOUG.Gstart.fig.8"></graphic></para>
</sidebar>
<informaltable>
<tgroup cols="2" colsep="0" rowsep="0">
<colspec align="left" colwidth="138*">
<colspec align="left" colwidth="390*">
<tbody>
<row>
<entry><para>&Uuml;bersicht</para></entry>
<entry><para>Zeigt einf&uuml;hrende Informationen &uuml;ber die Eigenschaften
des Informationsmanagers an.</para></entry>
</row>
<row>
<entry><para>Aufgaben</para></entry>
<entry><para>Gibt Anweisungen zur Benutzung des Informationsmanagers.</para></entry>
</row>
<row>
<entry><para>Referenz</para></entry>
<entry><para>Zeigt zusammenfassende Informationen &uuml;ber die Komponenten
des Informationsmanagers an.</para></entry>
</row>
<row>
<entry><para>Kontexthilfe</para></entry>
<entry><para>&Auml;ndert den Zeiger in ein Fragezeichen. Klicken Sie mit dem
Fragezeichenzeiger auf ein Element, um dessen Erl&auml;uterung anzuzeigen.<indexterm>
<primary>Fragezeichenzeiger</primary></indexterm></para></entry>
</row>
<row>
<entry><para>Zu Hilfe</para></entry>
<entry><para>Zeigt Informationen &uuml;ber die Verwendung von Hilfe an.</para></entry>
</row>
<row>
<entry><para>Zum Informationsmanager</para></entry>
<entry><para>Zeigt die Version und Copyright-Informationen &uuml;ber den Informationsmanager
an.</para></entry>
</row>
</tbody>
</tgroup>
</informaltable>
</sect2>
<sect2 id="INFOUG.Gstart.div.8">
<title id="INFOUG.Gstart.mkr.8">Schnellinfo-Meldungen<indexterm><primary>Schnellinfo-Meldungen</primary></indexterm></title>
<indexterm><primary>Meldungen</primary><secondary>Schnellinfo</secondary>
</indexterm>
<para>Schnellinfo-Meldungen sind kurze Beschreibungen von Fensterkomponenten.
W&auml;hrend Sie den Zeiger &uuml;ber eine Fensterkomponente gleiten lassen,
erscheint dazu eine Schnellinfo-Meldung im Meldungsbereich. Die Meldung beschreibt
die Komponente und ihre Verwendung. Wenn Sie zum Beispiel den Zeiger auf die
Taste &ldquo;Vorausgehender Abschnitt&rdquo; (Pfeil nach oben) in der Funktionsleiste
des Lesefensters bewegen, wird folgende Meldung im Meldungsbereich angezeigt:
</para>
<para><computeroutput>Gehe zum vorausgehenden<?Pub Caret> Abschnitt im Dokument</computeroutput></para>
</sect2>
<sect2 id="INFOUG.Gstart.div.9">
<title id="INFOUG.Gstart.mkr.9">Die Verwendung von Hilfefenstern<indexterm>
<primary>Fenster</primary><secondary>Hilfe</secondary></indexterm><indexterm>
<primary>Hilfe</primary><secondary>Fenster</secondary></indexterm></title>
<para>Wenn Sie auf Hilfe zugreifen, zeigt der Informationsmanager ein Fenster
an, das den angeforderten Hilfetext enth&auml;lt. Sollten Sie zus&auml;tzliche
Informationen &uuml;ber eine der beschriebenen Aufgaben w&uuml;nschen, klicken
Sie auf die Taste &ldquo;Mehr...&rdquo;. Um Hilfe zur Benutzung von Hilfe
zu erhalten, auf die Taste &ldquo;Hilfe&rdquo; klicken. Sie schlie&szlig;en
ein Hilfefenster, indem Sie auf die Taste &ldquo;Schlie&szlig;en&rdquo; klicken.
</para>
</sect2>
</sect1>
<sect1 id="INFOUG.Gstart.div.10">
<title id="INFOUG.Gstart.mkr.10">Die Verwendung von Tastaturabk&uuml;rzungen<indexterm>
<primary>Tastatur</primary><secondary>Abk&uuml;rzungen</secondary></indexterm></title>
<para>Der Tastaturfokus zeigt Ihnen durch Hervorhebung, welches Element eines
Fensters, eines Men&uuml;s oder Bedienelements auf Ihre Eingabe reagieren
wird. Wenn Sie ein ausgew&auml;hltes Men&uuml;- oder Bedienelement (wie eine
Taste) aktivieren m&ouml;chten, dr&uuml;cken Sie auf die Leertaste.</para>
<para>Sie finden es vielleicht hilfreich, durch Dr&uuml;cken der Taste F10
den Fokus in die Men&uuml;leiste zu verschieben. Dann k&ouml;nnen Sie entweder
mit den Pfeiltasten oder durch Dr&uuml;cken des ersten Buchstabens des Men&uuml;namens
durch die Men&uuml;s navigieren.</para>
</sect1>
</chapter>
<?Pub *0000017543>
