<!-- $XConsortium: ch02.sgm /main/2 1996/12/17 15:30:12 rws $ -->
<!-- (c) Copyright 1996 Digital Equipment Corporation. -->
<!-- (c) Copyright 1996 Hewlett-Packard Company. -->
<!-- (c) Copyright 1996 International Business Machines Corp. -->
<!-- (c) Copyright 1996 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1996 Novell, Inc. -->
<!-- (c) Copyright 1996 FUJITSU LIMITED. -->
<!-- (c) Copyright 1996 Hitachi. -->
<chapter id="INFOUG.Rdbooks.div.1">
<title id="INFOUG.Rdbooks.mkr.1">B&uuml;cher lesen</title>
<para>Sie k&ouml;nnen sich auf verschiedene Arten durch eine Informationsbibliothek
bewegen. Am einfachsten ist es, eine Informationsbibliothek als Sammlung von
Online-B&uuml;chern zu betrachten. Online-B&uuml;cher haben Eigenschaften
&auml;hnlich denen in traditionellen Hardcopy-B&uuml;chern. Zum Beispiel sind
Online-B&uuml;cher in Kapitel und Abschnitte aufgeteilt und haben Inhaltsverzeichnisse.
Online-B&uuml;cher verf&uuml;gen aber auch &uuml;ber Eigenschaften wie Hypertext-Verweise,
die in Hardcopy-B&uuml;chern nicht zu finden sind.</para>
<para>Dieses Kapitel beschreibt die Grundlagen des Lesens von B&uuml;chern
und erkl&auml;rt:</para>
<itemizedlist>
<listitem><para><xref role="JumpText" linkend="INFOUG.Rdbooks.div.2"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Rdbooks.div.8"></para>
</listitem>
</itemizedlist>
<sect1 id="INFOUG.Rdbooks.div.2">
<title id="INFOUG.Rdbooks.mkr.2">Die Verwendung der Fenster des Informationsmanagers<indexterm>
<primary>Fenster</primary><secondary>benutzen</secondary></indexterm></title>
<para>Der Informationsmanager zeigt beim Start das Fenster &ldquo;B&uuml;cherliste&rdquo;
an, das die Informationsbibliotheken in Ihrem System auflistet. Das Fenster
&ldquo;B&uuml;cherliste&rdquo; bietet traditionellen Zugriff auf die Informationen,
die Sie im Informationsmanager lesen m&ouml;chten. Von diesem Fenster aus
k&ouml;nnen Sie Lesefenster &ouml;ffnen, die den Inhalt von B&uuml;chern in
einer Informationsbibliothek anzeigen. Um stets sehen zu k&ouml;nnen, wo in
einer Informationsbibliothek Sie sich gerade befinden, k&ouml;nnen Sie die
B&uuml;cherliste so einstellen, da&szlig; sie Ihre Position verfolgt. Sie
haben auch die M&ouml;glichkeit, von der B&uuml;cherliste aus Buchabschnitte
zu drucken.</para>
<para>Die folgende Abbildung zeigt das Fenster &ldquo;B&uuml;cherliste&rdquo;
des Informationsmanagers.</para>
<figure>
<title id="InfoUGD.Gstart.booklist2">Fenster &ldquo;B&uuml;cherliste&rdquo;</title>
<graphic id="INFOUG.Rdbooks.igrph.1" entityref="INFOUG.Rdbooks.fig.1"></graphic>
</figure>
<para>Wenn Sie auf den Titel eines Abschnitts doppelklicken, den Sie lesen
m&ouml;chten, &ouml;ffnet der Informationsmanager ein Lesefenster, das den
Text des ausgew&auml;hlten Abschnitts anzeigt. Vom Lesefenster aus k&ouml;nnen
Sie den Text lesen und auf alle anderen Funktionen des Informationsmanagers
zugreifen. Insbesondere k&ouml;nnen Sie Text und Grafiken ansehen, Lesezeichen
und Notizen drucken, durchsuchen und verwenden, Optionen einstellen und Hilfe
anfordern.</para>
<para>Die folgende Abbildung zeigt das Lesefenster des Informationsmanagers.
</para>
<figure>
<title id="InfoUGD.Rdbooks.readwin2">Lesefenster</title>
<graphic id="INFOUG.Rdbooks.igrph.2" entityref="INFOUG.Rdbooks.fig.2"></graphic>
</figure>
<para>W&auml;hrend die meisten Funktionen von Informationsmanagerfenstern
mit denen anderer Fenster in CDE identisch sind, sollen die folgenden Abschnitte
ein paar Tips zur Benutzung von Informationsmanagerfenstern geben:</para>
<itemizedlist>
<listitem><para><xref role="JumpText" linkend="INFOUG.Rdbooks.mkr.3"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Rdbooks.mkr.4"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Rdbooks.mkr.5"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Rdbooks.mkr.6"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Rdbooks.mkr.7"></para>
</listitem>
</itemizedlist>
<sect2 id="INFOUG.Rdbooks.div.3">
<title id="INFOUG.Rdbooks.mkr.3">Einstellen der B&uuml;cherliste zur Standortbestimmung<indexterm>
<primary>B&uuml;cherliste</primary><secondary>zur Standortbestimmung</secondary>
</indexterm><indexterm><primary>Fenster</primary><secondary>Einstellen der
B&uuml;cherliste zur Standortbestimmung</secondary></indexterm></title>
<para>Wenn Sie schnell sehen m&ouml;chten, wo in der Hierarchie der Informationsbibliothek
Sie sich gerade befinden, k&ouml;nnen Sie die B&uuml;cherliste so einstellen,
da&szlig; sie automatisch Ihren Standort festellt.</para>
<para>Wenn die automatische Standortbestimmung eingeschaltet ist, zeigt ein
Fingersymbol im Fenster &ldquo;B&uuml;cherliste&rdquo; auf den Titel des Abschnitts,
den Sie gerade lesen. W&auml;hrend Sie sich durch die Informationsbibliothek
bewegen, wird die B&uuml;cherliste automatisch erg&auml;nzt, soda&szlig; sie
immer Ihren jeweiligen Standort anzeigt.</para>
<para>Falls der aktuelle Abschnitt einem Abschnitt untergeordnet ist, der
in der B&uuml;cherliste nicht expandiert ist, erscheint das Fingersymbol 'hohl'
und zeigt auf den Titel des &uuml;bergeordneten Abschnitts.</para>
<para>Zum Ein- und Ausschalten der automatischen Standortbestimmung w&auml;hlen
Sie &ldquo;Auto-Standortbestimmung&rdquo; aus dem Men&uuml; &ldquo;Optionen&rdquo;
im Fenster &ldquo;B&uuml;cherliste&rdquo; aus. Die automatische Standortbestimmung
ist eingeschaltet, wenn neben &ldquo;Auto-Standortbestimmung&rdquo; ein H&auml;kchen
zu sehen ist.</para>
<para>Beachten Sie, da&szlig; das Standortsymbol nur dann erscheint, wenn
ein Lesefenster ge&ouml;ffnet ist.</para>
</sect2>
<sect2 id="INFOUG.Rdbooks.div.4">
<title id="INFOUG.Rdbooks.mkr.4">Die Verwendung mehrerer Fenster<indexterm>
<primary>Fenster</primary><secondary>feststecken</secondary></indexterm><indexterm>
<primary>Fenster</primary><secondary>mehrere verwenden</secondary></indexterm></title>
<para>Der Informationsmanager erm&ouml;glicht Ihnen die Verwendung von mehr
als einem Lesefenster gleichzeitig. Sie k&ouml;nnen zum Beispiel den Text
eines Fensters festhalten, w&auml;hrend Sie mit dem Lesen von Abschnitten
in einem anderen Fenster fortfahren. Klicken Sie dazu auf den Rei&szlig;nagel
in der Funktionsleiste des Lesefensters. Dadurch wird zwischen dem festgesteckten
und nicht festgesteckten Status hin- und hergeschaltet.</para>
<para>Wenn ein Fenster festgesteckt ist, &ouml;ffnet der Informationsmanager
ein anderes Lesefenster f&uuml;r den n&auml;chsten Abschnitt, auf den Sie
zugreifen. Ist ein Fenster nicht festgesteckt, aktualisiert der Informationsmanager
das aktuelle Fenster mit dem Text des neuen Abschnitts.<indexterm><primary>Drucktaste</primary></indexterm></para>
<para>Wenn sich ein Fenster im festgesteckten Status befindet, erscheint der
Rei&szlig;nagel in aufrechter Position mit einem H&auml;kchen daneben.</para>
<graphic id="INFOUG.Rdbooks.igrph.3" entityref="INFOUG.Rdbooks.fig.3"></graphic>
<note>
<para>Sie k&ouml;nnen auch Fenster mit Suchergebnissen feststecken. Wenn Sie
ein Fenster &ldquo;Suchergebnisse&rdquo; feststecken, ersetzt der Informationsmanager
nicht die Ergebnisse der ersten Suche mit den Ergebnissen sp&auml;terer Suchen.
Stattdessen erscheinen neue Suchergebnisse in separaten Suchergebnisfenstern.
</para>
</note>
<para>W&auml;hlen Sie &ldquo;Eigenschaften&rdquo; im Men&uuml; &ldquo;Optionen&rdquo;
aus, um anzugeben, ob alle neuen Lesefenster standardm&auml;&szlig;ig festgesteckt
oder nicht festgesteckt sein sollen. Denken Sie daran, da&szlig; Sie aus Platzgr&uuml;nden
die Anzahl der Fenster einschr&auml;nken sollten, die gleichzeitig in Verwendung
sind.</para>
<para>Sie finden es vielleicht hilfreich, das Fenster &ldquo;Inhalt&rdquo;
festzustecken, wenn Sie vorhaben, mehreren Verweisen zu folgen.</para>
</sect2>
<sect2 id="INFOUG.Rdbooks.div.5">
<title id="INFOUG.Rdbooks.mkr.5">&Auml;ndern der Gr&ouml;&szlig;e eines Lesefensters<indexterm>
<primary>Fenster</primary><secondary>Lesefenster</secondary><tertiary>&Auml;ndern
der Gr&ouml;&szlig;e</tertiary></indexterm><indexterm><primary>Lesefenster</primary><secondary>&Auml;ndern der Gr&ouml;&szlig;e</secondary></indexterm></title>
<para>Um die Gr&ouml;&szlig;e eines Lesefensters zu &auml;ndern, ziehen und
strecken Sie mit Hilfe der Maus die Grenzen des Fensters, oder verwenden Sie
die Taste f&uuml;r maximale Gr&ouml;&szlig;e in der oberen rechten Ecke des
Fensterrahmens. Die neue Fenstergr&ouml;&szlig;e bleibt f&uuml;r den Rest
dieser Session des Informationsmanagers in Kraft, oder solange, bis Sie sie
&auml;ndern. Wenn Sie die Gr&ouml;&szlig;e eines Lesefensters &auml;ndern,
pa&szlig;t sich der Textflu&szlig; automatisch an die neue Fenstergr&ouml;&szlig;e
an.</para>
<para>Um die Standardgr&ouml;&szlig;e f&uuml;r das Lesefenster einzustellen,
w&auml;hlen Sie &ldquo;Eigenschaften f&uuml;r Durchsuchen&rdquo; im Men&uuml;
&ldquo;Optionen&rdquo; aus und stellen Sie die neue Gr&ouml;&szlig;e f&uuml;r
&ldquo;Anzeigemodul-Geometrie&rdquo; ein. Weitere Informationen &uuml;ber
das Einstellen von Optionen finden Sie unter <!--XRef content: 'Individuelle
Anpassung des Informationsmanagers'--><xref role="JumpText" linkend="INFOUG.Custom.mkr.1">.
</para>
</sect2>
<sect2 id="INFOUG.Rdbooks.div.6">
<title id="INFOUG.Rdbooks.mkr.6">Verdoppelung eines Lesefensters<indexterm>
<primary>Fenster</primary><secondary>Lesefenster</secondary><tertiary>verdoppeln</tertiary></indexterm><indexterm><primary>Lesefenster</primary><secondary>verdoppeln</secondary></indexterm></title>
<para>Sie m&ouml;chten ab und zu vielleicht zwei oder mehrere Teile eines
langen Abschnitts gleichzeitig einsehen. Dies k&ouml;nnen Sie tun, indem Sie
das Lesefenster verdoppeln.</para>
<para>Um ein Lesefenster zu verdoppeln, w&auml;hlen Sie &ldquo;Neues Fenster&rdquo;
im Men&uuml; &ldquo;Anzeigemodul&rdquo; aus. Der Informationsmanager &ouml;ffnet
ein weiteres Lesefenster, in dem derselbe Abschnitt angezeigt wird. Sie k&ouml;nnen
in diesem zweiten Fenster an eine andere Stelle als im ersten Fenster gehen.
</para>
</sect2>
<sect2 id="INFOUG.Rdbooks.div.7">
<title id="INFOUG.Rdbooks.mkr.7">Schlie&szlig;en eines Lesefensters<indexterm>
<primary>Lesefenster</primary><secondary>schlie&szlig;en</secondary></indexterm><indexterm>
<primary>Fenster</primary><secondary>Lesefenster</secondary><tertiary>schlie&szlig;en</tertiary></indexterm></title>
<para>Um ein Lesefenster zu schlie&szlig;en, w&auml;hlen Sie &ldquo;Schlie&szlig;en&rdquo;
im Men&uuml; &ldquo;Anzeigemodul&rdquo; aus. Wenn Sie ein Lesefenster schlie&szlig;en,
beenden Sie nicht gleichzeitig den Informationsmanager.</para>
<para>Um den Informationsmanager zu beenden, w&auml;hlen Sie &ldquo;Beenden&rdquo;
im Men&uuml; &ldquo;Anzeigemodul&rdquo; aus.</para>
</sect2>
</sect1>
<sect1 id="INFOUG.Rdbooks.div.8">
<title id="INFOUG.Rdbooks.mkr.8">Lesen eines Buches der Reihe nach<indexterm>
<primary>navigieren</primary><secondary>der Reihe nach lesen</secondary></indexterm></title>
<para>Der traditionelle Aufbau der B&uuml;cher im Informationsmanager macht
das Umherbewegen in einer Informationsbibliothek zu einer vertrauten Routine.
Sie k&ouml;nnen beim Lesen von B&uuml;chern auf solche Eigenschaften wie Inhaltsverzeichnisse
zur&uuml;ckgreifen. Sie k&ouml;nnen auch nacheinander Abschnitt f&uuml;r Abschnitt
durchgehen.</para>
<para>Um ein Buch der Reihe nach durchzulesen, klicken Sie auf die Tasten
&ldquo;Vorausgehenden Abschnitt durchsuchen&rdquo; und &ldquo;N&auml;chsten
Abschnitt durchsuchen&rdquo; (in der Funktionsleiste des Lesefensters), um
zu fr&uuml;heren oder sp&auml;teren Abschnitten zu gehen.</para>
<graphic id="INFOUG.Rdbooks.igrph.4" entityref="INFOUG.Rdbooks.fig.4"></graphic>
<para>Der Pfeil nach oben bringt Sie zum vorausgehenden Abschnitt. Falls Sie
sich im ersten Abschnitt befinden, ist dieser Pfeil nicht ausw&auml;hlbar.
</para>
<para>Der Pfeil nach unten bringt Sie zum n&auml;chsten Abschnitt. Befinden
Sie sich im letzten Abschnitt, ist dieser Pfeil schw&auml;cher dargestellt.
</para>
<para>F&uuml;r eine Voranzeige des n&auml;chsten oder vorausgehenden Abschnitts
plazieren Sie den Zeiger auf den Pfeil f&uuml;r &ldquo;Vorausgehenden Abschnitt
durchsuchen&rdquo; oder &ldquo;N&auml;chsten Abschnitt durchsuchen&rdquo;.
Klicken und halten Sie dann die Maustaste. Der Informationsmanager zeigt den
Titel des n&auml;chsten oder vorausgehenden Abschnitts im Meldungsbereich
an. Wenn Sie nicht zum angezeigten Abschnitt gehen m&ouml;chten, verschieben
Sie den Zeiger vom Pfeil weg, bevor Sie die Maustaste loslassen.</para>
<para>Sobald Sie sich in einem Abschnitt befinden, k&ouml;nnen Sie sich unter
Verwendung der Bildlaufleiste, der Tasten &ldquo;Vorausgehend<?Pub Caret>e
Seite&rdquo; und &ldquo;N&auml;chste Seite&rdquo; oder der Pfeiltasten nach
oben oder nach unten durch ihn bewegen.</para>
</sect1>
</chapter>
<?Pub *0000016261>
