<!-- $XConsortium: ch03.sgm /main/2 1996/12/17 15:30:20 rws $ -->
<!-- (c) Copyright 1996 Digital Equipment Corporation. -->
<!-- (c) Copyright 1996 Hewlett-Packard Company. -->
<!-- (c) Copyright 1996 International Business Machines Corp. -->
<!-- (c) Copyright 1996 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1996 Novell, Inc. -->
<!-- (c) Copyright 1996 FUJITSU LIMITED. -->
<!-- (c) Copyright 1996 Hitachi. -->
<chapter id="INFOUG.Navigate.div.1">
<title id="INFOUG.Navigate.mkr.1">Navigieren im Informationsmanager</title>
<para>&Uuml;ber die Verwendung der traditionellen Buchstruktur hinaus existieren
andere M&ouml;glichkeiten, mit denen Sie in einer Informationsbibliothek navigieren
k&ouml;nnen. Sie k&ouml;nnen zum Beispiel B&uuml;cher in einer Bibliothek
lesen, indem Sie <firstterm>Verweisen</firstterm> zu verkn&uuml;pften Informationen
folgen. Oder Sie k&ouml;nnen die Eigenschaften Abfolge und Karte zum Auffinden
von Informationen benutzen.</para>
<para>Dieses Kapitel bietet Informationen &uuml;ber:</para>
<itemizedlist>
<listitem><para><xref role="JumpText" linkend="INFOUG.Navigate.div.2"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Navigate.div.3"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Navigate.div.6"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Navigate.div.8"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Navigate.div.11"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Navigate.div.12"></para>
</listitem>
</itemizedlist>
<para>Sie k&ouml;nnen au&szlig;erdem direkt nach Informationen &uuml;ber ein
bestimmtes Element suchen. Lesen Sie <!--Original XRef content: 'Suchen nach
Informationen'--><xref role="JumpText" linkend="INFOUG.Search.mkr.1">, wenn
Sie weitere Informationen &uuml;ber das Initiieren einer Suche, das Formulieren
einer Suchabfrage und die Einschr&auml;nkung des Bereichs Ihrer Suche w&uuml;nschen.
</para>
<sect1 id="INFOUG.Navigate.div.2">
<title id="INFOUG.Navigate.mkr.2">Bestimmen Ihres aktuellen Standortes<indexterm>
<primary>Standortes</primary><secondary>Bestimmen des aktuellen</secondary>
</indexterm></title>
<para>Mit Hilfe von Hypertext-Verweisen k&ouml;nnen Sie schnell und einfach
von einem Abschnitt - oder sogar von einem Buch - zum anderen springen. W&auml;hrend
Sie sich innerhalb eines Buches oder einer ganzen Bibliothek umherbewegen,
ist Ihnen Ihr jeweiliger Standort vielleicht nicht immer klar. Sie k&ouml;nnen
diese jedoch mit Hilfe der folgenden Funktionen leicht identifizieren:</para>
<itemizedlist>
<listitem><para>Lokalisierer. Siehe <xref role="JumpText" linkend="INFOUG.Navigate.mkr.3">.
</para>
</listitem>
<listitem><para>Automatische Standortbestimmung (B&uuml;cherliste). Siehe <xref
role="JumpText" linkend="INFOUG.Rdbooks.div.3">.</para>
</listitem>
<listitem><para>Anzeige des vorausgehenden Abschnitts (Abfolgeliste). Siehe <xref
role="JumpText" linkend="INFOUG.Navigate.mkr.11">.</para>
</listitem>
<listitem><para>Grafikkarte. Siehe <xref role="JumpText" linkend="INFOUG.Navigate.mkr.12">.
</para>
</listitem>
</itemizedlist>
</sect1>
<sect1 id="INFOUG.Navigate.div.3">
<title id="INFOUG.Navigate.mkr.3">Die Verwendung von Lokalisierern<indexterm>
<primary>Lokalisierer</primary><secondary>verwenden</secondary></indexterm></title>
<para>Jedes Buch und jeder Abschnitt in einem Buch hat ein eindeutiges Kennzeichen,
den <firstterm>Lokalisierer</firstterm>. Der Informationsmanager erm&ouml;glicht
Ihnen, Lokalisierer anzuzeigen und dann mit ihrer Hilfe auf die Abschnitte
zuzugreifen, die sie identifizieren.</para>
<sect2 id="INFOUG.Navigate.div.4">
<title id="INFOUG.Navigate.mkr.4">Lokalisierer zeigen<indexterm><primary>Lokalisierer zeigen</primary></indexterm><indexterm><primary>Lokalisierer</primary><secondary>zeigen</secondary></indexterm><indexterm><primary>Position</primary><secondary>Lokalisierer zeigen</secondary></indexterm></title>
<para>Zur Anzeige des Lokalisierers f&uuml;r das Buch und den Abschnitt, das/den
Sie gerade ansehen, w&auml;hlen Sie &ldquo;Lokalisierer zeigen&rdquo; im Men&uuml;
&ldquo;Anzeigemodul&rdquo; aus. Der Informationsmanager zeigt den Lokalisierer
im Meldungsbereich unten im Fenster an.</para>
<para>Um zu einem sp&auml;teren Zeitpunkt zu einem Abschnitt zur&uuml;ckzukehren,
k&ouml;nnen Sie dessen Lokalisierer registrieren und ihn dann im Fenster &ldquo;Lokalisierer
&ouml;ffnen&rdquo; angeben.</para>
</sect2>
<sect2 id="INFOUG.Navigate.div.5">
<title id="INFOUG.Navigate.mkr.5">Zu Lokalisierern gehen<indexterm><primary>Lokalisierer &ouml;ffnen</primary></indexterm><indexterm><primary>Lokalisierer</primary><secondary>&ouml;ffnen</secondary></indexterm><indexterm><primary>Position</primary><secondary>Lokalisierer &ouml;ffnen</secondary></indexterm></title>
<para>Um zu einem Abschnitt zur&uuml;ckzukehren, dessen Lokalisierer Sie zuvor
mit &ldquo;Lokalisierer zeigen&rdquo; identifiziert haben, w&auml;hlen Sie
&ldquo;Lokalisierer &ouml;ffnen&rdquo; im Men&uuml; &ldquo;Gehe zu&rdquo;
aus. Der Informationsmanager zeigt den folgenden Dialog an, in den Sie den
Lokalisierer des Abschnitts eingeben k&ouml;nnen.</para>
<figure>
<title id="INFOUG.Navigate.mkr.5a">Dialog &ldquo;Lokalisierer &ouml;ffnen&rdquo;</title>
<graphic id="INFOUG.Navigate.igrph.1" entityref="INFOUG.Navigate.fig.1"></graphic>
</figure>
<para>Geben Sie den Lokalisierer des Abschnitts an, zu dem Sie gehen m&ouml;chten.
</para>
<para>Klicken Sie auf &ldquo;Anwenden&rdquo;, um zu diesem Abschnitt zu gehen
und den Dialog offen zu lassen; klicken Sie auf &ldquo;OK&rdquo;, um zu dem
Abschnitt zu gehen und den Dialog zu schlie&szlig;en.</para>
</sect2>
</sect1>
<sect1 id="INFOUG.Navigate.div.6">
<title id="INFOUG.Navigate.mkr.6">Verweisen folgen<indexterm><primary>navigieren</primary><secondary>Verweisen folgen</secondary></indexterm><indexterm><primary>Verweise</primary><secondary>folgen</secondary></indexterm></title>
<para>Im Informationsmanager erscheinen Hypertext-Verweise als fetter, unterstrichener
und farbig dargestellter Text. Verweise bieten eine schnelle Methode des &ldquo;Springens&rdquo;
zu</para>
<itemizedlist>
<listitem><para>anderen Teilen des aktuellen Abschnitts.</para>
</listitem>
<listitem><para>anderen Abschnitten im selben Buch.</para>
</listitem>
<listitem><para>anderen B&uuml;chern in der Informationsbibliothek.</para>
</listitem>
</itemizedlist>
<para>Um einem Verweis im Lesefenster zu folgen, plazieren Sie den Zeiger
auf den Verweistext und klicken Sie einmal darauf. Zum Folgen eines Verweises
in einem Listenfenster (wie etwa der Abschnitts-Abfolgeliste) doppelklicken
Sie auf den Verweis.</para>
<para>Wenn Sie einem Verweis von einem nicht festgesteckten Lesefenster aus
folgen, ersetzt der Informationsmanager den aktuellen Abschnitt durch den
neuen. Ist das Lesefenster festgesteckt, &ouml;ffnet der Informationsmanager
ein neues Lesefenster, um den neuen Abschnitt anzuzeigen.</para>
<sect2 id="INFOUG.Navigate.div.7">
<title id="INFOUG.Navigate.mkr.7">Voranzeige von Verweiszielen<indexterm>
<primary>Verweise</primary><secondary>Voranzeige von Zielen</secondary></indexterm><indexterm>
<primary>navigieren</primary><secondary>Voranzeige von Verweiszielen</secondary>
</indexterm></title>
<para>Sie k&ouml;nnen das Ziel eines Verweises im Lesefenster voranzeigen
lassen, bevor Sie entscheiden, ob Sie ihm folgen. So machen Sie den Titel
des Zielabschnitts sichtbar:</para>
<orderedlist>
<listitem><para>Plazieren Sie den Zeiger auf den Verweis.</para>
</listitem>
<listitem><para>Dr&uuml;cken und halten Sie die linke Maustaste. Der Informationsmanager
zeigt das Ziel des Verweises im Meldungsbereich unten im Fenster an.</para>
</listitem>
<listitem><para>Um dem Verweis zu folgen, lassen Sie die Maustaste los. Falls
Sie dem Verweis nicht folgen m&ouml;chten, bewegen Sie den Zeiger vom Verweis
weg, bevor Sie die Maustaste loslassen.</para>
</listitem>
</orderedlist>
</sect2>
</sect1>
<sect1 id="INFOUG.Navigate.div.8">
<title id="INFOUG.Navigate.mkr.8">Zur&uuml;ckverfolgen Ihrer Schritte<indexterm>
<primary>navigieren</primary><secondary>Schritte zur&uuml;ckverfolgen</secondary>
</indexterm></title>
<para>Sie m&ouml;chten vielleicht zu einem Abschnitt zur&uuml;ckkehren, in
dem Sie zu einem fr&uuml;heren Zeitpunkt in Ihrer Anzeigemodul-Session gelesen
haben. So k&ouml;nnen Sie Abschnitte erneut besuchen:</para>
<itemizedlist>
<listitem><para>Mit der Abschnitts-Abfolgeliste. Siehe <xref role="JumpText"
linkend="INFOUG.Navigate.div.9">.</para>
</listitem>
<listitem><para>Mit Abfolge-Pfeilen. Siehe <xref role="JumpText" linkend="INFOUG.Navigate.div.10">.
</para>
</listitem>
</itemizedlist>
<sect2 id="INFOUG.Navigate.div.9">
<title id="INFOUG.Navigate.mkr.9">Verwendung der Abschnitts-Abfolgeliste<indexterm>
<primary>navigieren</primary><secondary>mit der Abschnitts-Abfolgeliste</secondary>
</indexterm><indexterm><primary>Schritte zur&uuml;ckverfolgen</primary><secondary>mit der Abschnitts-Abfolgeliste</secondary></indexterm><indexterm><primary>Abschnitts-Abfolgeliste</primary></indexterm></title>
<para>Der Informationsmanager zeigt eine Aufstellung der Abschnitte an, die
Sie w&auml;hrend der aktuellen Anzeigemodul-Session besucht haben. Sie k&ouml;nnen
schnell ermitteln, welche Abschnitte Sie gelesen haben, wenn Sie die Abschnitts-Abfolgeliste
&ouml;ffnen, die in der folgenden Abbildung dargestellt ist.</para>
<figure>
<title id="INFOUG.Navigate.mkr.9a">Abschnitts-Abfolgeliste</title>
<graphic id="INFOUG.Navigate.igrph.2" entityref="INFOUG.Navigate.fig.2"></graphic>
</figure>
<para>Die Abschnitts-Abfolgeliste enth&auml;lt jeden besuchten Abschnitt vom
letzten bis zum ersten. Auch wenn Sie einen Abschnitt vielleicht mehr als
einmal in einer Session besucht haben, listet der Informationsmanager ihn
nur einmal auf.</para>
<para>So benutzen Sie die Abschnitts-Abfolgeliste:</para>
<orderedlist>
<listitem><para>W&auml;hlen Sie &ldquo;Abfolge&rdquo; im Men&uuml; &ldquo;Gehe
zu&rdquo; des Lesefensters aus. Der Informationsmanager zeigt die Abschnitts-Abfolgeliste
an.</para>
</listitem>
<listitem><para>Um zu einem Abschnitt in der Liste zu gehen, doppelklicken
Sie auf den Titel des Abschnitts oder heben Sie ihn hervor und klicken Sie
auf &ldquo;Anzeigen&rdquo;. Wenn das Lesefenster nicht festgesteckt ist, ersetzt
der Informationsmanager den aktuellen Abschnitt durch den neuen. Ist das Lesefenster
festgesteckt, &ouml;ffnet der Informationsmanager ein weiteres Lesefenster,
um den neuen Abschnitt anzuzeigen.</para>
</listitem>
</orderedlist>
<para>Wenn Sie die Abschnitts-Abfolgeliste schlie&szlig;en m&ouml;chten, ohne
zu einem zuvor gelesenen Abschnitt zu gehen, klicken Sie auf &ldquo;Schlie&szlig;en&rdquo;.
</para>
</sect2>
<sect2 id="INFOUG.Navigate.div.10">
<title id="INFOUG.Navigate.mkr.10">Die Verwendung von Abfolge-Pfeilen<indexterm>
<primary>Pfeile</primary><secondary>Abfolge</secondary></indexterm><indexterm>
<primary>Abfolge-Pfeile</primary></indexterm><indexterm><primary>navigieren</primary><secondary>mit Abfolge-Pfeilen</secondary></indexterm><indexterm>
<primary>Schritte zur&uuml;ckverfolgen</primary><secondary>mit Abfolge-Pfeilen</secondary></indexterm></title>
<para>Sie m&ouml;chten die Folge von zuvor gelesenen Abschnitten m&ouml;glicherweise
entweder r&uuml;ckw&auml;rts oder vorw&auml;rts durchgehen. Mit den Abfolge-Pfeilen
des Lesefensters k&ouml;nnen Sie sich durch die schon gelesenen Abschnitte
bewegen, und zwar in der Reihenfolge, in der Sie sie gelesen haben. Die Abfolge-Pfeile
erscheinen am Anfang der Funktionsleiste des Lesefensters, links von den Durchsuch-Pfeilen.
</para>
<graphic id="INFOUG.Navigate.igrph.3" entityref="INFOUG.Navigate.fig.3"></graphic>
<note>
<para>Mit den Optionen &ldquo;Zur&uuml;ck&rdquo; und &ldquo;Vorw&auml;rts&rdquo;
im Men&uuml; &ldquo;Gehe zu&rdquo; k&ouml;nnen Sie dieselben Aufgaben ausf&uuml;hren.
</para>
</note>
<para>Wenn Sie denselben Abschnitt mehr als einmal in Ihrer Anzeigemodul-Session
besucht haben, vollziehen die Abfolge-Pfeile das nach.</para>
<para>Der linke Abfolgepfeil f&uuml;hrt Sie r&uuml;ckw&auml;rts durch die
Abschnittsliste; der rechte Abfolgepfeil vorw&auml;rts.</para>
<para>Falls Sie am Anfang oder am Ende der Abschnittsliste positioniert sind,
wird der linke bzw. rechte Abfolgepfeil unausw&auml;hlbar, was bedeutet, da&szlig;
Sie in dieser Richtung nicht mehr weitergehen k&ouml;nnen.</para>
</sect2>
</sect1>
<sect1 id="INFOUG.Navigate.div.11">
<title id="INFOUG.Navigate.mkr.11">Ansehen vorheriger Abschnitte<indexterm>
<primary>navigieren</primary><secondary>mit der Abschnittstiteltaste</secondary>
</indexterm><indexterm><primary>Schritte zur&uuml;ckverfolgen</primary><secondary>mit der Abschnittstiteltaste</secondary></indexterm><indexterm><primary>Abschnitt</primary><secondary>vorherigen ansehen</secondary></indexterm><indexterm>
<primary>vorherige Abschnitte</primary><secondary>ansehen</secondary></indexterm><indexterm>
<primary>Abschnittstiteltaste</primary></indexterm></title>
<para>Sie w&uuml;nschen vielleicht allgemeinere Informationen, als im aktuellen
Abschnitt pr&auml;sentiert werden, oder eine bessere Perspektive, auf welcher
Informationsebene Sie gerade lesen. Mit anderen Worten, Sie m&ouml;chten eine
Liste der Abschnitte ansehen, die dem aktuellen Abschnitt in der Struktur
des Buches vorangehen.</para>
<para>Wenn Sie eine Liste der vorherigen Abschnitte sehen m&ouml;chten, klicken
Sie auf die Abschnittstiteltaste direkt oberhalb des Ansichtsbereichs.</para>
<graphic id="INFOUG.Navigate.igrph.4" entityref="INFOUG.Navigate.fig.4"></graphic>
<para>Der Informationsmanager zeigt die Liste von Abschnittstiteln an.</para>
<para>Sie k&ouml;nnen in dieser Liste ganz bis zum Namen der Bibliothek zur&uuml;ckgehen,
die das Buch enth&auml;lt, in dem sich der Abschnitt befindet.</para>
<note>
<para>Die oberen beiden Elemente in der Liste repr&auml;sentieren das B&uuml;cherregal
und die Informationsbibliothek. Diese k&ouml;nnen nicht ausgew&auml;hlt werden,
da sie keinen bestimmten Abschnitt identifizieren.</para>
</note>
<para>Sie gehen zu einem beliebigen Abschnitt in der Liste, indem Sie auf
dessen Titel klicken. Falls das Lesefenster nicht festgesteckt ist, ersetzt
der Informationsmanager den aktuellen Abschnitt durch den neuen. Ist das Lesefenster
festgesteckt, &ouml;ffnet der Informationsmanager ein weiteres Lesefenster,
um den neuen Abschnitt anzuzeigen.</para>
<para>Um die Abschnittsliste zu schlie&szlig;en, ohne zu einem anderen Abschnitt
zu gehen, klicken Sie nochmals auf die Abschnittstiteltaste.</para>
</sect1>
<sect1 id="INFOUG.Navigate.div.12">
<title id="INFOUG.Navigate.mkr.12">Navigieren mit der Grafikkarte<indexterm>
<primary>Karte</primary><secondary>navigieren mit</secondary></indexterm><indexterm>
<primary>Grafikkarte</primary></indexterm><indexterm><primary>navigieren</primary>
<secondary>mit Grafikkarte</secondary></indexterm></title>
<para>Wenn Sie sich &uuml;ber den Aufbau eines Buches orientieren m&ouml;chten,
k&ouml;nnen Sie eine Grafikkarte seiner Abschnitte anzeigen. Bei der Karte
handelt es sich um einen grafischen &ldquo;Baum&rdquo;, der die Titel der
Buchabschnitte anzeigt. Die Karte erleichtert die &Uuml;bersicht &uuml;ber
den Aufbau des Buches.</para>
<figure>
<title id="INFOUG.Navigate.mkr.12a">Grafikkarte</title>
<graphic id="INFOUG.Navigate.igrph.5" entityref="INFOUG.Navigate.fig.5"></graphic>
</figure>
<sect2 id="INFOUG.Navigate.div.13">
<title id="INFOUG.Navigate.mkr.13">&Ouml;ffnen der Karte<indexterm><primary>Grafikkarte</primary><secondary>&ouml;ffnen</secondary></indexterm></title>
<para>Um die Karte aufzurufen, klicken Sie auf die Taste &ldquo;Grafikkarte&rdquo;
in der Funktionsleiste des Lesefensters, oder w&auml;hlen Sie &ldquo;Grafikkarte&rdquo;
aus dem Men&uuml; &ldquo;Fenster&rdquo; aus.</para>
<graphic id="INFOUG.Navigate.igrph.6" entityref="INFOUG.Navigate.fig.6"></graphic>
<para>Der Informationsmanager &ouml;ffnet die Grafikkarte, die den Titel des
aktuellen Abschnitts und die Titel der anderen Abschnitte im Buch zeigt.</para>
</sect2>
<sect2 id="INFOUG.Navigate.div.14">
<title id="INFOUG.Navigate.mkr.14">Karte verschieben<indexterm><primary>Grafikkarte</primary><secondary>verschieben</secondary></indexterm></title>
<para>Um Titel von Abschnitten sichtbar zu machen, die derzeit nicht auf dem
Bildschirm erscheinen, k&ouml;nnen Sie die Karte verschieben. Diese M&ouml;glichkeit
ist sinnvoll, da Karten normalerweise zu gro&szlig; sind, um in ihrer Gesamtheit
angezeigt werden zu k&ouml;nnen.</para>
<para>Die Grafikkarte enth&auml;lt einen <firstterm>Steuerkn&uuml;ppel</firstterm>
in der oberen linken Ecke, mit dem Sie ausw&auml;hlen k&ouml;nnen, welcher
Teil der Karte angezeigt werden soll.</para>
<para>So verschieben Sie eine Karte:</para>
<orderedlist>
<listitem><para>Plazieren Sie den Zeiger auf den Steuerkn&uuml;ppel in der
Karte mit dem lokalen Abschnitt.</para>
</listitem>
<listitem><para>Dr&uuml;cken und halten Sie die linke Maustaste.</para>
</listitem>
<listitem><para>Ziehen Sie die Maus, bis der gew&uuml;nschte Kartenausschnitt
angezeigt wird. Sie verschieben zum Beispiel den Steuerkn&uuml;ppel nach rechts,
um Titel zu sehen, die hinter der rechten Begrenzung der Karte verborgen sind.
</para>
</listitem>
</orderedlist>
<note>
<para>Wenn Sie es vorziehen, k&ouml;nnen Sie auch die Gr&ouml;&szlig;e der
gesamten Grafikkarte durch &Auml;nderung der Fenstergr&ouml;&szlig;e modifizieren.
</para>
</note>
</sect2>
<sect2 id="INFOUG.Navigate.div.15">
<title id="INFOUG.Navigate.mkr.15">Von der Karte zu einem Abschnitt gehen<indexterm>
<primary>Grafikkarte</primary><secondary>zu einem Abschnitt gehen</secondary>
</indexterm></title>
<para>Um einen auf der Grafikkarte gezeigten Abschnitt anzusehen, klicken
Sie auf den Titel des Abschnitts. Falls das Lesefenster nicht festgesteckt
ist, ersetzt der Informationsmanager den aktuellen Abschnitt durch den neuen.
Ist das Lesefenster festgesteckt, &ouml;ffnet der Informationsmanager ein
anderes Lesefenster, um den neuen Abschnitt anzuzeigen.</para>
</sect2>
<sect2 id="INFOUG.Navigate.div.16">
<title id="INFOUG.Navigate.mkr.16">Aktualisieren der Grafikkarte<indexterm>
<primary>Karte</primary><secondary>aktualisieren</secondary></indexterm></title>
<para>Wenn Sie die Grafikkarte aktualisieren m&ouml;chten, soda&szlig; sie
Ihren derzeitigen Standort in einem Buch zeigt, klicken Sie auf die Taste
&ldquo;Automatische Aktualisierung&rdquo; oben rechts im Fenster &ldquo;Grafikkarte&rdquo;.
Wenn Sie w&uuml;nschen, da&szlig; die Grafikkarte jedesmal automatisch Ihren
Standort anzeigt, wenn Sie sich durch ein Buch bewegen, w&auml;hlen Sie &ldquo;Eigenschaften
f&uuml;r Karte&rdquo; im Men&uuml; &ldquo;Optionen&rdquo; aus und schalte<?Pub Caret>n
Sie &ldquo;Automatische Aktualisierung&rdquo; auf &ldquo;ein&rdquo;.</para>
</sect2>
</sect1>
</chapter>
<?Pub *0000022292>
