<!-- $XConsortium: ch04.sgm /main/2 1996/12/17 15:30:29 rws $ -->
<!-- (c) Copyright 1996 Digital Equipment Corporation. -->
<!-- (c) Copyright 1996 Hewlett-Packard Company. -->
<!-- (c) Copyright 1996 International Business Machines Corp. -->
<!-- (c) Copyright 1996 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1996 Novell, Inc. -->
<!-- (c) Copyright 1996 FUJITSU LIMITED. -->
<!-- (c) Copyright 1996 Hitachi. -->
<chapter id="INFOUG.Search.div.1">
<title id="INFOUG.Search.mkr.1">Nach Informationen Suchen</title>
<para>Wenn Sie bestimmte Informationen ben&ouml;tigen, geht es schneller,
gezielt danach zu suchen, als einfach herumzust&ouml;bern. Der Informationsmanager
bietet einen vollst&auml;ndigen Satz von Suchfunktionen, mit denen Sie folgende
Aufgaben durchf&uuml;hren k&ouml;nnen:</para>
<itemizedlist>
<listitem><para>Schnelles Suchen unter Verwendung einfacher Suchkriterien.
Siehe <xref role="JumpText" linkend="INFOUG.Search.div.2">.</para>
</listitem>
<listitem><para>Detailliertes Suchen mit Hilfe des Abfrage-Editors. Siehe <xref
role="JumpText" linkend="INFOUG.Search.div.5">.</para>
</listitem>
<listitem><para>Definition eines Suchbereichs, um nur einen einzelnen Abschnitt
oder bestimmte B&uuml;cher bzw. Informationstypen abzusuchen. Siehe <xref
role="JumpText" linkend="INFOUG.Search.div.10">.</para>
</listitem>
<listitem><para>Ansicht von Suchergebnissen und Lesen von Abschnitten, die
gefundene Suchbegriffe enthalten. Siehe <xref role="JumpText" linkend="INFOUG.Search.div.22">.
</para>
</listitem>
</itemizedlist>
<note>
<para>Um die Gr&ouml;&szlig;e der zu durchsuchenden Datenbank auf ein Minimum
zu beschr&auml;nken sucht der Informationsmanger nicht nach vielen algemeingebr&auml;uchlichen
W&ouml;rtern wie und, aber, oder, der, die das.</para>
</note>
<!--These have to be completely rearranged for German! I gave up looking up
all possible meanings of a word about half way through and just added "etc."
if there was more than one or two meanings to a word!-->
<sect1 id="INFOUG.Search.div.2">
<title id="INFOUG.Search.mkr.2">Schnelles Suchen<indexterm><primary>Suchen</primary><secondary>Schnellmethode</secondary></indexterm><indexterm><primary>Schnelle Suche</primary></indexterm></title>
<para>Um schnell nach einem einfachen Wort oder Begriff zu suchen, benutzen
Sie das Schnellsuch-Feld unten im Lesefenster. Sie k&ouml;nnen Suchtext manuell
eingeben oder dadurch, da&szlig; Sie existierenden Text hervorheben und dann
die Option &ldquo;Textwahl&rdquo; im Men&uuml; &ldquo;Suchen&rdquo; ausw&auml;hlen<!--???
Letztes bezieht sich nicht auf Suchtext, sondern auf einen Suchbereich!-->.
</para>
<figure>
<title id="INFOUG.Search.mkr.2a">Schnellsuch-Feld</title>
<graphic id="INFOUG.Search.igrph.1" entityref="INFOUG.Search.fig.1"></graphic>
</figure>
<sect2 id="INFOUG.Search.div.3">
<title id="INFOUG.Search.mkr.3">Starten einer Schnellsuche<indexterm><primary>Schnellsuche</primary><secondary>starten</secondary></indexterm><indexterm>
<primary>Suche</primary><secondary>schnell, starten</secondary></indexterm></title>
<para>So starten Sie eine Suche vom Schnellsuch-Feld aus:</para>
<orderedlist>
<listitem><para>Plazieren Sie den Zeiger im Schnellsuch-Feld und l&ouml;schen
Sie den existierenden Text, falls vorhanden.</para>
</listitem>
<listitem><para>Geben Sie den Suchtext ein.</para>
<para>Wenn Sie den Zeiger im Schnellsuch-Feld plazieren, identifiziert die
Taste &ldquo;Suchbereich&rdquo; links im Feld den Bereich, der f&uuml;r die
Suche ber&uuml;cksichtigt werden soll. Falls Sie den gezeigten Bereich verwenden
m&ouml;chten, &uuml;berschlagen Sie die Schritte 3 und 4. Informationen &uuml;ber
Suchbereiche finden Sie unter <xref role="JumpText" linkend="INFOUG.Search.mkr.10">.
</para>
</listitem>
<listitem><para>Klicken Sie auf die Taste &ldquo;Suchbereich&rdquo;. Der Informationsmanager
zeigt eine Liste verf&uuml;gbarer Suchbereiche an.</para>
<figure>
<title id="INFOUG.Search.mkr.3a">Suchbereich-Liste</title>
<graphic id="INFOUG.Search.igrph.2" entityref="INFOUG.Search.fig.2"></graphic>
</figure>
</listitem>
<listitem><para>Klicken Sie auf den Bereich, in dem gesucht werden soll.</para>
</listitem>
<listitem><para>Dr&uuml;cken Sie auf die Eingabetaste, um mit der Suche zu
beginnen.</para>
<para>Der Informationsmanager zeigt gefundene Suchbegriffe im Fenster &ldquo;Suchergebnisse&rdquo;an.
Um zu einem Abschnitt zu springen, der einen gefundenen Suchbegriff enth&auml;lt,
doppelklicken Sie im Fenster &ldquo;Suchergebnisse&rdquo; auf den Titel des
Abschnitts.</para>
</listitem>
</orderedlist>
<para>Wenn Sie detailliertere Suchkriterien erstellen m&ouml;chten, k&ouml;nnen
Sie den Abfrage-Editor benutzen.</para>
</sect2>
<sect2 id="INFOUG.Search.div.4">
<title id="INFOUG.Search.mkr.4">Suchen mit Textwahl<indexterm><primary>Schnellsuche</primary><secondary>an ausgew&auml;hltem Text</secondary></indexterm><indexterm>
<primary>An Auswahl</primary></indexterm></title>
<para>So f&uuml;hren Sie eine Schnellsuche unter Verwendung von hervorgehobenem
Text durch:</para>
<orderedlist>
<listitem><para>Heben Sie den Text hervor, mit dem Sie suchen m&ouml;chten.
(Plazieren Sie den Zeiger am Anfang des Textes. Halten Sie die Maustaste 1
heruntergedr&uuml;ckt und ziehen Sie den Zeiger an das Textende.)</para>
<note>
<para>Der hervorgehobene Text mu&szlig; nicht unbedingt im Lesefenster sein.
Er kann sich in jedem beliebigen Fenster Ihres Systems befinden.</para>
</note>
</listitem>
<listitem><para>W&auml;hlen Sie &ldquo;Textwahl&rdquo; im Men&uuml; &ldquo;Suchen&rdquo;
des Lesefensters aus.</para>
<para>Der Informationsmanager zeigt den hervorgehobenen Text im Schnellsuch-Feld
an und beginnt die Suche.</para>
</listitem>
</orderedlist>
</sect2>
</sect1>
<sect1 id="INFOUG.Search.div.5">
<title id="INFOUG.Search.mkr.5">Definieren detaillierter Suchen<indexterm>
<primary>Suche</primary><secondary>detaillierte Methode</secondary></indexterm></title>
<para>Mit detaillierten Abfragen k&ouml;nnen Sie pr&auml;zisere Suchergebnisse
erzielen. F&uuml;r die Definition einer detaillierten Abfrage benutzen Sie
den Abfrage-Editor zur:</para>
<itemizedlist>
<listitem><para>Eingabe einer detaillierten Suchabfrage. Siehe <xref role="JumpText"
linkend="INFOUG.Search.div.6">.</para>
</listitem>
<listitem><para>Angabe des Abfrage-Pr&auml;fix. Siehe <xref role="JumpText"
linkend="INFOUG.Search.div.7">.</para>
</listitem>
<listitem><para>Definition von Beziehungen in der Abfrage. Siehe <xref role="JumpText"
linkend="INFOUG.Search.div.8">.</para>
</listitem>
</itemizedlist>
<para>Sie k&ouml;nnen im Abfrage-Editor ebenfalls den Suchbereich einstellen.
Weitere Informationen finden Sie unter <xref role="JumpText" linkend="INFOUG.Search.mkr.10">.
</para>
<sect2 id="INFOUG.Search.div.6">
<title id="INFOUG.Search.mkr.6">Eingabe einer detaillierten Suchabfrage<indexterm>
<primary>Suche</primary><secondary>Abfragen eingeben</secondary></indexterm></title>
<para>So geben Sie eine detaillierte Suchabfrage ein:</para>
<orderedlist>
<listitem><para>&Ouml;ffnen Sie den Abfrage-Editor, indem Sie &ldquo;Abfrage-Editor&rdquo;
im Men&uuml; &ldquo;Suchen&rdquo; eines Lesefensters ausw&auml;hlen. Der Informationsmanager
zeigt das Fenster &ldquo;Abfrage-Editor&rdquo; an.</para>
<figure>
<title id="INFOUG.Search.mkr.6a">Fenster &ldquo;Abfrage-Editor&rdquo;</title>
<graphic id="INFOUG.Search.igrph.3" entityref="INFOUG.Search.fig.3"></graphic>
</figure>
</listitem>
<listitem><para>Klicken Sie auf die Taste &ldquo;Pr&auml;fix&rdquo;. Der Abfrage-Editor
zeigt die Pr&auml;fix-Liste an. Klicken Sie auf das Pr&auml;fix, das f&uuml;r
die Abfrage verwendet werden soll: &ldquo;Treffer&rdquo;, &ldquo;Keine Treffer&rdquo;,
&ldquo;Beginnt mit&rdquo; oder &ldquo;Beginnt nicht mit&rdquo;.</para>
</listitem>
<listitem><para>Geben Sie den ersten Suchbegriff in das Eingabefeld rechts
neben der Taste &ldquo;Pr&auml;fix&rdquo; ein.</para>
</listitem>
<listitem><para>Wenn Sie einen anderen Begriff in die Suche einbeziehen m&ouml;chten,
klicken Sie auf die Taste &ldquo;Konnektor&rdquo; rechts im Eingabefeld. Der
Abfrage-Editor zeigt die Konnektor-Liste an. W&auml;hlen Sie den Konnektor
aus, der f&uuml;r die Abfrage benutzt werden soll: &ldquo;Oder&rdquo; oder
&ldquo;Und&rdquo;. Wiederholen Sie die Schritte 2 bis 4, bis die Abfrage beendet
ist.</para>
</listitem>
<listitem><para>Dr&uuml;cken Sie die Eingabetaste oder klicken Sie auf die
Taste &ldquo;Suchen&rdquo;, um mit der Suche zu beginnen. Der Informationsmanager
zeigt gefundene Suchbegriffe im Fenster &ldquo;Suchergebnisse&rdquo; an. Die
Abbildung <xref role="JumpText" linkend="INFOUG.Search.mkr.22a"> zeigt ein
typisches Suchergebnisfenster.</para>
</listitem>
</orderedlist>
<para>W&auml;hrend Sie Ihre Abfrage erstellen, zeigt der Abfrage-Editor den
Verlauf ihrer Definition im Abfrage-Anzeigebereich unten im Fenster an. Die
Definition der Abfrage zeigt, wie Sie sie in ein Schnellsuch-Feld eingeben
w&uuml;rden.</para>
</sect2>
<sect2 id="INFOUG.Search.div.7">
<title id="INFOUG.Search.mkr.7">Angabe des Abfrage-Pr&auml;fix<indexterm>
<primary>Abfrage</primary><secondary>Pr&auml;fix angeben</secondary></indexterm><indexterm>
<primary>Pr&auml;fix</primary><secondary>f&uuml;r Abfragen</secondary></indexterm></title>
<para>Zu Beginn einer Abfrage geben Sie mit der Taste &ldquo;Pr&auml;fix&rdquo;
an, ob es f &uuml;r Ihre Abfrage, die den Text, den Sie im Eingabefeld &ldquo;Suchen&rdquo;
eingeben, &ldquo;Treffer&rdquo; oder &ldquo;Keine Treffer&rdquo; enth&auml;lt,
damit beginnt (&ldquo;Beginnt mit&rdquo;) oder nicht (&ldquo;Beginnt nicht
mit&rdquo;). Dazu:</para>
<orderedlist>
<listitem><para>Klicken Sie auf die Taste &ldquo;Pr&auml;fix&rdquo;. Der Abfrage-Editor
zeigt die Pr&auml;fix-Liste an.</para>
</listitem>
<listitem><para>Klicken Sie auf das Pr&auml;fix, das f&uuml;r Ihre Abfrage
benutzt werden soll:</para>
<variablelist>
<varlistentry><term>Treffer</term>
<listitem>
<para>Sucht nach Abschnitten, die den Suchtext enthalten.</para>
</listitem>
</varlistentry>
<varlistentry><term>Keine Treffer</term>
<listitem>
<para>Sucht nach Abschnitten, die den Suchtext nicht enthalten.</para>
</listitem>
</varlistentry>
<varlistentry><term>Beginnt mit</term>
<listitem>
<para>Sucht nach Abschnitten, die W&ouml;rter enthalten, die mit dem Suchtext
beginnen.</para>
</listitem>
</varlistentry>
<varlistentry><term>Beginnt nicht mit</term>
<listitem>
<para>Sucht nach Abschnitten, die keine W&ouml;rter enthalten, die mit dem
Suchtext beginnen.</para>
</listitem>
</varlistentry>
</variablelist>
</listitem>
</orderedlist>
<para>Nachdem Sie das Pr&auml;fix ausgew&auml;hlt haben, zeigt der Abfrage-Editor
es auf der Taste &ldquo;Pr&auml;fix&rdquo; an. Sie k&ouml;nnen jetzt den Rest
Ihrer Abfrage eingeben.</para>
</sect2>
<sect2 id="INFOUG.Search.div.8">
<title id="INFOUG.Search.mkr.8">Definition von Beziehungen in der Abfrage<indexterm>
<primary>Abfrage</primary><secondary>Beziehungen definieren</secondary></indexterm><indexterm>
<primary>Beziehungen</primary><secondary>in Abfrage definieren</secondary>
</indexterm></title>
<para>Der Abfrage-Editor erlaubt Ihnen, mehr als ein Wort oder einen Begriff
in eine Suche einzubeziehen. Zur Angabe einer Beziehung zwischen Teilen einer
Abfrage zeigen Sie mit der Taste &ldquo;Konnektor&rdquo; (rechts im Eingabefeld)
die Konnektor-Liste an. Aus dieser Liste k&ouml;nnen Sie die gew&uuml;nschte
Beziehung ausw&auml;hlen. Sie k&ouml;nnen angeben, da&szlig; sowohl der aktuelle
Teil der Abfrage als auch der n&auml;chste Teil vorkommen mu&szlig;, oder
da&szlig; nur ein Teil vorkommen mu&szlig;. Mit anderen Worten definiert eine
Beziehung eine Bedingung f&uuml;r eine g&uuml;ltige &Uuml;bereinstimmung.
</para>
<para>So definieren Sie eine Beziehung:</para>
<orderedlist>
<listitem><para>Geben Sie das Pr&auml;fix und den Suchtext f&uuml;r den ersten
Teil der Abfrage an.</para>
</listitem>
<listitem><para>Klicken Sie auf die Taste &ldquo;Konnektor&rdquo;. Der Abfrage-Editor
zeigt die Konnektor-Liste an.</para>
</listitem>
<listitem><para>Klicken Sie auf den Konnektor f&uuml;r die Beziehung, die
Sie definieren m&ouml;chten:</para>
<variablelist>
<varlistentry><term>Oder</term>
<listitem>
<para>Sucht nach Abschnitten, die eine &Uuml;bereinstimmung f&uuml;r den aktuellen
Teil der Abfrage ODER den n&auml;chsten Teil der Abfrage - oder beide - enthalten.
</para>
</listitem>
</varlistentry>
<varlistentry><term>Und</term>
<listitem>
<para>Sucht nach Abschnitten, die eine &Uuml;bereinstimmung f&uuml;r den aktuellen
Teil der Abfrage UND den n&auml;chsten Teil der Abfrage enthalten.</para>
</listitem>
</varlistentry>
</variablelist>
</listitem>
</orderedlist>
<para>Nachdem Sie einen Konnektor ausgew&auml;hlt haben, zeigt der Abfrage-Editor
diesen auf der Taste &ldquo;Konnektor&rdquo; an und beginnt mit der n&auml;chsten
Zeile der Abfrage.</para>
</sect2>
</sect1>
<sect1 id="INFOUG.Search.div.10">
<title id="INFOUG.Search.mkr.10">Definition des Suchbereichs<indexterm><primary>Suchen</primary><secondary>Bereich definieren</secondary></indexterm><indexterm>
<primary>Bereich</primary><secondary>definieren</secondary></indexterm></title>
<para>Mit Bereichen k&ouml;nnen Sie Ihre Suchen eingrenzen. Sie reduzieren
die Gr&ouml;&szlig;e von Suchergebnis-Listen, indem Sie diese auf sinnvollere
&Uuml;bereinstimmungen beschr&auml;nken. Insbesondere k&ouml;nnen Sie mit <firstterm>
Suchbereichen</firstterm> die B&uuml;cher und Informationstypen (wie zum Beispiel
Tabellen) einschr&auml;nken, die durchsucht werden sollen.</para>
<para>Der Informationsmanager stellt Bereiche zum Durchsuchen des aktuellen
Abschnitts, der gesamten Informationsbibliothek oder eines bestimmten B&uuml;cherregals
zur Verf&uuml;gung. Diese vordefinierten Suchbereiche enthalten alle Informationstypen
einschlie&szlig;lich Titeln, Hauptteiltext, Beispielen, Indizes, Tabellen
und Grafiken. Sie k&ouml;nnen dar&uuml;berhinaus anpa&szlig;bare Suchbereiche
erstellen und darin die B&uuml;cher und Informationstypen angeben, die Sie
gew&ouml;hnlich in Suchen einbeziehen.</para>
<para>Der Rest dieses Abschnitts bietet Informationen &uuml;ber:</para>
<itemizedlist>
<listitem><para><xref role="JumpText" linkend="INFOUG.Search.div.13"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Search.div.16"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Search.div.19"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Search.div.20"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Search.div.21"></para>
</listitem>
</itemizedlist>
<sect2 id="INFOUG.Search.div.13">
<title id="INFOUG.Search.mkr.13">Auswahl eines Suchbereichs<indexterm><primary>Suche</primary><secondary>Bereiche ausw&auml;hlen</secondary></indexterm><indexterm>
<primary>Bereich</primary><secondary>ausw&auml;hlen</secondary></indexterm></title>
<para>Wenn Sie mit einer Suche beginnen, wird standardm&auml;&szlig;ig der
von hier zuletzt definierte Bereich benutzt Das Lesefenster und der Abfrage-Editor
behalten ihre eigenen Standard-Suchbereiche.</para>
<para>Wenn Sie zum Beispiel eine Suche vom Lesefenster aus starten, benutzt
der Informationsmanager den Suchbereich, den Sie zuletzt verwendet haben.
Falls Sie w&auml;hrend dieser Anzeigemodul-Session noch keine Suche durchgef&uuml;hrt
haben, benutzt der Informationsmanager den aktuellen Abschnitt als Bereich
f&uuml;r Suchen vom Lesefenster aus. Er verwendet &ldquo;Alle Bibliotheken&rdquo;
als Standardbereich f&uuml;r Suchen vom Abfrage-Editor aus.</para>
<para>Sie k&ouml;nnen mit der Taste &ldquo;Suchbereich&rdquo; unten im Lesefenster
oder mit der Taste &ldquo;Bereichsname&rdquo; im Abfrage-Editor einen anderen
Suchbereich ausw&auml;hlen.</para>
<sect3 id="INFOUG.Search.div.14">
<title id="INFOUG.Search.mkr.14">Auswahl eines Bereichs im Lesefenster</title>
<para>Sie k&ouml;nnen mit der Taste &ldquo;Suchbereich&rdquo; bestimmen, welche
B&uuml;cher in Suchen einbezogen werden sollen, die Sie vom Schnellsuch-Feld
aus starten. So definieren Sie einen anderen Suchbereich als den angezeigten:
</para>
<orderedlist>
<listitem><para>Klicken Sie auf die Taste &ldquo;Suchbereich&rdquo; links
im Schnellsuch-Feld. Der Informationsmanager zeigt die Suchbereich-Liste an.
Diese Liste enth&auml;lt die vordefinierten und alle Bereiche, die Sie erstellt
und mit dem Bereich-Editor gespeichert haben.</para>
</listitem>
<listitem><para>W&auml;hlen Sie den zu verwendenden Suchbereich aus. Der Informationsmanager
ersetzt auf der Taste &ldquo;Suchbereich&rdquo; den vorherigen Bereichsnamen
durch den neuen. Der neue Bereich bleibt f&uuml;r den Rest der Session in
Kraft, bis Sie ihn &auml;ndern.</para>
</listitem>
</orderedlist>
</sect3>
<sect3 id="INFOUG.Search.div.15">
<title id="INFOUG.Search.mkr.15">Auswahl eines Bereichs im Abfrage-Editor</title>
<para>Sie k&ouml;nnen mit der Taste &ldquo;Bereichsname&rdquo; bestimmen,
welche B&uuml;cher in Suchen einbezogen werden sollen, die Sie mit dem Abfrage-Editor
starten. So definieren Sie einen anderen Suchbereich als den angezeigten:
</para>
<orderedlist>
<listitem><para>Klicken Sie auf die Taste &ldquo;Bereichsname&rdquo;. Eine
Liste zeigt die Namen der verf&uuml;gbaren Suchbereiche an. Diese Liste enth&auml;lt
sowohl vordefinierte als auch erstellte Bereiche.</para>
</listitem>
<listitem><para>W&auml;hlen Sie den Namen des zu verwendenden Bereichs aus
der Bereichsnamen-Liste aus.</para>
</listitem>
</orderedlist>
</sect3>
</sect2>
<sect2 id="INFOUG.Search.div.16">
<title id="INFOUG.Search.mkr.16">Erstellen von Suchbereichen<indexterm><primary>Suche</primary><secondary>Bereiche erstellen</secondary></indexterm><indexterm>
<primary>Bereich</primary><secondary>erstellen</secondary></indexterm></title>
<para>Wenn Sie h&auml;ufig einen Teil der Informationsbibliothek nach bestimmten
Informationen durchsuchen, w&auml;re es vielleicht sinnvoll, einen festen
Suchbereich zu erstellen und zu speichern. Sie erstellen oder &auml;ndern
Suchbereiche mit dem Bereich-Editor.<indexterm><primary>Bereich-Editor</primary>
</indexterm></para>
<sect3 id="INFOUG.Search.div.17">
<title id="INFOUG.Search.mkr.17">&Ouml;ffnen des Suchbereich-Editors<indexterm>
<primary>Suchen</primary><secondary>Bereich-Editor</secondary></indexterm><indexterm>
<primary>Bereich-Editor</primary><secondary>&ouml;ffnen</secondary></indexterm><indexterm>
<primary>Bereich</primary><secondary>Editor &ouml;ffnen f&uuml;r</secondary>
</indexterm></title>
<para>Um den Suchbereich-Editor vom Abfrage-Editor aus zu &ouml;ffnen, klicken
Sie auf die Taste &ldquo;Suchbereich-Editor&rdquo; unten im Fenster &ldquo;Abfrage-Editor&rdquo;.
</para>
<para>Um den Suchbereich-Editor vom Lesefenster aus zu &ouml;ffnen, klicken
Sie auf die Taste &ldquo;Suchbereich-Editor&rdquo; in der unteren rechten
Ecke des Fensters, oder w&auml;hlen Sie &ldquo;Suchbereich-Editor&rdquo; im
Men&uuml; &ldquo;Suchen&rdquo; aus.</para>
<para>Der Informationsmanager zeigt den Suchbereich-Editor an, der in der
folgenden Abbildung zu sehen ist.</para>
<figure>
<title id="INFOUG.Search.mkr.16a">Fenster &ldquo;Suchbereich-Editor&rdquo;</title>
<graphic id="INFOUG.Search.igrph.4" entityref="INFOUG.Search.fig.4"></graphic>
</figure>
</sect3>
<sect3 id="INFOUG.Search.div.18">
<title id="INFOUG.Search.mkr.18">Erstellen eines neuen Suchbereichs<indexterm>
<primary>Bereich-Editor</primary><secondary>Bereich erstellen</secondary>
</indexterm><indexterm><primary>Bereich</primary><secondary>erstellen</secondary>
</indexterm></title>
<para>Die linke Seite des Fensters &ldquo;Suchbereich-Editor&rdquo; enth&auml;lt
eine Liste der B&uuml;cher in der Informationsbibliothek. Sie k&ouml;nnen
diese Liste expandieren oder zusammenziehen, indem Sie auf den nach rechts
deutenden Pfeil oder den nach unten deutenden Pfeil klicken, die jedem Buchtitel
voranstehen.</para>
<para>Die rechte Seite des Fensters &ldquo;Suchbereich-Editor&rdquo; enth&auml;lt
eine Liste der Buchkomponenten, die Sie in den Bereich einbeziehen k&ouml;nnen.
Der Informationsmanager schlie&szlig;t standardm&auml;&szlig;ig alle Komponenten
in Ihre Suche ein.</para>
<para>So erstellen Sie einen neuen Suchbereich:</para>
<orderedlist>
<listitem><para>Klicken Sie auf die Taste &ldquo;Neu&rdquo;.</para>
</listitem>
<listitem><para>Klicken Sie auf die Namen der B&uuml;cher und Komponenten,
die in dem Bereich enthalten sein sollen.</para>
</listitem>
<listitem><para>Klicken Sie auf die Taste &ldquo;Speichern&rdquo;. Der Informationsmanager
&ouml;ffnet das Fenster &ldquo;Bereich speichern&rdquo;, das in der folgenden
Abbildung zu sehen ist.</para>
<figure>
<title id="INFOUG.Search.mkr.18a">Fenster &ldquo;Bereich speichern&rdquo;</title>
<graphic id="INFOUG.Search.igrph.5" entityref="INFOUG.Search.fig.5"></graphic>
</figure>
</listitem>
<listitem><para>Geben Sie den Namen des neuen Bereichs in das Eingabefeld
ein und klicken Sie auf &ldquo;OK&rdquo;. Der Informationsmanager zeigt den
neuen Bereichsnamen im Fenster &ldquo;Suchbereich-Editor&rdquo; an.</para>
</listitem>
</orderedlist>
<para>Wenn Sie den neuen Bereich in einer Abfrage benutzen m&ouml;chten, greifen
Sie genauso auf ihn zu wie auf einen vordefinierten Bereich.</para>
</sect3>
<sect3 id="INFOUG.Search.div.19">
<title id="INFOUG.Search.mkr.19">&Auml;ndern von Suchbereichen<indexterm>
<primary>Bereich-Editor</primary><secondary>Bereich &auml;ndern</secondary>
</indexterm><indexterm><primary>Bereich</primary><secondary>&auml;ndern</secondary>
</indexterm></title>
<para>So &auml;ndern Sie einen existierenden Bereich:</para>
<orderedlist>
<listitem><para>Klicken Sie auf die Taste &ldquo;Bereichsname&rdquo; im Fenster
&ldquo;Suchbereich-Editor&rdquo;. Der Informationsmanager zeigt die Liste
mit Bereichen an.</para>
</listitem>
<listitem><para>W&auml;hlen Sie den Bereich aus, den Sie &auml;ndern m&ouml;chten.
Der Name des ausgew&auml;hlten Bereichs erscheint auf der Taste &ldquo;Bereichsname&rdquo;.
</para>
</listitem>
<listitem><para>Um die Zusammenstellung der B&uuml;cher zu &auml;ndern, die
in dem Bereich enthalten sind, heben Sie die Titel der B&uuml;cher hervor.
</para>
</listitem>
<listitem><para>Um die Zusammenstellung der Komponenten zu &auml;ndern, die
in dem Bereich enthalten sind, heben Sie die Namen der Komponenten hervor.
</para>
</listitem>
<listitem><para>Klicken Sie auf die Taste &ldquo;Speichern&rdquo;, um Ihre
&Auml;nderungen zu sichern.</para>
</listitem>
<listitem><para>Wenn Sie mit der Durchf&uuml;hrung von &Auml;nderungen fertig
sind, klicken Sie auf die Taste &ldquo;Schlie&szlig;en&rdquo;.</para>
</listitem>
</orderedlist>
<note>
<para>Um die anf&auml;ngliche Definition f&uuml;r den Bereich wiederherzustellen,
klicken Sie auf die Taste &ldquo;Zur&uuml;cksetzen&rdquo; unten im Fenster.
</para>
</note>
<para>Der Informationsmanager beh&auml;lt den Bereich bei, den Sie zuvor als
aktuellen Bereich f&uuml;r Ihre Suchen benutzt haben. Falls Sie am aktuellen
Bereich &Auml;nderungen vorgenommen haben, wendet der Informationsmanager
diese bei der n&auml;chsten Suche an, die mit dem Bereich durchgef&uuml;hrt
wird.</para>
</sect3>
<sect3 id="INFOUG.Search.div.20">
<title id="INFOUG.Search.mkr.20">Kopieren von Suchbereichen<indexterm><primary>Bereich-Editor</primary><secondary>Bereich kopieren</secondary></indexterm><indexterm>
<primary>Bereich</primary><secondary>kopieren</secondary></indexterm></title>
<para>So kopieren Sie einen Suchbereich:</para>
<orderedlist>
<listitem><para>Klicken Sie auf die Taste &ldquo;Bereichsname&rdquo; im Fenster
&ldquo;Suchbereich-Editor&rdquo;. Der Informationsmanager zeigt die Liste
mit Bereichen an.</para>
</listitem>
<listitem><para>W&auml;hlen Sie den Bereich aus, den Sie kopieren m&ouml;chten.
Der Name des ausgew&auml;hlten Bereichs erscheint auf der Taste &ldquo;Bereichsname&rdquo;.
</para>
</listitem>
<listitem><para>Klicken Sie auf die Taste &ldquo;Kopieren&rdquo; unten im
Fenster. Der Informationsmanager zeigt das Fenster &ldquo;Bereich speichern&rdquo;
an.</para>
</listitem>
<listitem><para>Geben Sie einen Namen f&uuml;r die Kopie ein und klicken Sie
auf &ldquo;OK&rdquo;, um sie zu speichern.</para>
</listitem>
</orderedlist>
<para>Beachten Sie, da&szlig; der Bereich weiterhin auch unter seinem alten
Namen existiert. Anweisungen zum Entfernen nicht mehr gew&uuml;nschter Bereiche
finden Sie unter <xref role="JumpText" linkend="INFOUG.Search.mkr.21">.</para>
</sect3>
<sect3 id="INFOUG.Search.div.21">
<title id="INFOUG.Search.mkr.21">Entfernen von Suchbereichen<indexterm><primary>Bereich-Editor</primary><secondary>Bereich entfernen</secondary></indexterm><indexterm>
<primary>Bereich</primary><secondary>entfernen</secondary></indexterm></title>
<para>So entfernen Sie einen zuvor gespeicherten Suchbereich:</para>
<orderedlist>
<listitem><para>Klicken Sie auf die Taste &ldquo;Bereichsname&rdquo; im Fenster
&ldquo;Suchbereich-Editor&rdquo;. Der Informationsmanager zeigt die Liste
mit Bereichen an.</para>
</listitem>
<listitem><para>W&auml;hlen Sie den Bereich aus, den Sie l&ouml;sch<?Pub Caret>en
m&ouml;chten. Der Name des ausgew&auml;hlten Bereichs erscheint auf der Taste
&ldquo;Bereichsname&rdquo;.</para>
</listitem>
<listitem><para>Klicken Sie auf die Taste &ldquo;L&ouml;schen&rdquo; unten
im Fenster. Der Informationsmanager entfernt den Bereich und zeigt den n&auml;chsten
Suchbereich in der Bereichsliste an.</para>
</listitem>
</orderedlist>
</sect3>
</sect2>
</sect1>
<sect1 id="INFOUG.Search.div.22">
<title id="INFOUG.Search.mkr.22">Ansicht von Suchergebnissen<indexterm><primary>Suchen</primary><secondary>Ergebnisse ansehen</secondary></indexterm><indexterm>
<primary>Suchergebnisse</primary></indexterm></title>
<para>Nachdem Sie eine Suche durchgef&uuml;hrt haben, zeigt der Informationsmanager
eine Liste der Abschnitte an, die gefundene Suchbegriffe enthalten. Diese
Liste erscheint im Fenster &ldquo;Suchergebnisse&rdquo;. Von diesem Fenster
aus k&ouml;nnen Sie zu jedem beliebigen der aufgelisteten Abschnitte gehen,
indem Sie auf dessen Titel klicken.</para>
<para>Die folgende Abbildung zeigt, wie gefundene Suchbegriffe in der Reihenfolge
abnehmender Wichtigkeit aufgelistet sind. Das Symbol auf der linken Seite
des Buchtitels gibt an, wie oft der Suchbegriff im jeweiligen Abschnitt erscheint.
</para>
<figure>
<title id="INFOUG.Search.mkr.22a">Fenster &ldquo;Suchergebnisse&rdquo;</title>
<graphic id="INFOUG.Search.igrph.6" entityref="INFOUG.Search.fig.6"></graphic>
</figure>
<para>Falls die Suchergebnisliste unvollst&auml;ndig, zu lang oder anderweitig
fehlerhaft zu sein scheint, &uuml;berpr&uuml;fen Sie, ob Sie den angemessenen
Suchbereich benutzt haben. &Uuml;berpr&uuml;fen Sie ebenfalls Ihre Einstellung
f&uuml;r die maximale Anzahl von Suchtreffern.</para>
<para>Bei der Durchf&uuml;hrung mehrerer Suchen ist es sinnvoll, das erste
Suchergebnisfenster festzustecken. Wenn Sie dann eine andere Suche durchf&uuml;hren,
ersetzen die neuen Ergebnisse nicht die Ergebnisse der ersten Suche. Stattdessen
werden sie in einem separaten Suchergebnisfenster angezeigt.</para>
<sect2 id="INFOUG.Search.div.23">
<title id="INFOUG.Search.mkr.23">Durchsuchen von Suchtreffern<indexterm><primary>Suchen</primary><secondary>Treffer durchsuchen</secondary></indexterm><indexterm>
<primary>Suchergebnisse</primary><secondary>Treffer durchsuchen</secondary>
</indexterm></title>
<para>Nachdem Sie von Ihrer Suchergebnis-Liste aus zu einem Abschnitt gegangen
sind, m&ouml;chten Sie vielleicht jeden Suchtreffer in dem Abschnitt ansehen.
Suchtreffer erscheinen fett, unterstrichen und in einer anderen Farbe. Der
Suchtreffer, auf dem Sie sich derzeit befinden, hat au&szlig;erdem ein gepunktetes
Rechteck um sich.</para>
<para>Um Suchtreffer innerhalb eines Abschnitts zu durchsuchen, verwenden
Sie die Tasten &ldquo;N&auml;chster Treffer&rdquo; und &ldquo;Vorheriger Treffer&rdquo;
in der Funktionsleiste des Lesefensters. (Sie k&ouml;nnen auch &ldquo;N&auml;chster
Treffer&rdquo; und &ldquo;Vorheriger Treffer&rdquo; im Men&uuml; &ldquo;Gehe
zu&rdquo; ausw&auml;hlen.)</para>
<graphic id="INFOUG.Search.igrph.7" entityref="INFOUG.Search.fig.7"></graphic>
<para>&ldquo;N&auml;chster Treffer&rdquo; zeigt den n&auml;chsten Suchtreffer
an. &ldquo;Vorausgehender Treffer&rdquo; zeigt den vorherigen Suchtreffer
an.</para>
<para>Wenn Sie sich beim letzten Treffer in einem Abschnitt befinden, erscheint
die Taste &ldquo;N&auml;chster Treffer&rdquo; schw&auml;cher dargestellt.
Wenn Sie sich beim ersten Treffer in einem Abschnitt befinden, erscheint die
Taste &ldquo;Vorausgehender Treffer&rdquo; schw&auml;cher dargestellt.</para>
</sect2>
<sect2 id="INFOUG.Search.div.24">
<title id="INFOUG.Search.mkr.24">Erneutes Ansehen von Ergebnissen einer vorherigen
Suche<indexterm><primary>Suche</primary><secondary>vorherige Ergebnisse erneut
ansehen</secondary></indexterm><indexterm><primary>Suchergebnisse</primary>
<secondary>vorherige erneut ansehen</secondary></indexterm></title>
<para>Falls Sie die Ergebnisse einer vorherigen Suche nicht festgesteckt haben,
l&auml;&szlig;t sich diese Liste immer noch abrufen. So k&ouml;nnen Sie eine
vorherige Suchergebnis-Liste erneut ansehen:</para>
<orderedlist>
<listitem><para>W&auml;hlen Sie &ldquo;Suchergebnis-Abfolge&rdquo; im Men&uuml;
&ldquo;Suchen&rdquo; eines beliebigen Lesefensters aus.</para>
<para>Der Informationsmanager zeigt das Fenster &ldquo;Suchergebnis-Abfolge&rdquo;
an.</para>
<figure>
<title id="INFOUG.Search.mkr.24a">Fenster &ldquo;Suchergebnis-Abfolge&rdquo;</title>
<graphic id="INFOUG.Search.igrph.8" entityref="INFOUG.Search.fig.8"></graphic>
</figure>
</listitem>
<listitem><para>Doppelklicken Sie auf die Suche, f&uuml;r die Sie die Ergebnisse
sehen m&ouml;chten.</para>
<para>Der Informationsmanager zeigt das Fenster &ldquo;Suchergebnisse&rdquo;
f&uuml;r die ausgew&auml;hlte Suche an.</para>
</listitem>
</orderedlist>
<para>Sie k&ouml;nnen nur f&uuml;r die Suchen Suchergebnisse abrufen, die
in der aktuellen Anzeigemodul-Session durchgef&uuml;hrt wurden.</para>
</sect2>
</sect1>
</chapter>
<?Pub *0000033424>
