<!-- $XConsortium: ch06.sgm /main/2 1996/12/17 15:30:45 rws $ -->
<!-- (c) Copyright 1996 Digital Equipment Corporation. -->
<!-- (c) Copyright 1996 Hewlett-Packard Company. -->
<!-- (c) Copyright 1996 International Business Machines Corp. -->
<!-- (c) Copyright 1996 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1996 Novell, Inc. -->
<!-- (c) Copyright 1996 FUJITSU LIMITED. -->
<!-- (c) Copyright 1996 Hitachi. -->
<chapter id="INFOUG.Mngrafx.div.1">
<title id="INFOUG.Mngrafx.mkr.1">Umgang mit Grafiken<indexterm><primary>Grafiken</primary><secondary>Umgang mit</secondary></indexterm><indexterm><primary>Grafiken</primary></indexterm></title>
<para>Sie m&ouml;chten vielleicht eine Grafik aus dem Dokumentflu&szlig; entfernen
und sie stattdessen in einem separaten Fenster zur Ansicht oder Bearbeitung
(Skalierung) plazieren. Eine solche Grafik wird "herausgenommene" Grafik genannt.
Hier sind einige Gr&uuml;nde f&uuml;r das Herausnehmen einer Grafik:</para>
<itemizedlist>
<listitem><para>Wenn Sie eine Grafik angezeigt lassen, k&ouml;nnen Sie w&auml;hrend
des Lesens immer wieder nachschauen.</para>
</listitem>
<listitem><para>Das Herausnehmen einer Grafik bietet eine M&ouml;glichkeit,
Bilder im selben oder in verschiedenen Abschnitten zu vergleichen.</para>
</listitem>
<listitem><para>Durch Herausnehmen einer Grafik, die sehr gro&szlig; ist oder
einfach &uuml;ber die Breite Ihres Standard-Lesefensters hinausreicht, k&ouml;nnen
Sie die Grafik skalieren, ohne die Gr&ouml;&szlig;e des Lesefensters &auml;ndern
zu m&uuml;ssen.</para>
</listitem>
<listitem><para>Da die Plazierung einiger gro&szlig;er Grafiken den Textflu&szlig;
bedeutend unterbrechen kann, k&ouml;nnen Sie durch Herausnehmen die Lesbarkeit
eines Abschnitts verbessern.</para>
</listitem>
</itemizedlist>
<para>Sie k&ouml;nnen herausgenommene Grafiken leicht bearbeiten und verwalten.
Insbesondere k&ouml;nnen Sie:</para>
<itemizedlist>
<listitem><para>Die Gr&ouml;&szlig;e des Grafikfensters ver&auml;ndern und
die Steuerkn&uuml;ppel-<?Pub Caret>Taste plazieren. Siehe <xref role="JumpText"
linkend="INFOUG.Mngrafx.div.3">.</para>
</listitem>
<listitem><para>Die Gr&ouml;&szlig;e von Grafiken ver&auml;ndern. Siehe <xref
role="JumpText" linkend="INFOUG.Mngrafx.div.4">.</para>
</listitem>
<listitem><para>Den urspr&uuml;nglichen Abschnitt einer Grafik finden. Siehe <xref
role="JumpText" linkend="INFOUG.Mngrafx.div.5">.</para>
</listitem>
<listitem><para>Grafiken wiedereinf&uuml;gen. Siehe <xref role="JumpText"
linkend="INFOUG.Mngrafx.div.7">.</para>
</listitem>
</itemizedlist>
<sect1 id="INFOUG.Mngrafx.div.2">
<title id="INFOUG.Mngrafx.mkr.2">Herausnehmen von Grafiken<indexterm><primary>Grafiken</primary><secondary>herausnehmen</secondary></indexterm></title>
<para>So nehmen Sie eine Grafik aus einem Buch heraus:</para>
<orderedlist>
<listitem><para>W&auml;hlen Sie &ldquo;Grafik herausnehmen&rdquo; im Men&uuml;
&ldquo;Optionen&rdquo; aus. Der Informationsmanager zeigt einen Fadenkreuz-Cursor
an.</para>
</listitem>
<listitem><para>Klicken Sie mit dem Mauszeiger auf die Grafik, die herausgenommen
werden soll. (Wenn Sie die Operation abbrechen m&ouml;chten, klicken Sie irgendwo
au&szlig;erhalb der Grafik.)</para>
</listitem>
</orderedlist>
<para>Sie k&ouml;nnen eine Grafik auch herausnehmen, indem Sie den Zeiger
auf der Grafik plazieren und auf die rechte Maustaste klicken. W&auml;hlen
Sie aus dem Popup-Men&uuml; &ldquo;Grafik herausnehmen&rdquo; aus.</para>
<para>Wenn eine Grafik ausgew&auml;hlt ist, zeigt der Informationsmanager
sie in einem separaten Fenster an. Im Lesefenster erscheint ein Symbol f&uuml;r
Herausgenommene Grafik anstelle der Grafik.</para>
<sidebar>
<graphic id="INFOUG.Mngrafx.igrph.1" entityref="INFOUG.Mngrafx.fig.1"></graphic>
</sidebar>
<para>Die folgende Abbildung zeigt ein Musterfenster &ldquo;Herausgenommene
Grafik&rdquo;.</para>
<figure>
<title id="INFOUG.Mngrafx.mkr.1a">Fenster &ldquo;Herausgenommene Grafik&rdquo;</title>
<graphic id="INFOUG.Mngrafx.igrph.2" entityref="INFOUG.Mngrafx.fig.2"></graphic>
</figure>
<para>Eine herausgenommene Grafik bleibt in einem separaten Fenster, bis Sie
sie wiedereinf&uuml;gen, das Fenster &ldquo;Herausgenommene Grafik&rdquo;
schlie&szlig;en oder die Anzeigemodul-Session beenden. Dies bedeutet, da&szlig;
Sie w&auml;hrend einer Session den Abschnitt schlie&szlig;en k&ouml;nnen,
in dem die Grafik zuerst erschien, w&auml;hrend sie weiterhin in einem separaten
Fenster angezeigt wird.</para>
</sect1>
<sect1 id="INFOUG.Mngrafx.div.3">
<title id="INFOUG.Mngrafx.mkr.3">Ver&auml;ndern der Gr&ouml;&szlig;e des Grafikfensters<indexterm>
<primary>Grafiken</primary><secondary>Fenstergr&ouml;&szlig;e ver&auml;ndern</secondary></indexterm></title>
<para>Um die Gr&ouml;&szlig;e eines Fensters &ldquo;Herausgenommene Grafik&rdquo;
zu ver&auml;ndern, ziehen und strecken Sie mit der Maus die Fensterbegrenzungen,
oder verwenden Sie die Taste f&uuml;r maximale Gr&ouml;&szlig;e in der oberen
rechten Ecke des Fensterrahmens.</para>
<para>Wenn Sie ein Fenster &ldquo;Herausgenommene Grafik&rdquo; verkleinern,
zeigt der Informationsmanager einen Steuerkn&uuml;ppel in einer Ecke des Fensters
an. Um verborgene Teile der Grafik nach der Verkleinerung des Fensters sehen
zu k&ouml;nnen, verschieben Sie den Steuerkn&uuml;ppel, um die Abschnitte
zum Vorschein zu bringen, die Sie sehen m&ouml;chten. Die folgende Abbildung
zeigt ein Fenster &ldquo;Herausgenommene Grafik&rdquo; mit einem Steuerkn&uuml;ppel
in der oberen linken Ecke des Fensters.<indexterm><primary>Steuerkn&uuml;ppel</primary><secondary>mit dem Fenster &ldquo;Herausgenommene Grafik&rdquo;</secondary></indexterm></para>
<figure>
<title id="INFOUG.Mngrafx.mkr.2a">Steuerkn&uuml;ppel</title>
<graphic id="INFOUG.Mngrafx.igrph.3" entityref="INFOUG.Mngrafx.fig.3"></graphic>
</figure>
<para>Um den Steuerkn&uuml;ppel in eine andere Ecke des Fensters zu verschieben
oder ihn ganz zu entfernen, w&auml;hlen Sie die gew&uuml;nschte Position im
Men&uuml; &ldquo;Steuerkn&uuml;ppel&rdquo; aus. Der Informationsmanager verschiebt
den Steuerkn&uuml;ppel in die gew&uuml;nschte Ecke oder entfernt ihn ganz.
</para>
</sect1>
<sect1 id="INFOUG.Mngrafx.div.4">
<title id="INFOUG.Mngrafx.mkr.4">Ver&auml;ndern der Gr&ouml;&szlig;e von Grafiken<indexterm>
<primary>Grafiken</primary><secondary>Gr&ouml;&szlig;e ver&auml;ndern</secondary>
</indexterm></title>
<para>Sie k&ouml;nnen mit den Optionen im Men&uuml; &ldquo;Ansicht&rdquo;
bestimmen, wie eine skalierbare Grafik im Fenster &ldquo;Herausgenommene Grafik&rdquo;
aussieht. Diese Optionen sind f&uuml;r nicht skalierbare Grafiken inaktiv:
</para>
<variablelist>
<varlistentry><term>In Fenster einpassen</term>
<listitem>
<para>Stellt die Gr&ouml;&szlig;e der Grafik so ein, da&szlig; sie innerhalb
der Grenzen des Fensters &ldquo;Herausgenommene Grafik&rdquo; Platz hat.</para>
</listitem>
</varlistentry>
<varlistentry><term>An Grafik anpassen</term>
<listitem>
<para>Stellt die Gr&ouml;&szlig;e des Fensters &ldquo;Herausgenommene Grafik&rdquo;
so ein, da&szlig; es mit der aktuellen Gr&ouml;&szlig;e der Grafik &uuml;bereinstimmt.
</para>
</listitem>
</varlistentry>
<varlistentry><term>Prozents&auml;tze f&uuml;r Skalieren</term>
<listitem>
<para>Vergr&ouml;&szlig;ern oder verkleinern die Grafik in Relation zu ihrer
anf&auml;nglichen Gr&ouml;&szlig;e.</para>
</listitem>
</varlistentry>
<varlistentry><term>Anpa&szlig;bar</term>
<listitem>
<para>Geben Sie einen Skalier-Prozentsatz f&uuml;r die aktuelle Grafik an.
</para>
</listitem>
</varlistentry>
</variablelist>
</sect1>
<sect1 id="INFOUG.Mngrafx.div.5">
<title id="INFOUG.Mngrafx.mkr.5">Finden des urspr&uuml;nglichen Abschnitts
einer Grafik<indexterm><primary>Grafiken</primary><secondary>Abschnitt finden</secondary></indexterm></title>
<para>Sie k&ouml;nnen von einem Fenster &ldquo;Herausgenommene Grafik&rdquo;
aus den Abschnitt &ouml;ffnen, aus dem die Grafik herausgenommen wurde. Hierzu
w&auml;hlen Sie &ldquo;Abschnitt anzeigen&rdquo; im Men&uuml; &ldquo;Datei&rdquo;
des Fensters &ldquo;Herausgenommene Grafik&rdquo; aus. Der Informationsmanager
&ouml;ffnet das Fenster, aus dem Sie die Grafik herausgenommen haben, und
positioniert es &uuml;ber Ihren anderen Fenstern.</para>
</sect1>
<sect1 id="INFOUG.Mngrafx.div.7">
<title id="INFOUG.Mngrafx.mkr.7">Wiedereinf&uuml;gen von Grafiken<indexterm>
<primary>Grafiken</primary><secondary>wiedereinf&uuml;gen</secondary></indexterm></title>
<para>Sie k&ouml;nnen eine Grafik unter Verwendung einer der folgenden Methoden
wieder in das Buch einf&uuml;gen, aus dem Sie sie herausgenommen haben:</para>
<itemizedlist>
<listitem><para>W&auml;hlen Sie &ldquo;Verbinden&rdquo; im Men&uuml; &ldquo;Datei&rdquo;
des Fensters &ldquo;Herausgenommene Grafik&rdquo; aus.</para>
</listitem>
<listitem><para>W&auml;hlen Sie &ldquo;Schlie&szlig;en&rdquo; im Men&uuml;
&ldquo;Datei&rdquo; des Fensters &ldquo;Herausgenommene Grafik&rdquo; aus.
</para>
</listitem>
<listitem><para>Doppelklicken Sie auf die Fenstermen&uuml;taste (obere linke
Ecke des Fensters &ldquo;Herausgenommene Grafik&rdquo;).</para>
</listitem>
<listitem><para>Plazieren Sie den Zeiger auf die Grafik und klicken Sie auf
die rechte Maustaste. Aus dem Popup-Men&uuml; w&auml;hlen Sie &ldquo;Grafik
einf&uuml;gen&rdquo;.</para>
</listitem>
</itemizedlist>
<para>Der Informationsmanager schlie&szlig;t das Fenster &ldquo;Herausgenommene
Grafik&rdquo; und f&uuml;gt die Grafik wieder in das Buch ein, ganz gleich,
ob es derzeit ge&ouml;ffnet ist oder nicht.</para>
</sect1>
</chapter>
<?Pub *0000012910>
