<!-- $XConsortium: ch01.sgm /main/2 1996/12/17 15:35:57 rws $ -->
<!-- (c) Copyright 1996 Digital Equipment Corporation. -->
<!-- (c) Copyright 1996 Hewlett-Packard Company. -->
<!-- (c) Copyright 1996 International Business Machines Corp. -->
<!-- (c) Copyright 1996 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1996 Novell, Inc. -->
<!-- (c) Copyright 1996 FUJITSU LIMITED. -->
<!-- (c) Copyright 1996 Hitachi. -->
<chapter id="INFOUG.Gstart.div.1">
<title id="INFOUG.Gstart.mkr.1">D&eacute;marrage</title>
<para>Le Common Desktop Environment vous fournit une collection standard de
documents en ligne traitant des divers composants CDE et Motif. Le Bureau
CDE inclut le Gestionnaire des informations qui vous permettra d'acc&eacute;der,
de lire et de proc&eacute;der &agrave; des recherches dans cette documentation.
Le Gestionnaire des informations permet &eacute;galement d'acc&eacute;der
aux documents en ligne propos&eacute;s par d'autres applications install&eacute;es
sur votre bureau.</para>
<para>Le reste de ce chapitre d&eacute;crit:</para>
<itemizedlist>
<listitem><para><xref linkend="INFOUG.Gstart.div.2"></para>
</listitem>
<listitem><para><xref linkend="INFOUG.Gstart.div.3"></para>
</listitem>
<listitem><para><xref linkend="INFOUG.Gstart.div.6"></para>
</listitem>
<listitem><para><xref linkend="INFOUG.Gstart.div.10"></para>
</listitem>
</itemizedlist>
<sect1 id="INFOUG.Gstart.div.2">
<title id="INFOUG.Gstart.mkr.2">Organisation de l'information<indexterm><primary>biblioth&egrave;ques d'informations</primary><secondary>organisation</secondary>
</indexterm></title>
<para>Lorsque vous consultez des informations &agrave; l'aide du Gestionnaire
des informations, vous parcourez en fait une <firstterm>biblioth&egrave;que
d'informations</firstterm> (&eacute;galement appel&eacute;e "infolib"). Une
biblioth&egrave;que d'informations est divis&eacute;e en un ou plusieurs <firstterm>
rayons</firstterm>. Sur chaque rayon, vous trouverez un ou plusieurs <firstterm>
livres</firstterm> qui contiennent la plupart des &eacute;l&eacute;ments que
vous vous attendriez &agrave; trouver normalement dans un livre imprim&eacute;.
</para>
<para>A l'instar d'un livre imprim&eacute;, un livre en ligne contient des <firstterm>
sections</firstterm> rec&egrave;lant principalement du texte mais &eacute;galement
des objects graphiques et des tables. La liste (table des mati&egrave;res)
d'un livre &eacute;num&egrave;re toutes les sections que contient ce dernier.
</para>
<note>
<para>Plusieurs biblioth&egrave;ques d'informations peuvent &ecirc;tre disponibles
sur votre syst&egrave;me.</para>
</note>
<para>La figure suivante illustre la structure d'une biblioth&egrave;que d'informations.
</para>
<figure>
<title id="InfoUGD.Gstart.infolib1">Biblioth&egrave;que d'informations</title>
<graphic id="INFOUG.Gstart.igrph.1" entityref="INFOUG.Gstart.fig.1"></graphic>
</figure>
</sect1>
<sect1 id="INFOUG.Gstart.div.3">
<title id="INFOUG.Gstart.mkr.3">D&eacute;marrer le Gestionnaire des informations<indexterm>
<primary>Gestionnaire des informations</primary><secondary>d&eacute;marrer</secondary></indexterm></title>
<para>Lancez le Gestionnaire des informations d'une des mani&egrave;res suivantes
:</para>
<itemizedlist>
<listitem><para>Cliquez sur l'objet de commande Gestionnaire des informations
dans le Tableau de bord.</para>
<sidebar>
<graphic id="INFOUG.Gstart.igrph.2" entityref="INFOUG.Gstart.fig.2"></graphic>
</sidebar>
</listitem>
<listitem><para>Cliquez sur l'ic&ocirc;ne Gestionnaire des informations dans
le panneau secondaire du Gestionnaire des informations.</para>
<sidebar>
<graphic id="INFOUG.Gstart.igrph.3" entityref="INFOUG.Gstart.fig.3"></graphic>
</sidebar>
</listitem>
<listitem><para>Faites glisser-d&eacute;posez une ic&ocirc;ne Biblioth&egrave;que
d'informations (repr&eacute;sent&eacute;e dans la fen&ecirc;tre du Gestionnaire
de fichiers) sur le dispositif de commande Gestionnaire des informations dans
le Tableau de bord.</para>
<sidebar>
<graphic id="INFOUG.Gstart.igrph.4" entityref="INFOUG.Gstart.fig.4"></graphic>
</sidebar>
</listitem>
<listitem><para>Entrez la commande <command>dtinfo</command> &agrave; partir
de la fen&ecirc;tre Terminal.</para>
</listitem>
</itemizedlist>
<para>Lors de son d&eacute;marrage, le Gestionnaire des informations affiche
la fen&ecirc;tre Liste de livres. Comme l'indique l'illustration suivante,
la fen&ecirc;tre Liste de livres &eacute;num&egrave;re les biblioth&egrave;ques
d'informations disponibles.</para>
<figure>
<title id="InfoUGD.Gstart.booklist1">Fen&ecirc;tre Liste de livres</title>
<graphic id="INFOUG.Gstart.igrph.5" entityref="INFOUG.Gstart.fig.5"></graphic>
</figure>
<para>Les composants des biblioth&egrave;ques d'informations sont affich&eacute;s
de mani&egrave;re hi&eacute;rarchique pour vous permettre de progresser vers
des &eacute;l&eacute;ments d'information de plus en plus petits et sp&eacute;cifiques.
La structure hi&eacute;rarchique consiste en une arborescence de rayons, de
livres, de chapitres et de sections.</para>
<itemizedlist>
<listitem><para>Pour ouvrir un article quelconque de la hi&eacute;rarchie,
cliquez sur la fl&egrave;che vers la droite qui lui est associ&eacute;e. Le
Gestionnaire des informations agrandit l'article pour en afficher le contenu.
</para>
</listitem>
<listitem><para>Pour refermer un article (chapitre, livre, rayon), cliquez
sur la fl&egrave;che vers le bas qui se trouve juste &agrave; c&ocirc;t&eacute;.
Le Gestionnaire des informations r&eacute;duit l'article et supprime son contenu
de l'affichage.</para>
</listitem>
<listitem><para>Pour parcourir une section de livre, s&eacute;lectionnez le
nom de la section puis cliquez sur le bouton Visualiser (Jumelles) de la barre
d'outils ou, plus simplement, cliquez deux fois sur le nom de la section.
Le Gestionnaire des informations ouvre la fen&ecirc;tre de lecture, affichant
le contenu de la section s&eacute;lectionn&eacute;e. La figure suivante illustre
le mode d'affichage du texte dans la fen&ecirc;tre de lecture.</para>
</listitem>
</itemizedlist>
<figure>
<title id="InfoUGD.Gstart.readwin1">Fen&ecirc;tre de lecture</title>
<graphic id="INFOUG.Gstart.igrph.6" entityref="INFOUG.Gstart.fig.6"></graphic>
</figure>
<para>Une section &eacute;tant affich&eacute;e, vous pouvez cliquer sur les
boutons de parcours Section pr&eacute;c&eacute;dente et Section suivante (situ&eacute;s
sur la barre d'outils) pour vous d&eacute;placer parmi les sections.</para>
<graphic id="INFOUG.Gstart.igrph.7" entityref="INFOUG.Gstart.fig.7"></graphic>
<para>Cliquez sur les hyperliens (liens hypertexte affich&eacute;s en gras
et soulign&eacute;s) pour passer &agrave; d'autres parties du livre.</para>
<note>
<para>Si vous le d&eacute;sirez, laissez la fen&ecirc;tre Liste de livres
ou la fen&ecirc;tre de lecture ouverte pour faciliter vos acc&egrave;s aux
diverses sections lors d'une session. Vous pouvez &eacute;galement r&eacute;duire
ces fen&ecirc;tres.</para>
</note>
<sect2 id="INFOUG.Gstart.div.4">
<title id="INFOUG.Gstart.mkr.4">Ouvrir une biblioth&amp;egrave;que d'informations<indexterm>
<primary>Gestionnaire des informations</primary><secondary>d&eacute;marrer
par une biblioth&egrave;que d'informations sp&eacute;cifique</secondary></indexterm><indexterm>
<primary>Biblioth&egrave;que d'informations</primary><secondary>ouvrir</secondary>
</indexterm></title>
<para>Lorsque vous l'initialisez, le Gestionnaire des informations ou une
ou plusieurs biblioth&egrave;ques d'informations par d&eacute;faut. Si la
biblioth&egrave;que d'informations d&eacute;sir&eacute;e ne figure pas dans
la collection par d&eacute;faut, indiquez au Gestionnaire des informations
d'initialiser et d'ouvrir la biblioth&egrave;que d'une des mani&egrave;res
suivantes:</para>
<itemizedlist>
<listitem><para>Faites glisser l'ic&ocirc;ne de la biblioth&egrave;que d'informations
de la fen&ecirc;tre du Gestionnaire de fichiers vers l'objet de commande Gestionnaire
des informations dans le Tableau de bord.</para>
</listitem>
<listitem><para>Cliquez deux fois sur l'ic&ocirc;ne de la biblioth&egrave;que.
</para>
</listitem>
<listitem><para>Entrez la commande <command>dtinfo</command> &agrave; partir
de la fen&ecirc;tre Terminal et sp&eacute;cifiez le chemin d'acc&egrave;s
&agrave; la biblioth&egrave;que pour l'option <literal>-l</literal>.</para>
</listitem>
</itemizedlist>
<para>Si le Gestionnaire des informations tourne d&eacute;j&agrave;, chargez
une biblioth&egrave;que d'informations en faisant glisser son ic&ocirc;ne
dans la fen&ecirc;tre Liste de livres ou dans la fen&ecirc;tre de lecture.
Vous pouvez &eacute;galement charger une biblioth&egrave;que d'informations
en cliquant sur le bouton <comment>$$$ Traduire</comment>Charger biblinfo
ou en choisissant Ajouter sur le menu <comment>$$$ Traduire</comment>Book
List Edit.</para>
</sect2>
</sect1>
<sect1 id="INFOUG.Gstart.div.5">
<title id="INFOUG.Gstart.mkr.5">Quitter le Gestionnaire des informations<indexterm>
<primary>Gestionnaire des informations</primary><secondary>quitter</secondary>
</indexterm></title>
<para>Pour quitter le Gestionnaire des informations:</para>
<itemizedlist>
<listitem><para>A partir de la fen&amp;ecirc;tre Liste de livres, choisissez
Quitter sur le menu Fichier.</para>
</listitem>
<listitem><para>A partir de la fen&amp;ecirc;tre de lecture, choisissez Quitter
sur le menu Explorateur.</para>
</listitem>
</itemizedlist>
<para>Vous pouvez quitter l'une ou l'autre de ces fen&ecirc;tres en cliquant
deux fois sur le bouton de menu Fen&ecirc;tre (dans le coin sup&eacute;rieur
gauche).</para>
</sect1>
<sect1 id="INFOUG.Gstart.div.6">
<title id="INFOUG.Gstart.mkr.6">Obtenir de l'aide<indexterm><primary>Gestionnaire
des informations</primary><secondary>aide</secondary></indexterm><indexterm>
<primary>aide</primary></indexterm></title>
<para>Obtenez de l'aide d'une des mani&egrave;res suivantes :<indexterm><primary>choisir</primary><secondary>aide</secondary></indexterm></para>
<itemizedlist remap="Bullet1">
<listitem><para>Appuyez sur F1 ou sur la touche Aide.<indexterm><primary>F1, touche</primary></indexterm><indexterm><primary>Aide, touche</primary>
</indexterm></para>
</listitem>
<listitem><para>Choisissez un &eacute;l&eacute;ment sur le menu Aide du Gestionnaire
des informations.</para>
</listitem>
<listitem><para>Cliquez sur le bouton Aide &agrave; partir d'une bo&icirc;te
de dialogue.</para>
</listitem>
</itemizedlist>
<para>La mani&egrave;re la plus rapide et ais&eacute;e d'acc&eacute;der &agrave;
l'aide consiste &agrave; actionner la touche F1. Lorsque vous appuyez sur
F1, le Gestionnaire des informations affiche la rubrique d'aide relative &agrave;
l'activit&eacute; en cours.</para>
<para>Certains claviers incluent une touche Aide d&eacute;di&eacute;e qui
remplacera peut-&ecirc;tre la touche F1.</para>
<sect2 id="INFOUG.Gstart.div.7">
<title id="INFOUG.Gstart.mkr.7">Le menu Aide<indexterm><primary>Aide, menu</primary></indexterm></title>
<para>Le Gestionnaire des informations propose un menu Aide permettant d'obtenir
des types d'aide sp&eacute;cifiques.</para>
<sidebar>
<para><graphic id="INFOUG.Gstart.igrph.8" entityref="INFOUG.Gstart.fig.8"></graphic></para>
</sidebar>
<informaltable>
<tgroup cols="2" colsep="0" rowsep="0">
<colspec align="left" colwidth="138*">
<colspec align="left" colwidth="390*">
<tbody>
<row>
<entry align="left" valign="top"><para>Introduction</para></entry>
<entry align="left" valign="top"><para>Affiche des informations g&eacute;n&eacute;rales
sur les fonctionnalit&eacute;s du Gestionnaire des informations.</para></entry>
</row>
<row>
<entry align="left" valign="top"><para>T&acirc;ches</para></entry>
<entry align="left" valign="top"><para>Propose des consignes d'utilisation
du Gestionnaire des informations.</para></entry></row>
<row>
<entry align="left" valign="top"><para>R&eacute;f&eacute;rence</para></entry>
<entry align="left" valign="top"><para>Affiche de br&egrave;ves informations
sur les composants du Gestionnaire des informations.</para></entry></row>
<row>
<entry align="left" valign="top"><para>Sur l'&eacute;l&eacute;ment</para></entry>
<entry align="left" valign="top"><para>Transforme le pointeur en point d'interrogation.
Cliquez le point d'interrogation sur un &eacute;l&eacute;ment pour en afficher
la description.<indexterm><primary>point d'interrogation, pointeur</primary>
</indexterm></para></entry></row>
<row>
<entry align="left" valign="top"><para>Utiliser l'aide</para></entry>
<entry align="left" valign="top"><para>Propose des informations sur l'exploitation
de l'utilitaire d'aide.</para></entry></row>
<row>
<entry align="left" valign="top"><para>A propos du Gestionnaire des informations
</para></entry>
<entry align="left" valign="top"><para>Affiche des informations sur la version
et les droits de reproduction du Gestionnaire des informations.</para></entry>
</row></tbody></tgroup></informaltable>
</sect2>
<sect2 id="INFOUG.Gstart.div.8">
<title id="INFOUG.Gstart.mkr.8">Messages QuickInfo<indexterm><primary>QuickInfo,
messages</primary></indexterm></title>
<indexterm><primary>messages</primary><secondary>QuickInfo</secondary></indexterm>
<para>Les messages QuickInfo consistent en de br&egrave;ves descriptions des
composants de fen&ecirc;tre. Lorsque vous placez le pointeur sur un composant
de fen&ecirc;tre, le message QuickInfo de ce dernier appara&icirc;t dans la
zone de message. Le message d&eacute;crit le composant et explique son utilisation.
Par exemple, si vous placez le pointeur sur le bouton Section pr&eacute;c&eacute;dente
(Fl&egrave;che vers le haut) de la barre d'outils de la fen&ecirc;tre de lecture,
la zone de message affiche:</para>
<para><computeroutput>Allez vers la section du document</computeroutput></para>
</sect2>
<sect2 id="INFOUG.Gstart.div.9">
<title id="INFOUG.Gstart.mkr.9">Utiliser les fen&ecirc;tres d'aide<indexterm>
<primary>fen&ecirc;tres</primary><secondary>Aide</secondary></indexterm><indexterm>
<primary>Aide</primary><secondary>fen&ecirc;tres</secondary></indexterm></title>
<para>Lorsque vous acc&eacute;dez &agrave; l'aide, le Gestionnaire des informations
affiche une fen&ecirc;tre contenant le texte d'aide requis. Pour obtenir des
informations compl&eacute;mentaires sur une t&acirc;che d&eacute;crite, cliquez
sur le bouton <comment>$$$ Traduire</comment>Autres...<?Pub Caret> Pour obtenir
de l'aide sur l'exploitation de l'utilitaire d'aide, cliquez sur le bouton
Aide. Pour refermer une fen&ecirc;tre d'aide, cliquez sur le bouton Fermer.
</para>
</sect2>
</sect1>
<sect1 id="INFOUG.Gstart.div.10">
<title id="INFOUG.Gstart.mkr.10">Utiliser des raccourcis clavier<indexterm>
<primary>clavier</primary><secondary>raccourcis</secondary></indexterm></title>
<para>Le rectangle en surbrillance d&eacute;signe l'&eacute;l&eacute;ment
de fen&ecirc;tre, de menu ou objet de commande qui sera affect&eacute; par
votre entr&eacute;e. Pour activer un &eacute;l&eacute;ment de menu ou un objet
de comande s&eacute;lectionn&eacute; (tel qu'un bouton), appuyez sur la barre
d'espacement.</para>
<para>Vous pr&eacute;f&eacute;rerez probablement appuyer sur F10 pour positionner
le rectangle de surbrillance dans la barre de menu. Ceci vous permettra de
naviguer d'un menu &agrave; l'autre &agrave; l'aide des touches fl&eacute;ch&eacute;es
ou en appuyant sur la premi&egrave;re lettre du nom de menu.</para>
</sect1>
</chapter>
<?Pub *0000018752>
