<!-- $XConsortium: ch02.sgm /main/2 1996/12/17 15:36:07 rws $ -->
<!-- (c) Copyright 1996 Digital Equipment Corporation. -->
<!-- (c) Copyright 1996 Hewlett-Packard Company. -->
<!-- (c) Copyright 1996 International Business Machines Corp. -->
<!-- (c) Copyright 1996 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1996 Novell, Inc. -->
<!-- (c) Copyright 1996 FUJITSU LIMITED. -->
<!-- (c) Copyright 1996 Hitachi. -->
<chapter id="INFOUG.Rdbooks.div.1">
<title id="INFOUG.Rdbooks.mkr.1">Lire les livres</title>
<para>Plusieurs m&eacute;thodes permettent de vous d&eacute;placer dans une
biblioth&egrave;que d'informations. La mani&egrave;re la plus simple de d&eacute;marrer
est de consid&eacute;rer une biblioth&egrave;que d'informations comme une
collection de livres en ligne. Les livres en ligne pr&eacute;sentent des caract&eacute;ristiques
similaires &agrave; celles des livres imprim&eacute;s traditionnels. Par exemple,
les livres en ligne sont structur&eacute;s en chapitres et sections et contiennent
des tables des mati&egrave;res. Par contre, les livres en ligne proposent
&eacute;galement des fonctionnalit&eacute;s, telles que les liens hypertexte,
que n'offrent pas les livres imprim&eacute;s traditionnels.</para>
<para>Ce chapitre d&eacute;crit les principes fondamentaux de la lecture des
livres en ligne et explique comment:</para>
<itemizedlist>
<listitem><para><xref role="JumpText" linkend="INFOUG.Rdbooks.div.2"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Rdbooks.div.8"></para>
</listitem>
</itemizedlist>
<sect1 id="INFOUG.Rdbooks.div.2">
<title id="INFOUG.Rdbooks.mkr.2">Utiliser les fen&ecirc;tres du Gestionnaire
des informations<indexterm><primary>fen&ecirc;tres</primary><secondary>utiliser</secondary></indexterm></title>
<para>Lorsque vous l'initialisez, le Gestionnaire des informations affiche
la fen&ecirc;tre Liste de livres qui &eacute;num&egrave;re les biblioth&egrave;ques
d'information r&eacute;sidant sur le syst&egrave;me. La fen&ecirc;tre Liste
de livres permet un acc&egrave;s traditionnel aux informations &agrave; consulter
dans le Gestionnaire des informations. A partir de la Liste de livres, ouvrez
des fen&ecirc;tres de lecture affichant le contenu des livres d'une biblioth&egrave;que
d'informations. Pour ne jamais vous &eacute;garer dans une biblioth&egrave;que
d'informations, vous pouvez configurer la Liste de livres de mani&egrave;re
&agrave; enregistrer un historique de vos d&eacute;placements. L'&eacute;cran
Liste de livres permet &eacute;galement d'imprimer des sections de livres.
</para>
<para>La figure suivante repr&eacute;sente la fen&ecirc;tre Liste des livres
du Gestionnaire des informations.</para>
<figure>
<title id="InfoUGD.Gstart.booklist2">Fen&ecirc;tre Liste des livres</title>
<graphic id="INFOUG.Rdbooks.igrph.1" entityref="INFOUG.Rdbooks.fig.1"></graphic>
</figure>
<para>Cliquez deux fois sur le titre de la section &agrave; lire pour indiquer
au Gestionnaire des informations d'ouvrir une fen&ecirc;tre de lecture affichant
le texte de la section s&eacute;lectionn&eacute;e. A partir de la fen&ecirc;tre
de lecture, vous pouvez lire du texte et acc&eacute;der &agrave; toutes les
autres fonctions du Gestionnaire des informations. Plus sp&eacute;cifiquement,
il vous est loisible de consulter du texte et des &eacute;l&eacute;ments graphiques,
d'imprimer, de proc&eacute;der &agrave; des recherches, d'utiliser des signets
et des notes, de d&eacute;finir des pr&eacute;f&eacute;rences et d'acc&eacute;der
&agrave; l'aide.</para>
<para>La ligure suivante repr&eacute;sente la fen&ecirc;tre de lecture du
Gestionnaire des informations.</para>
<figure>
<title id="InfoUGD.Rdbooks.readwin2">Fen&ecirc;tre de lecture</title>
<graphic id="INFOUG.Rdbooks.igrph.2" entityref="INFOUG.Rdbooks.fig.2"></graphic>
</figure>
<para>Bien que la plupart des fonctions des fen&ecirc;tres du Gestionnaire
des informations soient identiques &agrave; celles des autres fen&ecirc;tres
de l'environnement CDE, les sections suivantes proposent certains conseils
d'utilisation des fen&ecirc;tres du Gestionnaire des informations:</para>
<itemizedlist>
<listitem><para><xref role="JumpText" linkend="INFOUG.Rdbooks.mkr.3"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Rdbooks.mkr.4"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Rdbooks.mkr.5"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Rdbooks.mkr.6"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Rdbooks.mkr.7"></para>
</listitem>
</itemizedlist>
<sect2 id="INFOUG.Rdbooks.div.3">
<title id="INFOUG.Rdbooks.mkr.3">Configurer la Liste de livres de mani&egrave;re
&agrave; maintenir un historique<indexterm><primary>Liste de livres</primary>
<secondary>configurer de mani&egrave;re &agrave; maintenir un historique</secondary>
</indexterm><indexterm><primary>fen&ecirc;tres</primary><secondary>configurer
la Liste de livres de mani&egrave;re &agrave; maintenir un historique</secondary>
</indexterm></title>
<para>Pour d&eacute;terminer rapidement o&ugrave; vous vous trouvez dans l'arborescence
de la biblioth&amp;egrave;que d'informations, vous pouvez configurer la Liste
des livres de mani&egrave;re &agrave; maintenir automatiquement un historique
de vos d&eacute;placements.</para>
<para>Lorsque l'historique automatique est activ&eacute;, une ic&ocirc;ne
en forme de doigt dans la fen&ecirc;tre Liste des livres pointe vers le titre
de la section que vous lisez actuellement. A mesure que vous vous d&eacute;placez
dans la biblioth&amp;egrave;que d'informations, la Liste des livres s'actualise
automatiquement pour indiquer votre position actuelle.</para>
<para>Si la section en cours est subordonn&eacute;e &agrave; une section non
&eacute;tendue dans la Liste des livres, l'ic&ocirc;ne en forme de doigt est
&ldquo;vide&rdquo; et pointe vers le titre de la section parent.</para>
<para>Pour activer/d&eacute;sactiver l'historique automatique, choisissez
Historique automatique sur le menu Options de la fen&ecirc;tre Liste des livres.
L'historique automatique est activ&eacute; si vous remarquez une coche &agrave;
c&ocirc;t&eacute; de l'option Historique automatique.</para>
<para>Veuillez remarquer que l'ic&ocirc;ne d'historique appara&icirc;t uniquement
lorsqu'une fen&ecirc;tre de lecture est ouverte.</para>
</sect2>
<sect2 id="INFOUG.Rdbooks.div.4">
<title id="INFOUG.Rdbooks.mkr.4">Utiliser plusieurs fen&ecirc;tres<indexterm>
<primary>fen&ecirc;tres</primary><secondary>ancrer</secondary></indexterm><indexterm>
<primary>fen&ecirc;tres</primary><secondary>utiliser plusieurs</secondary>
</indexterm></title>
<para>Le Gestionnaire des informations vous permet d'utiliser plusieurs fen&ecirc;tres
de lecture &agrave; la fois. Vous pouvez par exemple conserver le texte d'une
fen&ecirc;tre tout en lisant les sections d'une autre fen&ecirc;tre. Pour
ce faire, cliquez sur la punaise (plus pr&eacute;cis&eacute;ment une <emphasis>pushpin</emphasis>) de la barre d'outils de la fen&ecirc;tre de lecture. Le
fait de cliquer sur cette ic&ocirc;ne vous permet d'alterner entre les modes
ancr&eacute;e et non ancr&eacute;e.</para>
<para>Si une fen&ecirc;tre est &ldquo;ancr&eacute;e&rdquo;, le Gestionnaire
des informations ouvre une autre fen&ecirc;tre de lecture pour la section
suivante &agrave; laquelle vous acc&eacute;dez. Si une fen&ecirc;tre n'est
pas ancr&eacute;e, le Gestionnaire des informations remplace le texte de la
fen&ecirc;tre en cours par celui de la nouvelle section.<indexterm><primary>pushpin</primary></indexterm></para>
<para>Si une fen&ecirc;tre est &ldquo;ancr&eacute;e&rdquo;, la <emphasis>pushpin</emphasis> appara&icirc;t dans le coin sup&eacute;rieur droit, accompagn&eacute;e
d'une coche.</para>
<graphic id="INFOUG.Rdbooks.igrph.3" entityref="INFOUG.Rdbooks.fig.3"></graphic>
<note>
<para>Vous pouvez &eacute;galement ancrer des fen&ecirc;tres R&eacute;sultats
de la recherche. Si vous ancrez une fen&ecirc;tre R&amp;eacute;sultats de
la recherche, le Gestionnaire des informations ne remplace pas les r&eacute;sultats
de la premi&egrave;re recherche par ceux des recherches suivantes. Au contraire,
les nouveaux r&amp;eacute;sultats de recherche apparaissent dans des fen&ecirc;tres
R&eacute;sultats de la recherche s&eacute;par&eacute;es.</para>
</note>
<para>Choisissez Pr&eacute;f&eacute;rences sur le menu Options pour sp&eacute;cifier
si toutes les nouvelles fen&ecirc;tres de lecture seront ancr&eacute;es ou
non, par d&eacute;faut. Pour gagner de l'espace &agrave; l'&eacute;cran, il
convient probablement de limiter le nombre de fen&ecirc;tres utilis&eacute;es
simultan&eacute;ment.</para>
<para>Il se r&eacute;v&eacute;lera probablement utile d'ancrer la fen&ecirc;tre
Index si vous pr&eacute;voyez de suivre plusieurs liens.</para>
</sect2>
<sect2 id="INFOUG.Rdbooks.div.5">
<title id="INFOUG.Rdbooks.mkr.5">Redimensionner une fen&ecirc;tre de lecture<indexterm>
<primary>fen&ecirc;tres</primary><secondary>fen&ecirc;tre de lecture</secondary>
<tertiary>redimensionner</tertiary></indexterm><indexterm><primary>fen&ecirc;tre
de lecture</primary><secondary>redimensionner</secondary></indexterm></title>
<para>Pour modifier la taille d'une fen&ecirc;tre de lecture, utilisez la
souris pour faire glisser et d&eacute;placer les bords de la fen&ecirc;tre,
ou utilisez le bouton Agrandir dans le coin sup&eacute;rieur droit du cadre
de la fen&ecirc;tre. Les nouvelles dimensions de la fen&ecirc;tre resteront
en<?Pub Caret> vigueur pour le reste de votre session Gestionnaire des informations
ou jusqu'&agrave; ce que vous les modifiiez. Lorsque vous redimensionnez une
fen&ecirc;tre de lecture, le texte s'ajuste automatiquement &agrave; la nouvelle
taille de fen&ecirc;tre.</para>
<para>Pour d&eacute;finir la taille par d&eacute;faut de la fen&ecirc;tre
de lecture, choisissez Pr&eacute;f&eacute;rences d'exploration sur le menu
Options et sp&eacute;cifiez la nouvelle taille de G&eacute;om&eacute;trie
de l'explorateur. Pour obtenir des informations compl&eacute;mentaires sur
la sp&eacute;cification de pr&eacute;f&eacute;rences, consultez la section <!--XRef
content: 'Personnaliser le Gestionnaire des informations'--><xref role="JumpText"
linkend="INFOUG.Custom.mkr.1">.</para>
</sect2>
<sect2 id="INFOUG.Rdbooks.div.6">
<title id="INFOUG.Rdbooks.mkr.6">Dupliquer une fen&ecirc;tre de lecture<indexterm>
<primary>fen&ecirc;tres</primary><secondary>fen&ecirc;tre de lecture</secondary>
<tertiary>dupliquer</tertiary></indexterm><indexterm><primary>fen&ecirc;tre
de lecture</primary><secondary>dupliquer</secondary></indexterm></title>
<para>Dans certaines circonstances, il sera peut-&ecirc;tre n&eacute;cessaire
d'afficher simultan&eacute;ment deux parties (ou plus) d'une longue section.
Pour ce faire, dupliquez la fen&ecirc;tre de lecture.</para>
<para>Pour dupliquer une fen&ecirc;tre de lecture, s&eacute;lectionnez Nouvelle
fen&ecirc;tre sur le menu Explorateur. Le Gestionnaire des informations ouvre
une autre fen&ecirc;tre de lecture affichant la m&ecirc;me section. Dans cette
seconde fen&ecirc;tre, passez &agrave; une partie de document diff&eacute;rente
de celle de la premi&egrave;re fen&ecirc;tre.</para>
</sect2>
<sect2 id="INFOUG.Rdbooks.div.7">
<title id="INFOUG.Rdbooks.mkr.7">Fermer une fen&amp;ecirc;tre de lecture<indexterm>
<primary>fen&ecirc;tre de lecture</primary><secondary>fermer</secondary></indexterm><indexterm>
<primary>fen&ecirc;tres</primary><secondary>fen&ecirc;tre de lecture</secondary>
<tertiary>fermer</tertiary></indexterm></title>
<para>Pour ferner une fen&ecirc;tre de lecture, choisissez Fermer sur le menu
Explorateur. La fermeture d'une fen&ecirc;tre de lecture n'entra&icirc;ne
pas votre sortie du Gestionnaire des informations.</para>
<para>Pour quitter le Gestionnaire des informations, choisissez Quitter sur
le menu Explorateur.</para>
</sect2>
</sect1>
<sect1 id="INFOUG.Rdbooks.div.8">
<title id="INFOUG.Rdbooks.mkr.8">Lire un livre dans l'ordre des sections<indexterm>
<primary>naviguer</primary><secondary>lire dans l'ordre des sections</secondary>
</indexterm></title>
<para>La structure traditionnelle des livres du Gestionnaire des informations
sugg&egrave;re une mani&egrave;re bien connue de vous d&eacute;placer dans
une biblioth&egrave;que d'informations. Vous pouvez consulter les livres &agrave;
l'aide d'utilitaires tels que la Table des mati&egrave;res. Vous pouvez &eacute;galement
passer d'une section &agrave; la suivante dans leur ordre d'insertion.</para>
<para>Pour parcourir un livre dans l'ordre sugg&eacute;r&eacute; des sections,
cliquez sur les boutons Section pr&eacute;c&eacute;dente et Section suivante
(situ&eacute;s sur la barre d'outils de la fen&amp;ecirc;tre de lecture) pour
passer, respectivement, aux sections ant&eacute;rieures ou ult&eacute;rieures.
</para>
<graphic id="INFOUG.Rdbooks.igrph.4" entityref="INFOUG.Rdbooks.fig.4"></graphic>
<para>La fl&egrave;che vers le haut vous fait passer &agrave; la section pr&eacute;c&eacute;dente.
Si vous vous trouvez d&eacute;j&agrave; dans la premi&egrave;re section, cette
fl&egrave;che n'est pas disponible.</para>
<para>La fl&egrave;che vers le bas vous am&egrave;ne &agrave; la section suivante.
Si vous vous trouvez d&eacute;j&agrave; dans la derni&egrave;re section, cette
fl&egrave;che est estomp&eacute;e.</para>
<para>Pour pr&eacute;visualiser la section suivante ou pr&eacute;c&eacute;dente,
placez le pointeur sur une des fl&egrave;ches de parcours Section pr&eacute;c&eacute;dente
ou Section suivante. Ensuite, cliquez tout en maintenant le bouton de la souris.
Le Gestionnaire des informations affiche le titre de la section suivante ou
pr&eacute;c&eacute;dente dans la zone de message. Si vous pr&eacute;f&eacute;rez
ne pas aller &agrave; la section indiqu&eacute;e, d&eacute;placez le pointeur
de la fl&egrave;che avant de rel&acirc;cher le bouton de la souris.</para>
<para>D&egrave;s que vous vous trouvez dans une section, d&eacute;placez-vous
dans celle-ci &agrave; l'aide de la barre de d&eacute;filement, des touches
Page pr&eacute;c. et Page suiv., ou des Fl&egrave;ches vers le haut et vers
le bas.</para>
</sect1>
</chapter>
<?Pub *0000017568>
