<!-- $XConsortium: ch04.sgm /main/2 1996/12/17 15:36:24 rws $ -->
<!-- (c) Copyright 1996 Digital Equipment Corporation. -->
<!-- (c) Copyright 1996 Hewlett-Packard Company. -->
<!-- (c) Copyright 1996 International Business Machines Corp. -->
<!-- (c) Copyright 1996 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1996 Novell, Inc. -->
<!-- (c) Copyright 1996 FUJITSU LIMITED. -->
<!-- (c) Copyright 1996 Hitachi. -->
<chapter id="INFOUG.Search.div.1">
<title id="INFOUG.Search.mkr.1">Rechercher des informations</title>
<para>Lorsque vous avez besoin d'informations sp&eacute;cifiques, proc&eacute;der
&agrave; une r&eacute;elle recherche est nettement plus efficace que simplement
explorer. Le Gestionnaire des informations propose une panoplie compl&egrave;te
de fonctionnalit&eacute;s de recherche vous permettant de:</para>
<itemizedlist>
<listitem><para>Proc&eacute;der &agrave; des recherches rapides &agrave; l'aide
de simples crit&egrave;res de recherche. Voir <xref role="JumpText" linkend="INFOUG.Search.div.2">.
</para>
</listitem>
<listitem><para>Effectuer des recherches d&eacute;taill&eacute;es gr&acirc;ce
&agrave; l'Editeur de requ&ecirc;tes. Voir <xref role="JumpText" linkend="INFOUG.Search.div.5">.
</para>
</listitem>
<listitem><para>D&eacute;finir l'&eacute;tendue des recherches de mani&egrave;re
&agrave; couvrir une seule section, ou des livres et types d'informations
sp&eacute;cifiques. Voir <xref role="JumpText" linkend="INFOUG.Search.div.10">.
</para>
</listitem>
<listitem><para>Afficher les r&eacute;sultats de la recherche et lire les
sections contenant des r&eacute;sultats correspondants. Voir <xref role="JumpText"
linkend="INFOUG.Search.div.22">.</para>
</listitem>
</itemizedlist>
<note>
<para>Pour r&eacute;duire la taille de la base de donn&eacute;es de recherche,
le Gestionnaire des informations n'effectue pas de recherches sur de nombreux
mots courants tels que: <wordasword>et</wordasword>, <wordasword>mais</wordasword>, <wordasword>ou</wordasword>, <wordasword>le</wordasword>, <wordasword>etc.</wordasword></para>
</note>
<sect1 id="INFOUG.Search.div.2">
<title id="INFOUG.Search.mkr.2">Rechercher rapidement<indexterm><primary>rechercher</primary><secondary>m&eacute;thode rapide</secondary></indexterm><indexterm>
<primary>recherche rapide</primary></indexterm></title>
<para>Pour proc&eacute;der &agrave; une recherche rapide sur un simple mot
ou une phrase, utilisez le champ de recherche rapide au bas de la fen&ecirc;tre
de lecture. Entrez le texte recherch&eacute; manuellement ou en affichant
en surbrillance une cha&icirc;ne de texte existante puis en choisissant l'option
S&eacute;lection sur le menu Rechercher.</para>
<figure>
<title id="INFOUG.Search.mkr.2a">Champ de recherche rapide</title>
<graphic id="INFOUG.Search.igrph.1" entityref="INFOUG.Search.fig.1"></graphic>
</figure>
<sect2 id="INFOUG.Search.div.3">
<title id="INFOUG.Search.mkr.3">Lancer une recherche rapide<indexterm><primary>recherche rapide</primary><secondary>lancer</secondary></indexterm><indexterm>
<primary>lancer</primary><secondary>recherche rapide</secondary></indexterm></title>
<para>Pour initialiser une recherche &agrave; partir du champ de recherche
rapide:</para>
<orderedlist>
<listitem><para>Placez le pointeur dans le champ de recherche rapide et, si
n&eacute;cessaire, supprimez le texte existant.</para>
</listitem>
<listitem><para>Tapez le texte &agrave; rechercher.</para>
<para>Lorsque vous placez le pointeur dans le champ de recherche rapide, le
bouton Etendue de recherche, &agrave; gauche du champ, identifie l'&eacute;tendue
&agrave; utiliser pour la recherche. Si l'&eacute;tendue indiqu&eacute;e est
celle que vous souhaitez utiliser, omettez les &eacute;tapes 3 et 4. Pour
obtenir des informations sur les &eacute;tendues de recherches, consultez
la section <xref role="JumpText" linkend="INFOUG.Search.mkr.10">.</para>
</listitem>
<listitem><para>Cliquez sur le bouton Etendue de recherche. Le Gestionnaire
des informations affiche la liste des &eacute;tendues de recherche disponibles.
</para>
<figure>
<title id="INFOUG.Search.mkr.3a">Liste des &eacute;tendues de recherche</title>
<graphic id="INFOUG.Search.igrph.2" entityref="INFOUG.Search.fig.2"></graphic>
</figure>
</listitem>
<listitem><para>Cliquez sur l'&eacute;tendue sur laquelle effectuer la recherche.
</para>
</listitem>
<listitem><para>Appuyez sur la touche Retour pour lancer la recherche.</para>
<para>Le Gestionnaire des informations affiche les valeurs concordantes dans
la fen&ecirc;tre R&eacute;sultats de la recherche. Pour passer &agrave; une
section contenant une cha&icirc;ne concordante, cliquez deux fois sur le titre
de la section dans la fen&ecirc;tre R&eacute;sultats de la recherche.</para>
</listitem>
</orderedlist>
<para>Pour cr&eacute;er des crit&egrave;res de recherche plus d&eacute;taill&eacute;s,
utilisez l'Editeur de requ&ecirc;tes.</para>
</sect2>
<sect2 id="INFOUG.Search.div.4">
<title id="INFOUG.Search.mkr.4">Rechercher la s&eacute;lection<indexterm>
<primary>recherche rapide</primary><secondary>s&eacute;lection</secondary>
</indexterm><indexterm><primary>S&eacute;lection, rechercher</primary></indexterm></title>
<para>Pour proc&eacute;der &agrave; une recherche rapide en utilisant le texte
en surbrillance:</para>
<orderedlist>
<listitem><para>Affichez en surbrillance le texte qui fera l'objet de la recherche.
(Placez le pointeur au d&eacute;but du texte. Maintenez le bouton 1 de la
souris enfonc&eacute; et faites glisser le rectangle de s&eacute;lection jusqu'&agrave;
la fin du texte.)</para>
<note>
<para>Le texte en surbrillance ne doit pas se trouver dans la fen&ecirc;tre
de lecture. Il peut se trouver dans une fen&ecirc;tre quelconque de votre
syst&egrave;me.</para>
</note>
</listitem>
<listitem><para>Choisissez S&amp;eacute;lection sur le menu Rechercher de
la fen&ecirc;tre de lecture.</para>
<para>Le Gestionnaire des informations affiche le texte affich&eacute; en
surbrillance dans le champ de recherche rapide et lance la recherche.</para>
</listitem>
</orderedlist>
</sect2>
</sect1>
<sect1 id="INFOUG.Search.div.5">
<title id="INFOUG.Search.mkr.5">D&eacute;finir des recherches d&eacute;taill&eacute;es<indexterm>
<primary>rechercher</primary><secondary>m&eacute;thode d&eacute;taill&eacute;e</secondary></indexterm></title>
<para>Les recherches d&eacute;taill&eacute;es vous permettent de produire
des concordances plus pr&eacute;cises dans vos r&eacute;sultats de recherche.
Pour d&eacute;finir une requ&ecirc;te d&eacute;taill&eacute;e, utilisez l'Editeur
de requ&ecirc;tes et proc&eacute;dez aux op&eacute;rations suivantes:</para>
<itemizedlist>
<listitem><para>Entrer une requ&ecirc;te d&eacute;taill&eacute;e. Voir <xref
role="JumpText" linkend="INFOUG.Search.div.6">.</para>
</listitem>
<listitem><para>Sp&eacute;cifier le pr&eacute;fixe de requ&ecirc;te. Voir <xref
role="JumpText" linkend="INFOUG.Search.div.7">.</para>
</listitem>
<listitem><para>D&eacute;finir des relations dans la requ&ecirc;te. Voir <xref
role="JumpText" linkend="INFOUG.Search.div.8">.</para>
</listitem>
</itemizedlist>
<para>Vous pouvez &eacute;galement d&eacute;finir l'&eacute;tendue de la recherche
&agrave; partir de l'Editeur de requ&ecirc;tes. Pour des informations compl&eacute;mentaires,
consultez la section <xref role="JumpText" linkend="INFOUG.Search.mkr.10">.
</para>
<sect2 id="INFOUG.Search.div.6">
<title id="INFOUG.Search.mkr.6">Entrer une requ&ecirc;te de recherche d&eacute;taill&eacute;e<indexterm>
<primary>rechercher</primary><secondary>entrer des requ&ecirc;tes</secondary>
</indexterm></title>
<para>Pour entrer une requ&ecirc;te de recherche d&eacute;taill&eacute;e:
</para>
<orderedlist>
<listitem><para>Ouvrez l'Editeur de requ&ecirc;tes en choisissant Editeur
de requ&amp;ecirc;tes sur le menu Rechercher dans une fen&ecirc;tre de lecture.
Le Gestionnaire des informations affiche la fen&ecirc;tre Editeur de requ&amp;ecirc;tes.
</para>
<figure>
<title id="INFOUG.Search.mkr.6a">Fen&ecirc;tre de l'Editeur de requ&amp;ecirc;tes</title>
<graphic id="INFOUG.Search.igrph.3" entityref="INFOUG.Search.fig.3"></graphic>
</figure>
</listitem>
<listitem><para>Cliquez sur le bouton Pr&eacute;fixe. L'Editeur de requ&amp;ecirc;tes
affiche la liste des pr&eacute;fixes. Cliquez sur le pr&eacute;fixe &agrave;
utiliser pour la requ&ecirc;te: Contient, Ne contient pas, Commence par,
ou Ne commence pas par.</para>
</listitem>
<listitem><para>Tapez le premier terme de la recherche dans le champ de saisie
&agrave; droite du bouton Pr&eacute;fixe.</para>
</listitem>
<listitem><para>Pour inclure un autre terme dans la recherche, cliquez sur
le bouton de connexion &agrave; droite du champ de saisie. L'Editeur de requ&amp;ecirc;tes
affiche la liste des connexions. S&eacute;lectionnez la connexion &agrave;
utiliser pour la requ&ecirc;te: Ou ou Et. R&eacute;p&eacute;tez les &eacute;tapes
2 &agrave; 4 jusqu'&agrave; la fin de la requ&ecirc;te.</para>
</listitem>
<listitem><para>Appuyez sur la touche Retour ou cliquez sur le bouton Rechercher
pour lancer la recherche. Le Gestionnaire des informations affiche les valeurs
correspondantes identifi&eacute;es dans la fen&ecirc;tre R&eacute;sultats
de la recherche. La figure <xref role="JumpText" linkend="INFOUG.Search.mkr.22a">
repr&eacute;sente une fen&ecirc;tre R&eacute;sultats de la recherche.</para>
</listitem>
</orderedlist>
<para>A mesure que vous cr&eacute;ez votre requ&ecirc;te, l'Editeur de requ&ecirc;tes
affiche la requ&ecirc;te telle qu'elle est d&eacute;finie dans la zone d'affichage
Requ&ecirc;te au bas de la fen&ecirc;tre. La d&eacute;finition de la requ&ecirc;te
explique comment entrer la requ&ecirc;te &agrave; partir d'un champ de recherche
rapide.</para>
</sect2>
<sect2 id="INFOUG.Search.div.7">
<title id="INFOUG.Search.mkr.7">Sp&eacute;cifier le pr&eacute;fixe de la requ&ecirc;te<indexterm>
<primary>requ&ecirc;te</primary><secondary>sp&eacute;cifier le pr&eacute;fixe</secondary></indexterm><indexterm><primary>pr&eacute;fixe</primary><secondary>pour requ&ecirc;tes</secondary></indexterm></title>
<para>Pour commencer la sp&eacute;cification d'une requ&ecirc;te, utilisez
le bouton Pr&eacute;fixe pour indiquer si votre recherche <emphasis>Contient</emphasis>, <emphasis>Ne contient pas</emphasis>, <emphasis>Commence par</emphasis> ou <emphasis>Ne commence pas par</emphasis> le texte que vous
tapez dans le champ d'entr&eacute;e de recherche. Pour ce faire:</para>
<orderedlist>
<listitem><para>Cliquez sur le bouton Pr&eacute;fixe. L'Editeur de requ&amp;ecirc;tes
affiche la liste des pr&eacute;fixes.</para>
</listitem>
<listitem><para>Cliquez sur le pr&eacute;fixe &agrave; utiliser pour votre
requ&ecirc;te:</para>
<variablelist>
<varlistentry><term>Contient</term>
<listitem>
<para>Localise les sections contenant le texte &agrave; rechercher.</para>
</listitem>
</varlistentry>
<varlistentry><term>Ne contient pas</term>
<listitem>
<para>Localise des sections ne contenant pas le texte &agrave; rechercher.
</para>
</listitem>
</varlistentry>
<varlistentry><term>Commence par</term>
<listitem>
<para>Localise les sections contenant des mots commen&ccedil;ant par le texte
&agrave; rechercher.</para>
</listitem>
</varlistentry>
<varlistentry><term>Ne commence pas par</term>
<listitem>
<para>Localise les sections ne contenant pas les mots commen&ccedil;ant par
le texte &agrave; rechercher.</para>
</listitem>
</varlistentry>
</variablelist>
</listitem>
</orderedlist>
<para>D&egrave;s que vous s&eacute;lectionnez le pr&eacute;fixe, l'Editeur
de requ&ecirc;tes l'affiche sur le bouton Pr&eacute;fixe. Entrez ensuite le
reste de votre requ&ecirc;te.</para>
</sect2>
<sect2 id="INFOUG.Search.div.8">
<title id="INFOUG.Search.mkr.8">D&eacute;finir des relations dans la requ&ecirc;te<indexterm>
<primary>requ&ecirc;te</primary><secondary>d&eacute;finir des relations</secondary>
</indexterm><indexterm><primary>relations</primary><secondary>d&eacute;finir,
dans une requ&ecirc;te</secondary></indexterm></title>
<para>L'Editeur de requ&amp;ecirc;tes vous permet d'inclure plusieurs mots
ou phrases dans une recherche. Pour sp&eacute;cifier une relation entre les
diverses parties d'une requ&ecirc;te, utilisez le bouton de connexion (&agrave;
droite du champ de saisie) pour afficher la liste Connexions. A partir de
la liste Connexions, s&eacute;lectionnez la relation d&eacute;sir&eacute;e.
Vous pouvez sp&eacute;cifier que la partie actuelle ET la partie suivante
de la requ&ecirc;te doivent se r&eacute;v&eacute;ler vraies, ou qu'une seule
partie doit se produire. En d'autres termes, une relation d&eacute;finit les
crit&egrave;res d'obtention d'une concordance valide.</para>
<para>Pour d&eacute;finir une relation:</para>
<orderedlist>
<listitem><para>Sp&eacute;cifiez le pr&eacute;fixe et le texte de recherche
de la premi&egrave;re partie de la requ&ecirc;te.</para>
</listitem>
<listitem><para>Cliquez sur le bouton de connexion. L'Editeur de requ&amp;ecirc;tes
affiche la liste Connexions.</para>
</listitem>
<listitem><para>Cliquez sur l'op&eacute;rateur logique destin&eacute; &agrave;
la relation que vous souhaitez d&eacute;finir:</para>
<variablelist>
<varlistentry><term>Ou</term>
<listitem>
<para>Localise les sections contenant une cha&icirc;ne correspondant &agrave;
la partie actuelle de la requ&ecirc;te OU &agrave; la partie suivante de la
requ&ecirc;te, ou aux deux.</para>
</listitem>
</varlistentry>
<varlistentry><term>Et</term>
<listitem>
<para>Localise les sections contenant une cha&icirc;ne correspondant &agrave;
la partie actuelle de la requ&ecirc;te ET &agrave; la partie suivante de la
requ&ecirc;te.</para>
</listitem>
</varlistentry>
</variablelist>
</listitem>
</orderedlist>
<para>D&egrave;s que vous en s&eacute;lectionnez une, l'Editeur de requ&ecirc;tes
affiche la connexion choisie (l'op&eacute;rateur logique) sur le bouton de
connexion et entame la ligne suivante de la requ&ecirc;te.</para>
</sect2>
</sect1>
<sect1 id="INFOUG.Search.div.10">
<title id="INFOUG.Search.mkr.10">D&eacute;finir l'&eacute;tendue des recherches<indexterm>
<primary>rechercher</primary><secondary>d&eacute;finir l'&eacute;tendue</secondary>
</indexterm><indexterm><primary>&eacute;tendue</primary><secondary>d&eacute;finir</secondary></indexterm></title>
<para>Les &eacute;tendues vous permettent de limiter l'envergure de vos recheches.
Elle r&eacute;duisent la taille des listes de r&eacute;sultats de recherche
en les limitant &agrave; des concordances plus significatives. De mani&egrave;re
plus pr&eacute;cise, vous pouvez utiliser des <firstterm>&eacute;tendues de
recherche</firstterm> pour limiter les livres et types de donn&eacute;es (des
tables, par exemple) qui seront incluses dans une recherche.</para>
<para>Le Gestionnaire des informations propose des &eacute;tendues permettant
de rechercher parmi la section en cours, toute la biblioth&egrave;que d'informations
ou un rayon sp&eacute;cifique. Ces &eacute;tendues de recherche pr&eacute;-d&eacute;finies
incluent tous les types de donn&eacute;es, y compris les titres, le corps
du texte, les index, les tables et les graphiques. Vous pouvez d&eacute;finir
des &eacute;tendues de recherche personnalis&eacute;es afin de sp&eacute;cifier
les livres et les types de donn&eacute;es que vous incluez d'habitude dans
vos recherches.</para>
<para>Le reste de cette section propose des informations sur:</para>
<itemizedlist>
<listitem><para><xref role="JumpText" linkend="INFOUG.Search.div.13"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Search.div.16"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Search.div.19"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Search.div.20"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Search.div.21"></para>
</listitem>
</itemizedlist>
<sect2 id="INFOUG.Search.div.13">
<title id="INFOUG.Search.mkr.13">S&eacute;lectionner une &eacute;tendue de
recherche<indexterm><primary>rechercher</primary><secondary>s&eacute;lectionner
des &eacute;tendues</secondary></indexterm><indexterm><primary>&eacute;tendue</primary><secondary>s&eacute;lectionner</secondary></indexterm></title>
<para>Lorsque vous d&eacute;marrez une recherche, le logiciel utilise par
d&eacute;faut la derni&egrave;re &eacute;tendue sp&eacute;cifi&eacute;e pour
cette zone de recherche. La fen&ecirc;tre de lecture et l'Editeur de requ&ecirc;tes
maintiennent leurs propres &eacute;tendues de recherche par d&eacute;faut.
</para>
<para>Par exemple, lorsque vous lancez une recherche &agrave; partir de la
fen&ecirc;tre de lecture, le Gestionnaire des informations utilise la derni&egrave;re
&eacute;tendue de la recherche utilis&eacute;e. Si vous n'avez pas encore
effectu&eacute; de recherche au cours de cette session d'exploration, le Gestionnaire
des informations utilise la section en cours comme &eacute;tendue des recherches
lanc&eacute;es &agrave; partir de la fen&ecirc;tre de lecture. Il utilise
Toutes les biblioth&egrave;ques comme &eacute;tendue par d&eacute;faut pour
les recherches &eacute;manant de l'Editeur de requ&ecirc;tes.</para>
<para>Vous pouvez s&eacute;lectionner une autre &eacute;tendue de recherche
&agrave; l'aide du bouton Etendue de recherche au bas de la fen&ecirc;tre
de lecture. Ou alors, utilisez le bouton Nom d'&eacute;tendue dans l'Editeur
de requ&ecirc;tes.</para>
<sect3 id="INFOUG.Search.div.14">
<title id="INFOUG.Search.mkr.14">S&eacute;lectionner une &eacute;tendue &agrave;
partir de la fen&ecirc;tre de lecture</title>
<para>Utilisez le bouton Etendue de recherche pour identifier les livres &agrave;
inclure dans les recherches d&eacute;marr&eacute;es &agrave; partir du champ
de recherche rapide. Pour utiliser une &eacute;tendue de recherche autre que
celle qui est affich&eacute;e:</para>
<orderedlist>
<listitem><para>Cliquez sur le bouton Etendue de recherche &agrave; gauche
du champ de recherche rapide. Le Gestionnaire des informations affiche la
liste des &eacute;tendues de recherche. Cette liste regroupe les &eacute;tendues
pr&eacute;-d&eacute;finies ainsi que toute &eacute;tendue cr&eacute;&eacute;e
et enregistr&eacute;e &agrave; l'aide de l'Editeur d'&eacute;tendues.</para>
</listitem>
<listitem><para>S&eacute;lectionnez l'&eacute;tendue de recherche &agrave;
utiliser. Le Gestionnaire des informations remplace le nom d'&eacute;tendue
pr&eacute;c&eacute;dent par le nouveau nom d'&eacute;tendue sur le bouton
Etendue de recherche. La nouvelle &eacute;tendue reste en vigueur pour le
reste de la session o&ugrave; jusqu'&agrave; ce que vous la modifiiez.</para>
</listitem>
</orderedlist>
</sect3>
<sect3 id="INFOUG.Search.div.15">
<title id="INFOUG.Search.mkr.15">S&eacute;lectionner une &eacute;tendue &agrave;
partir de l'Editeur de requ&ecirc;tes</title>
<para>Vous pouvez utiliser le bouton Nom d'&eacute;tendue pour identifier
les livres auxquels &eacute;tendre les recherches lanc&eacute;es &agrave;
l'aide de l'Editeur de requ&ecirc;tes. Pour utiliser une &eacute;tendue de
recherche diff&eacute;rente de l'&eacute;tendue sugg&eacute;r&eacute;e:</para>
<orderedlist>
<listitem><para>Cliquez sur le bouton Nom d'&amp;eacute;tendue. Le syst&egrave;me
affiche la liste des noms des &eacute;tendues de recherche disponibles. Cette
liste contient &agrave; la fois les &eacute;tendues pr&eacute;-d&eacute;finies
et cr&eacute;&eacute;es par l'utilisateur.</para>
</listitem>
<listitem><para>A partir de la liste des noms d'&eacute;tendue, s&eacute;lectionnez
l'&eacute;tendue &agrave; utiliser.</para>
</listitem>
</orderedlist>
</sect3>
</sect2>
<sect2 id="INFOUG.Search.div.16">
<title id="INFOUG.Search.mkr.16">Cr&eacute;er des &eacute;tendues de recherche<indexterm>
<primary>rechercher</primary><secondary>cr&eacute;er des &eacute;tendues</secondary>
</indexterm><indexterm><primary>&eacute;tendue</primary><secondary>cr&eacute;er</secondary></indexterm></title>
<para>Si vous explorez fr&eacute;quemment une partie de la biblioth&egrave;que
d'informations &agrave; la recherche d'informations sp&eacute;cifiques, il
sera peut-&ecirc;tre utile de cr&eacute;er et d'enregistrer une &eacute;tendue
de recherche personnalis&eacute;e. Cr&eacute;ez ou modifiez vos &eacute;tendues
de recherche &agrave; l'aide de l'Editeur d'&eacute;tendues.<indexterm><primary>Editeur d'&eacute;tendues</primary></indexterm></para>
<sect3 id="INFOUG.Search.div.17">
<title id="INFOUG.Search.mkr.17">Ouvrir l'Editeur d'&eacute;tendues de recherche<indexterm>
<primary>rechercher</primary><secondary>Editeur d'&eacute;tendues</secondary>
</indexterm><indexterm><primary>Editeur d'&eacute;tendues</primary><secondary>ouvrir</secondary></indexterm><indexterm><primary>&eacute;tendue</primary>
<secondary>ouvrir l'Editeur</secondary></indexterm></title>
<para>Pour ouvrir l'Editeur d'&eacute;tendues &agrave; partir de l'Editeur
de requ&ecirc;tes, cliquez sur le bouton Editeur d'&eacute;tendues au bas
de la fen&ecirc;tre Editeur de requ&amp;ecirc;tes.</para>
<para>Pour ouvrir l'Editeur d'&eacute;tendues &agrave; partir de la fen&ecirc;tre
de lecture, cliquez sur le bouton Editeur d'&eacute;tendues dans le coin inf&eacute;rieur
droit de la fen&ecirc;tre ou choisissez Editeur d'&eacute;tendues sur le menu
Rechercher.</para>
<para>Le Gestionnaire des informations affiche l'Editeur d'&eacute;tendues,
comme le montre la figure suivante.</para>
<figure>
<title id="INFOUG.Search.mkr.16a">Fen&ecirc;tre de l'Editeur d'&eacute;tendues</title>
<graphic id="INFOUG.Search.igrph.4" entityref="INFOUG.Search.fig.4"></graphic>
</figure>
</sect3>
<sect3 id="INFOUG.Search.div.18">
<title id="INFOUG.Search.mkr.18">Cr&eacute;er une nouvelle &eacute;tendue
de recherche<indexterm><primary>Editeur d'&eacute;tendues</primary><secondary>cr&eacute;er une &eacute;tendue</secondary></indexterm><indexterm><primary>&eacute;tendue</primary><secondary>cr&eacute;er</secondary></indexterm></title>
<para>Le c&ocirc;t&eacute; gauche de la fen&ecirc;tre de l'Editeur d'&eacute;tendues
contient la liste des livres de la biblioth&egrave;que d'informations. Pour
&eacute;tendre ou r&eacute;duire cette liste, cliquez sur la fl&egrave;che
vers la droite ou vers la gauche qui pr&eacute;c&egrave;de chaque titre de
livre.</para>
<para>Le c&ocirc;t&eacute; droit de la fen&ecirc;tre de l'Editeur d'&eacute;tendues
contient la liste des composants de livre que vous pouvez inclure dans l'&eacute;tendue.
Par d&eacute;faut, le Gestionnaire des informations &eacute;tend votre recherche
&agrave; tous les composants.</para>
<para>Pour cr&eacute;er une nouvelle &eacute;tendue de recherche:</para>
<orderedlist>
<listitem><para>Cliquez sur le bouton Nouveau.</para>
</listitem>
<listitem><para>Cliquez sur les noms des livres et composants &agrave; inclure
dans l'&eacute;tendue.</para>
</listitem>
<listitem><para>Cliquez sur le bouton Enregistrer. Le Gestionnaire des informations
ouvre la fen&ecirc;tre Enregistrer l'&eacute;tendue repr&eacute;sent&eacute;e
par la figure suivante.</para>
<figure>
<title id="INFOUG.Search.mkr.18a">Fen&ecirc;tre Enregistrer l'&eacute;tendue</title>
<graphic id="INFOUG.Search.igrph.5" entityref="INFOUG.Search.fig.5"></graphic>
</figure>
</listitem>
<listitem><para>Tapez le nom de la nouvelle &eacute;tendue dans le champ de
saisie et cliquez sur OK. Le Gestionnaire des informations affiche le nom
de la nouvelle &eacute;tendue dans la fen&ecirc;tre de l'Editeur d'&amp;eacute;tendues.
</para>
</listitem>
</orderedlist>
<para>Pour utiliser la nouvelle &eacute;tendue dans une requ&ecirc;te, acc&eacute;dez-y
comme &agrave; toute autre &eacute;tendue pr&eacute;-d&eacute;finie.</para>
</sect3>
<sect3 id="INFOUG.Search.div.19">
<title id="INFOUG.Search.mkr.19">Modifier les &eacute;tendues de recherche<indexterm>
<primary>Editeur d'&eacute;tendues</primary><secondary>modifier l'&eacute;tendue</secondary></indexterm><indexterm><primary>&eacute;tendue</primary><secondary>modifier</secondary></indexterm></title>
<para>Pour modifier une &eacute;tendue existante:</para>
<orderedlist>
<listitem><para>Cliquez sur le bouton Nom d'&amp;eacute;tendue dans la fen&ecirc;tre
de l'Editeur d'&amp;eacute;tendues. Le Gestionnaire des informations affiche
la liste des &eacute;tendues.</para>
</listitem>
<listitem><para>S&eacute;lectionnez l'&eacute;tendue &agrave; modifier. Le
nom de l'&eacute;tendue s&eacute;lectionn&eacute;e appara&icirc;t sur le bouton
Nom d'&amp;eacute;tendue.</para>
</listitem>
<listitem><para>Pour remplacer les livres compris dans l'&eacute;tendue, affichez
en surbrillance les titres des livres &agrave; s&eacute;lectionner.</para>
</listitem>
<listitem><para>Pour modifier la liste des composants inclus dans l'&eacute;tendue,
affichez en surbrillance les noms des composants.</para>
</listitem>
<listitem><para>Cliquez sur le bouton Enregistrer pour sauvegarder ces modifications.
</para>
</listitem>
<listitem><para>Apr&egrave;s avoir apport&eacute; toutes les modifications
n&eacute;cessaires, cliquez sur le bouton Fermer.</para>
</listitem>
</orderedlist>
<note>
<para>Pour r&eacute;tablir la d&eacute;finition initiale de l'&eacute;tendue,
cliquez sur le bouton Restaurer au bas de la fen&ecirc;tre.</para>
</note>
<para>Le Gestionnaire des informations m&eacute;morise en tant qu'&eacute;tendue
en cours celle que vous utilisez pr&eacute;alablement pour vos recherches.
Si vous avez apport&eacute; des modifications &agrave; l'&eacute;tendue en
cours, le Gestionnaire des informations applique ces modifications &agrave;
la prochaine recherche effectu sur cette &eacute;tendue.</para>
</sect3>
<sect3 id="INFOUG.Search.div.20">
<title id="INFOUG.Search.mkr.20">Copier des &eacute;tendues de recherche<indexterm>
<primary>Editeur d'&eacute;tendues</primary><secondary>copier une &eacute;tendue</secondary></indexterm><indexterm><primary>&eacute;tendue</primary><secondary>copier</secondary></indexterm></title>
<para>Pour copier une &eacute;tendue de recherche:</para>
<orderedlist>
<listitem><para>Cliquez sur le bouton Nom d'&amp;eacute;tendue dans la fen&ecirc;tre
de l'Editeur d'&amp;eacute;tendues. Le Gestionnaire des informations affiche
la liste des &eacute;tendues.</para>
</listitem>
<listitem><para>S&eacute;lectionnez l'&eacute;tendue &agrave; copier. Le nom
de l'&eacute;tendue s&eacute;lectionn&eacute;e appara&icirc;t sur le bouton
Nom d'&amp;eacute;tendue.</para>
</listitem>
<listitem><para>Cliquez sur le bouton Copier au bas de la fen&ecirc;tre. Le
Gestionnaire des informations affiche la fen&ecirc;tre Enregistrer l'&eacute;tendue.
</para>
</listitem>
<listitem><para>Tapez le nom de la copie et cliquez sur OK pour l'enregistrer.
</para>
</listitem>
</orderedlist>
<para>Notez que l'&eacute;tendue existe toujours sous son nom initial. La
section <xref role="JumpText" linkend="INFOUG.Search.mkr.21"> explique comment
supprimer les &eacute;tendues superflues.</para>
</sect3>
<sect3 id="INFOUG.Search.div.21">
<title id="INFOUG.Search.mkr.21">Supprimer des &eacute;tendues de recherche<indexterm>
<primary>Editeur d'&eacute;tendues</primary><secondary>supprimer une &eacute;tendue</secondary></indexterm><indexterm><primary>&eacute;tendue</primary><secondary>supprimer</secondary></indexterm></title>
<para>Pour supprimer une &eacute;tendue de recherche pr&eacute;alablement
enregistr&eacute;e:</para>
<orderedlist>
<listitem><para>Cliquez sur le bouton Nom d'&amp;eacute;tendue dans la fen&ecirc;tre
de l'Editeur d'&amp;eacute;tendues. Le Gestionnaire des informations affiche
la liste des &eacute;tendues.</para>
</listitem>
<listitem><para>S&eacute;lectionnez l'&eacute;tendue &agrave; supprimer. Le
nom de l'&eacute;tendue s&eacute;lectionn&eacute;e appara&icirc;t sur le bouton
Nom d'&amp;eacute;tendue.</para>
</listitem>
<listitem><para>Cliquez sur le bouton Supprimer au bas de la fen&ecirc;tre.
Le Gestionnaire des informations supprime l'&eacute;tendue et affiche l'&eacute;tendue
suivante dans la liste des &eacute;tendues.</para>
</listitem>
</orderedlist>
</sect3>
</sect2>
</sect1>
<sect1 id="INFOUG.Search.div.22">
<title id="INFOUG.Search.mkr.22">Consulter les r&eacute;sultats de la recherche<indexterm>
<primary>rechercher</primary><secondary>consulter les r&eacute;sultats</secondary>
</indexterm><indexterm><primary>r&eacute;sultats de la recherche</primary>
</indexterm></title>
<para>Lorsque vous effectuez une recherche, le Gestionnaire des informations
affiche la liste des sections contenant des valeurs correspondant &agrave;
la recherche. Cette liste appara&icirc;t dans la fen&ecirc;tre R&eacute;sultats
de la recherche. A partir de cette fen&ecirc;tre, passez &agrave; une des
sections list&eacute;es en cliquant simplement sur son titre.</para>
<para>La figure suivante illustre le mode d'affichage des concordances par
ordre d&eacute;croissant d'importance. L'ic&ocirc;ne &agrave; gauche du titre
du livre indique la fr&eacute;quence d'apparition du terme recherch&eacute;
dans la section donn&eacute;e.</para>
<figure>
<title id="INFOUG.Search.mkr.22a">Fen&ecirc;tre R&eacute;sultats de la recherche</title>
<graphic id="INFOUG.Search.igrph.6" entityref="INFOUG.Search.fig.6"></graphic>
</figure>
<para>Si la liste R&eacute;sultats de la recherche vous semble incompl&egrave;te,
trop longue ou erron&eacute;e, v&eacute;rifiez que vous utilisez bien l'&eacute;tendue
de recherche appropri&eacute;e. V&eacute;rifiez &eacute;galement votre r&eacute;glage
de pr&eacute;f&eacute;rence concernant le maximum de correspondances.</para>
<para>Lors de l'ex&eacute;cution de recherches multiples, nous vous conseillons
d'ancrer la premi&egrave;re fen&ecirc;tre R&eacute;sultats de la recherche.
De cette mani&egrave;re, lorsque vous proc&eacute;dez &agrave; une autre recherche,
les nouveaux r&eacute;sultats ne remplaceront pas ceux de la premi&egrave;re
recherche. Au contraire, ils seront affich&eacute;s dans une fen&ecirc;tre
distincte de R&eacute;sultats de la recherche.</para>
<sect2 id="INFOUG.Search.div.23">
<title id="INFOUG.Search.mkr.23">Parcourir les correspondances de la recherche<indexterm>
<primary>rechercher</primary><secondary>parcourir les correspondances</secondary>
</indexterm><indexterm><primary>R&eacute;sultats de la recherche</primary>
<secondary>parcourir les correspondances</secondary></indexterm><indexterm>
<primary>r&eacute;ponses pertinentes</primary></indexterm></title>
<para>Apr&egrave;s vous &ecirc;tre rendu &agrave; une section &agrave; partir
de votre liste R&eacute;sultats de la recherche, il sera peut-&ecirc;tre n&eacute;cessaire
de consulter chaque correspondance (ou <emphasis>r&eacute;ponse pertinente</emphasis>) figurant dans la section. Les correspondances sont affich&eacute;es
en gras, soulign&eacute;es et dans une couleur diff&eacute;rente. La correspondance
sur laquelle vous vous trouvez actuellement est &eacute;galement encadr&eacute;e
d'un rectangle de pointill&eacute;s.</para>
<para>Pour parcourir les r&eacute;ponses pertinente<?Pub Caret> au sein d'une
section, utilisez les boutons Recherche suivante et Recherche pr&eacute;c&eacute;dente
de la barre d'outils de la fen&ecirc;tre de lecture. (Vous pouvez aussi choisir
Recherche suivante et Recherche pr&eacute;c&eacute;dente sur le menu Aller.)
</para>
<graphic id="INFOUG.Search.igrph.7" entityref="INFOUG.Search.fig.7"></graphic>
<para>Recherche suivante affiche la correspondance ou <emphasis>r&eacute;ponse
pertinente</emphasis> suivante. Recherche pr&eacute;c&eacute;dente affiche
la correspondance pr&eacute;c&eacute;dente.</para>
<para>Si vous vous trouvez sur la derni&egrave;re correspondance de la section,
le bouton Recherche suivante est estomp&eacute; (affich&eacute; en gris).
Si vous trouvez sur la premi&egrave;re correspondance de la section, le bouton
Recherche pr&eacute;c&eacute;dente est estomp&eacute;.</para>
</sect2>
<sect2 id="INFOUG.Search.div.24">
<title id="INFOUG.Search.mkr.24">Revoir les r&eacute;sultats d'une recherche
pr&eacute;c&eacute;dente<indexterm><primary>rechercher</primary><secondary>revoir les r&eacute;sultats pr&eacute;c&eacute;dents</secondary></indexterm><indexterm>
<primary>R&eacute;sultats de la recherche</primary><secondary>revoir les pr&eacute;c&eacute;dents</secondary></indexterm></title>
<para>Si vous omettez d'ancrer les r&eacute;sultats d'une recherche pr&eacute;c&eacute;dente,
il est toujours possible de r&eacute;cup&eacute;rer cette liste. Pour revoir
une liste R&eacute;sultats de la recherche ant&eacute;rieure:</para>
<orderedlist>
<listitem><para>Choisissez Historique de la recherche sur le menu Rechercher
d'une fen&ecirc;tre de lecture quelconque.</para>
<para>Le Gestionnaire des informations affiche la fen&ecirc;tre Historique
de la recherche.</para>
<figure>
<title id="INFOUG.Search.mkr.24a">Fen&ecirc;tre Historique de la recherche</title>
<graphic id="INFOUG.Search.igrph.8" entityref="INFOUG.Search.fig.8"></graphic>
</figure>
</listitem>
<listitem><para>Cliquez deux fois sur la recherche dont vous souhaitez consulter
les r&eacute;sultats.</para>
<para>Le Gestionnaire des informations affiche la fen&ecirc;tre R&eacute;sultats
de la recherche de la recherche s&eacute;lectionn&eacute;e.</para>
</listitem>
</orderedlist>
<para>Vous ne pouvez r&eacute;cup&eacute;rer de la sorte que les r&eacute;sultats
des recherches effectu&eacute;es au cours de la session d'exploration en cours.
</para>
</sect2>
</sect1>
</chapter>
<?Pub *0000036750>
