<!-- $XConsortium: ch05.sgm /main/2 1996/12/17 15:36:32 rws $ -->
<!-- (c) Copyright 1996 Digital Equipment Corporation. -->
<!-- (c) Copyright 1996 Hewlett-Packard Company. -->
<!-- (c) Copyright 1996 International Business Machines Corp. -->
<!-- (c) Copyright 1996 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1996 Novell, Inc. -->
<!-- (c) Copyright 1996 FUJITSU LIMITED. -->
<!-- (c) Copyright 1996 Hitachi. -->
<chapter id="INFOUG.Bkmarks.div.1">
<title id="INFOUG.Bkmarks.mkr.1">Utiliser des signets et des notes<indexterm>
<primary>signets</primary><secondary>utiliser</secondary></indexterm></title>
<para>Il vous sera probablement utile d'identifier des sections sp&eacute;cifiques
ou d'ajouter des commentaires &agrave; un passage, comme vous le feriez dans
un livre imprim&eacute; traditionnel. Pour personnaliser les livres en ligne
de cette mani&egrave;re, vous pouvez cr&eacute;er des <firstterm>signets</firstterm>
et ins&eacute;rer des <firstterm>notes</firstterm> &agrave; c&ocirc;t&eacute;
de passages de texte ou d'&eacute;l&eacute;ments graphiques.</para>
<para>Un <emphasis>signet</emphasis> consiste donc essentiellement en une
marque d'emplacement. Une <emphasis>note</emphasis> est un signet annot&eacute;.
L'Explorateur repr&eacute;sente les signets et les notes par des ic&ocirc;nes
dans la marge gauche de la fen&ecirc;tre de lecture.</para>
<para>La figure suivante repr&eacute;sente un signet.</para>
<figure>
<title id="INFOUG.Bkmarks.mkr.1a">Un signet vierge</title>
<graphic id="INFOUG.Bkmarks.igrph.1" entityref="INFOUG.Bkmarks.fig.1"></graphic>
</figure>
<para>La figure suivante repr&eacute;sente une note.</para>
<figure>
<title id="INFOUG.Bkmarks.mkr.1b">Un signet avec note</title>
<graphic id="INFOUG.Bkmarks.igrph.2" entityref="INFOUG.Bkmarks.fig.2"></graphic>
</figure>
<para>Une ligne peut contenir plusieurs signets. La figure suivante repr&eacute;sente
des signets multiples.</para>
<figure>
<title id="INFOUG.Bkmarks.mkr.1c">Signets multiples</title>
<graphic id="INFOUG.Bkmarks.igrph.3" entityref="INFOUG.Bkmarks.fig.3"></graphic>
</figure>
<para>Les signets et notes que vous cr&eacute;ez dans le Gestionnaire des
informations sont priv&eacute;s. Les autres utilisateurs ne peuvent y acc&eacute;der.
Pour cr&eacute;er des signets et des notes, urilisez le menu Rep&egrave;res
de la fen&ecirc;tre de lecture.</para>
<sect1 id="INFOUG.Bkmarks.div.2">
<title id="INFOUG.Bkmarks.mkr.2">Cr&eacute;er des signets<indexterm><primary>signets</primary><secondary>cr&eacute;er</secondary></indexterm></title>
<para>Vous pouvez cr&eacute;er un signet vierge pour indiquer votre position,
ou cr&eacute;er un signet accompagn&eacute; de notes.</para>
<note>
<para>Il est toujours possible d'&eacute;diter un signet vierge existant pour
lui ajouter des notes.</para>
</note>
<sect2 id="INFOUG.Bkmarks.div.3">
<title id="INFOUG.Bkmarks.mkr.3">Cr&eacute;er un signet vierge<indexterm>
<primary>signets</primary><secondary>vierge, cr&eacute;er</secondary></indexterm><indexterm>
<primary>signet vierge</primary><secondary>cr&eacute;er</secondary></indexterm></title>
<para>Pour cr&eacute;er un signet vierge:</para>
<orderedlist>
<listitem><para>Affichez en surbrillance le texte ou l'&eacute;l&eacute;ment
graphique &agrave; rep&eacute;rer. (Placez le pointeur au d&eacute;but du
texte. Maintenez le bouton gauche de la souris enfonc&eacute; et faites glisser
le pointeur jusqu'&agrave; la fin du texte.)</para>
</listitem>
<listitem><para>Choisissez Cr&eacute;er un signet sur le menu Rep&egrave;res.
</para>
<para>Le Gestionnaire des informations affiche l'ic&ocirc;ne signet dans la
marge gauche de la ligne contenant le texte en surbrillance. Par d&eacute;faut,
le texte s&eacute;lectionn&eacute; est utilis&eacute; comme nom du signet.
Pour obtenir des informations sur la modification des noms de signet, consultez
la section<xref role="JumpText" linkend="INFOUG.Bkmarks.mkr.7">.</para>
</listitem>
</orderedlist>
</sect2>
<sect2 id="INFOUG.Bkmarks.div.4">
<title id="INFOUG.Bkmarks.mkr.4">Cr&eacute;er un signet avec notes<indexterm>
<primary>signets</primary><secondary>avec notes, cr&eacute;er</secondary>
</indexterm></title>
<para>Pour cr&eacute;er un signet avec notes:</para>
<orderedlist>
<listitem><para>Affichez en surbrillance le texte ou l'&eacute;l&eacute;ment
graphique &agrave; rep&eacute;rer.</para>
</listitem>
<listitem><para>Choisissez Cr&eacute;er une note sur le menu Rep&egrave;res.
</para>
<para>Le Gestionnaire des informations affiche l'Editeur de signets.</para>
</listitem>
<listitem><para>Tapez votre texte dans le champ Notes.</para>
</listitem>
<listitem><para>Cliquez sur OK pour enregistrer la note et refermer l'Editeur
de signets.</para>
</listitem>
</orderedlist>
<para>Vous pouvez aussi ajouter des notes &agrave; un signet vierge existant.
La section<xref role="JumpText" linkend="INFOUG.Bkmarks.div.7"> offre un compl&eacute;ment
d'information &agrave; ce sujet.</para>
</sect2>
</sect1>
<sect1 id="INFOUG.Bkmarks.div.5">
<title id="INFOUG.Bkmarks.mkr.5">Lister les signets<indexterm><primary>signets</primary><secondary>lister</secondary></indexterm></title>
<para>Pour afficher la liste de tous vos signets, choisissez Lister les signets
sur le menu Rep&egrave;res d'une fen&ecirc;tre de lecture quelconque. Le Gestionnaire
des informations affiche la fen&ecirc;tre Liste des signets de l'utilisateur
qui regroupe &agrave; la fois les signets vierges et annot&eacute;s.</para>
<para>Pour afficher la section dans laquelle appara&icirc;t un signet, cliquez
deux fois sur le nom du signet.</para>
</sect1>
<sect1 id="INFOUG.Bkmarks.div.6">
<title id="INFOUG.Bkmarks.mkr.6">Afficher les signets et notes<indexterm>
<primary>signets</primary><secondary>afficher</secondary></indexterm></title>
<para>Pour afficher un signet existant et les notes qui l'accompagnent, cliquez
deux fois sur l'ic&ocirc;ne du signet dans la fen&ecirc;tre de lecture. Le
Gestionnaire des informations ouvre la fen&ecirc;tre de l'Editeur de signets,
repr&eacute;sent&eacute;e par la f<?Pub Caret>igure suivante. L'Editeur de
signets permet de modifier le nom et les notes du signet.</para>
<figure>
<title id="INFOUG.Bkmarks.mkr.6a">Editeur de signets</title>
<graphic id="INFOUG.Bkmarks.igrph.4" entityref="INFOUG.Bkmarks.fig.4"></graphic>
</figure>
<para>Si plusieurs signets figurent sur une ligne, le Gestionnaire des informations
les repr&eacute;sente par une ic&ocirc;ne qui a l'aspect de multiples signets.
Pour consulter la liste des signets d'une ligne, cliquez deux fois sur l'ic&ocirc;ne
signets multiples. S&eacute;lectionnez ensuite le signet &agrave; afficher
&agrave; partir de la liste Editer le signet.</para>
</sect1>
<sect1 id="INFOUG.Bkmarks.div.7">
<title id="INFOUG.Bkmarks.mkr.7">Editer les signets<indexterm><primary>signets</primary><secondary>&eacute;diter</secondary></indexterm></title>
<para>Vous souhaitez peut-&ecirc;tre ajouter des commentaires &agrave; un
signet vierge existant ou modifier des commentaires apport&eacute;s lors d'une
session d'exploration ant&eacute;rieure.</para>
<para>Pour &eacute;diter ou ajouter des notes &agrave; un signet:</para>
<orderedlist>
<listitem><para>Cliquez sur l'ic&ocirc;ne du signet &agrave; &eacute;diter.
</para>
</listitem>
<listitem><para>Choisissez Modifier la s&eacute;lection sur le menu Rep&egrave;res.
</para>
<para>Le Gestionnaire des informations ouvre l'Editeur de signets qui affiche
le nom actuel du signet ainsi que toute note lui &eacute;tant associ&eacute;e,
le cas &eacute;ch&eacute;ant.</para>
</listitem>
<listitem><para>Apportez vos modifications au nom ou aux notes du signet.
</para>
</listitem>
<listitem><para>Cela &eacute;tant fait, cliquez sur OK.</para>
</listitem>
</orderedlist>
<tip>
<para>Une m&eacute;thode plus rapide consiste &agrave; ouvrir l'Editeur de
signets en cliquant deux fois sur l'ic&ocirc;ne du signet.</para>
</tip>
</sect1>
<sect1 id="INFOUG.Bkmarks.div.8">
<title id="INFOUG.Bkmarks.mkr.8">D&eacute;placer les signets<indexterm><primary>signets</primary><secondary>d&eacute;placer</secondary></indexterm></title>
<para>Vous pouvez d&eacute;placer un signet de son emplacement actuel vers
un autre endroit de la m&ecirc;me fen&ecirc;tre de lecture. Pour d&eacute;placer
un signet:</para>
<orderedlist>
<listitem><para>Cliquez sur l'ic&ocirc;ne du signet &agrave; d&eacute;placer.
</para>
</listitem>
<listitem><para>Affichez en surbrillance du texte sur la ligne vers laquelle
vous souhaitez d&eacute;placer le signet.</para>
</listitem>
<listitem><para>Choisissez D&eacute;placer la s&eacute;lection sur le menu
Rep&egrave;res.</para>
</listitem>
</orderedlist>
</sect1>
<sect1 id="INFOUG.Bkmarks.div.9">
<title id="INFOUG.Bkmarks.mkr.9">Supprimer signets et notes<indexterm><primary>signets</primary><secondary>supprimer</secondary></indexterm></title>
<para>Vous avez la possibilit&eacute; de supprimer tout signet devenu superflu.
Pour supprimer un signet:</para>
<orderedlist>
<listitem><para>Cliquez sur l'ic&ocirc;ne du signet &agrave; supprimer.</para>
</listitem>
<listitem><para>Choisissez Supprimer la s&eacute;lection sur le menu Rep&egrave;res.
</para>
<para>Le Gestionnaire des informations supprime le signet s&eacute;lectionn&eacute;
de la marge du livre.</para>
</listitem>
</orderedlist>
</sect1>
</chapter>
<?Pub *0000012681>
