<!-- $XConsortium: ch06.sgm /main/2 1996/12/17 15:36:41 rws $ -->
<!-- (c) Copyright 1996 Digital Equipment Corporation. -->
<!-- (c) Copyright 1996 Hewlett-Packard Company. -->
<!-- (c) Copyright 1996 International Business Machines Corp. -->
<!-- (c) Copyright 1996 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1996 Novell, Inc. -->
<!-- (c) Copyright 1996 FUJITSU LIMITED. -->
<!-- (c) Copyright 1996 Hitachi. -->
<chapter id="INFOUG.Mngrafx.div.1">
<title id="INFOUG.Mngrafx.mkr.1">G&eacute;rer les graphiques<indexterm><primary>graphiques</primary><secondary>g&eacute;rer</secondary></indexterm><indexterm>
<primary>graphiques</primary></indexterm></title>
<para>Il se r&eacute;v&egrave;lera peut-&ecirc;tre n&eacute;cessaire de supprimer
un graphique du document, de le placer dans une fen&ecirc;tre distincte afin
de le consulter ou de le manipuler (par exemple, le redimensionner). On dit
d'un tel (&eacute;l&eacute;ment) graphique qu'il est "d&eacute;tach&eacute;".
Vous risquez de devoir d&eacute;tacher un graphique dans les circonstances
suivantes:</para>
<itemizedlist>
<listitem><para>Le fait de maintenir l'affichage d'un graphique vous permet
de le consulter alors que vous poursuivez votre lecture.</para>
</listitem>
<listitem><para>Le d&eacute;tachement du graphique vous permet de comparer
des images &agrave; la m&ecirc;me section ou &agrave; des sections diff&eacute;rentes.
</para>
</listitem>
<listitem><para>En d&eacute;tachant un graphique de tr&egrave;s grande taille
ou qui d&eacute;borde simplement de la largeur par d&eacute;faut de votre
fen&ecirc;tre de lecture, il est possible de redimensionner l'image graphique
sans redimensionner la fen&ecirc;tre de lecture.</para>
</listitem>
<listitem><para>L'insertion de certains graphiques risquant de bouleverser
consid&eacute;rablement la disposition du texte, vous avez la possibilit&eacute;
d'am&eacute;liorer la lisibilit&eacute; d'une section en en d&eacute;tachant
les graphiques.</para>
</listitem>
</itemizedlist>
<para>Il est tr&egrave;s facile de manipuler et de g&eacute;rer les graphiques
d&eacute;tach&eacute;s. Plus pr&eacute;cis&eacute;ment, il est possible de
:</para>
<itemizedlist>
<listitem><para>Redimensionner la fen&ecirc;tre du graphique et positionner
le bouton panoramique. Voir <xref role="JumpText" linkend="INFOUG.Mngrafx.div.3">.
</para>
</listitem>
<listitem><para>Redimensionner les graphiques. Voir <xref role="JumpText"
linkend="INFOUG.Mngrafx.div.4">.</para>
</listitem>
<listitem><para>Localiser la section initiale d'un graphique. Voir <xref role="JumpText"
linkend="INFOUG.Mngrafx.div.5">.</para>
</listitem>
<listitem><para>Rattacher des graphiques. Voir <xref role="JumpText" linkend="INFOUG.Mngrafx.div.7">.
</para>
</listitem>
</itemizedlist>
<sect1 id="INFOUG.Mngrafx.div.2">
<title id="INFOUG.Mngrafx.mkr.2">D&eacute;tacher les graphiques<indexterm>
<primary>graphiques</primary><secondary>d&eacute;tacher</secondary></indexterm></title>
<para>Pour d&eacute;tacher un graphique d'un livre:</para>
<orderedlist>
<listitem><para>Choisissez D&eacute;tacher le graphique sur le menu Options.
Le Gestionnaire des informations affiche un curseur en forme de viseur.
</para>
</listitem>
<listitem><para>A l'aide du pointeur de la souris, cliquez sur le graphique
&agrave; d&eacute;tacher. (Pour annuler l'op&eacute;ration, cliquez &agrave;
un endroit quelconque en dehors du graphique.)</para>
</listitem>
</orderedlist>
<para>Vous pouvez &eacute;galement d&eacute;tacher un graphique en pla&ccedil;ant
le pointeur sur le graphique et en cliquant sur le bouton droit de la souris.
Sur le menu dynamique affich&eacute;, choisissez D&eacute;tacher le graphique.
</para>
<para>Si un graphique est s&eacute;lectionn&eacute;, le Gestionnaire des informations
l'affiche dans une fen&ecirc;tre distincte. Dans la fen&ecirc;tre de lecture,
une ic&ocirc;ne Graphique d&eacute;tach&eacute; appara&icirc;t &agrave; la
place du graphique.</para>
<sidebar>
<graphic id="INFOUG.Mngrafx.igrph.1" entityref="INFOUG.Mngrafx.fig.1"></graphic>
</sidebar>
<para>La figure suivante repr&eacute;sente un exemple de fen&ecirc;tre Graphique
d&eacute;tach&eacute;.</para>
<figure>
<title id="INFOUG.Mngrafx.mkr.1a">Fen&ecirc;tre Graphique d&eacute;tach&eacute;</title>
<graphic id="INFOUG.Mngrafx.igrph.2" entityref="INFOUG.Mngrafx.fig.2"></graphic>
</figure>
<para>Un graphique d&eacute;tach&eacute; demeure dans sa fen&ecirc;tre distincte
jusqu'&agrave; ce que vous le rattachiez, refermiez la fen&ecirc;tre Graphique
d&eacute;tach&eacute;, ou terminiez la session d'exploration. Ceci signifie
qu'au cours d'une session, vous pouvez refermer la section dans laquelle appara&icirc;t
le graphique tout en affichant toujours ce dernier dans une fen&ecirc;tre
s&eacute;par&eacute;e.</para>
</sect1>
<sect1 id="INFOUG.Mngrafx.div.3">
<title id="INFOUG.Mngrafx.mkr.3">Redimensionner la fen&ecirc;tre graphique<indexterm>
<primary>graphiques</primary><secondary>redimensionner la fen&ecirc;tre</secondary>
</indexterm></title>
<para>Pour modifier la taille d'une fen&ecirc;tre de graphique d&eacute;tach&eacute;,
utilisez la souris pour faire glisser et d&eacute;placer les bords de la fen&ecirc;tre,
ou utilisez le bouton Agrandir dans le coin sup&eacute;rieur droit du cadre
de la fen&ecirc;tre.</para>
<para>Lorsque vous r&eacute;duisez la taille d'une fen&ecirc;tre de graphique
d&eacute;tach&eacute;, le Gestionnaire des informations affiche une case panoramique
dans un coin de la fen&ecirc;tre. Pour afficher les parties masqu&eacute;es
du graphique apr&egrave;s r&eacute;duction de la taille de la fen&ecirc;tre,
d&eacute;placez la case panoramique de mani&egrave;re &agrave; r&eacute;v&eacute;ler
les sections &agrave; consulter. La figure suivante repr&eacute;sente une
fen&ecirc;tre de graphique d&eacute;tach&eacute; avec une case panoramique
dans le coin sup&eacute;rieur gauche de la fen&ecirc;tre.<indexterm><primary>case panoramique</primary><secondary>avec fen&ecirc;tre de graphique d&eacute;tach&eacute;</secondary></indexterm></para>
<figure>
<title id="INFOUG.Mngrafx.mkr.2a">Case panoramique</title>
<graphic id="INFOUG.Mngrafx.igrph.3" entityref="INFOUG.Mngrafx.fig.3"></graphic>
</figure>
<para>Pour d&eacute;placer la case panoramique dans un autre coin de la fen&ecirc;tre
ou la supprimer compl&egrave;tement, s&eacute;lectionnez l'emplacement que
vous pr&eacute;f&eacute;rez sur le menu Case panoramique. Le Gestionnaire
des informations resitue la case panoramique dans le coin sp&eacute;cifi&eacute;
ou la supprime compl&egrave;tement.</para>
</sect1>
<sect1 id="INFOUG.Mngrafx.div.4">
<title id="INFOUG.Mngrafx.mkr.4">Redimensionner les graphiques<indexterm>
<primary>graphiques</primary><secondary>redimensionner</secondary></indexterm></title>
<para>Utilisez les options du menu Visualiser pour sp&eacute;cifier le mode
d'affichage d'un graphique redimensionnable dans la fen&ecirc;tre Graphique
d&eacute;tach&eacute;. Ces options sont d&eacute;sactiv&eacute;es pour les
graphiques de dimensions fixes:</para>
<variablelist>
<varlistentry><term>Adapter &agrave; la fen&ecirc;tre</term>
<listitem>
<para>Dimensionne le graphique de mani&egrave;re &agrave; le faire tenir dans
les limites de la fen&ecirc;tre Graphique d&amp;eacute;tach&amp;eacute;.</para>
</listitem>
</varlistentry>
<varlistentry><term>Adapter au graphique</term>
<listitem>
<para>Redimensionne la fen&ecirc;tre Graphique d&amp;eacute;tach&amp;eacute;
de mani&egrave;re &agrave; l'ajuster aux dimensions actuelles du graphique.
</para>
</listitem>
</varlistentry>
<varlistentry><term>Pourcentages de dimensionnement</term>
<listitem>
<para>Augmentent ou r&eacute;duisent la taille du graphique par rapport &agrave;
ses dimensions initiales.</para>
</listitem>
</varlistentry>
<varlistentry><term>Personnaliser</term>
<listitem>
<para>Sp&eacute;cifiez un pourcentage de dimensionnement pour le graphique
en cours.</para>
</listitem>
</varlistentry>
</variablelist>
</sect1>
<sect1 id="INFOUG.Mngrafx.div.5">
<title id="INFOUG.Mngrafx.mkr.5">Localiser la section d'origine d'un graphique<indexterm>
<primary>graphique</primary><secondary>localiser la section d'origine</secondary>
</indexterm></title>
<para>A partir d'une fen&ecirc;tre Graphique d&eacute;tach&eacute;, vous pouvez
ouvrir la section de laquelle le graphique a &eacute;t&eacute; d&eacute;tach&eacute;.
Pour ce faire, choisissez Afficher la section sur le menu Fichier de la fen&ecirc;tre
Graphique d&amp;eacute;tach&amp;eacute;. Le Gestionnaire des informations
ouvre la fen&ecirc;tre initiale dont vous avez d&eacute;tach&eacute; le graphique<?Pub Caret> et
l'affiche &agrave; l'avant-plan de vos autres fen&ecirc;tres.</para>
</sect1>
<sect1 id="INFOUG.Mngrafx.div.7">
<title id="INFOUG.Mngrafx.mkr.7">Rattacher les graphiques<indexterm><primary>graphiques</primary><secondary>rattacher</secondary></indexterm></title>
<para>Pour r&eacute;ins&eacute;rer un graphique dans le livre duquel vous
l'avez d&eacute;tach&eacute;, utilisez une des m&eacute;thodes suivantes:
</para>
<itemizedlist>
<listitem><para>Choisissez Attacher sur le menu Fichier de la fen&ecirc;tre
Graphique d&amp;eacute;tach&amp;eacute;.</para>
</listitem>
<listitem><para>Choisissez Fermer sur le menu Fichier de la fen&ecirc;tre
Graphique d&amp;eacute;tach&amp;eacute;.</para>
</listitem>
<listitem><para>Cliquez deux fois sur le bouton du menu Fen&ecirc;tre (coin
sup&eacute;rieur gauche de la fen&ecirc;tre Graphique d&amp;eacute;tach&amp;eacute;).
</para>
</listitem>
<listitem><para>Placez le pointeur sur le graphique et cliquez sur le bouton
droit de la souris. Sur le menu dynamique affich&eacute;, choisissez Attacher
le graphique.</para>
</listitem>
</itemizedlist>
<para>Le Gestionnaire des informations referme la fen&ecirc;tre Graphique
d&amp;eacute;tach&amp;eacute; et r&eacute;ins&egrave;re le graphique dans
le livre, que ce dernier soit ouvert ou pas.</para>
</sect1>
</chapter>
<?Pub *0000013299>
