<!-- $XConsortium: ch07.sgm /main/2 1996/12/17 15:36:49 rws $ -->
<!-- (c) Copyright 1996 Digital Equipment Corporation. -->
<!-- (c) Copyright 1996 Hewlett-Packard Company. -->
<!-- (c) Copyright 1996 International Business Machines Corp. -->
<!-- (c) Copyright 1996 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1996 Novell, Inc. -->
<!-- (c) Copyright 1996 FUJITSU LIMITED. -->
<!-- (c) Copyright 1996 Hitachi. -->
<chapter id="INFOUG.Printing.div.1">
<title id="INFOUG.Printing.mkr.1">Imprimer<indexterm><primary>imprimer</primary>
</indexterm></title>
<para>Le Gestionnaire des informations permet tout aussi bien d'imprimer certaines
parties d'un livre que tout un rayon de biblioth&egrave;que. Il est tr&egrave;s
facile de sp&eacute;cifier l'imprimante ou le fichier vers laquelle ou lequel
diriger l'impression.</para>
<note>
<para>Vous ne pouvez imprimer que les documents auxquels vous &ecirc;tes autoris&eacute;
(par licence) d'acc&eacute;der.</para>
</note>
<para>Pour lancer rapidement une impression (sans utiliser la bo&icirc;te
de dialogue Imprimer), cliquez sur le bouton Imprimer de la fen&ecirc;tre
Liste de livres ou de la fen&ecirc;tre de lecture. Vous pouvez &eacute;galement
choisir Imprimer sur le menu Fichier de la fen&ecirc;tre Liste de livres ou
le menu Explorateur d'une fen&ecirc;tre de lecture.</para>
<para>Pour imprimer &agrave; l'aide de la bo&icirc;te de dialogue Imprimer,
choisissez Imprimer... sur le menu Fichier de la fen&ecirc;tre Liste des livres
ou le menu Explorateur d'une fen&ecirc;tre de lecture. Lorsque vous proc&eacute;dez
&agrave; cette op&eacute;ration, le Gestionnaire des informations affiche
la bo&icirc;te de dialogue Imprimer, comme l'indique la figure suivante.</para>
<figure>
<title id="INFOUG.Printing.mkr.1a">Imprimer, bo&icirc;te de dialogue</title>
<graphic id="INFOUG.Printing.igrph.1" entityref="INFOUG.Printing.fig.1"></graphic>
</figure>
<para>La bo&icirc;te de dialogue Imprimer contient les boutons suivants:
</para>
<variablelist>
<varlistentry><term>Imprimer</term>
<listitem>
<para>Transmet la ou les sections sp&eacute;cifi&eacute;e &agrave; l'imprimante
ou au fichier d&eacute;sign&eacute;.</para>
</listitem>
</varlistentry>
<varlistentry><term>Configuration...</term>
<listitem>
<para>Affiche la fen&ecirc;tre Configuration de l'impression, &agrave; partir
de laquelle vous configurerez des options sp&eacute;cifiques &agrave; une
imprimante et d&eacute;finirez les options Imprimante et <comment>Traduire...
&ldquo;T&acirc;che&rdquo; ou &ldquo;Travail&rdquo;????</comment>Job.</para>
</listitem>
</varlistentry>
<varlistentry><term>Annuler</term>
<listitem>
<para>Annule l'op&eacute;ration d'impression et referme la bo&icirc;te de
dialogue Imprimer.</para>
</listitem>
</varlistentry>
<varlistentry><term>Aide</term>
<listitem>
<para>Affiche des informations relatives &agrave; la bo&icirc;te de dialogue
Imprimer.</para>
</listitem>
</varlistentry>
</variablelist>
<para>Pour un compl&eacute;ment d'information sur l'impression &agrave; partir
du Gestionnaire des informations, voir:</para>
<itemizedlist>
<listitem><para><xref role="JumpText" linkend="INFOUG.Printing.div.3"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Printing.div.4"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Printing.div.7"></para>
</listitem>
<listitem><para><xref role="JumpText" linkend="INFOUG.Printing.div.8"></para>
</listitem>
</itemizedlist>
<sect1 id="INFOUG.Printing.div.3">
<title id="INFOUG.Printing.mkr.3">Imprimer une section individuelle<indexterm>
<primary>imprimer</primary><secondary>sections individuelles</secondary></indexterm></title>
<para>Pour imprimer rapidement la section que vous lisez actuellement, cliquez
sur le bouton Imprimer ou choisissez Imprimer sur le menu Explorateur. Le
Gestionnaire des informations imprime la section d&eacute;sir&eacute;e sans
afficher la bo&icirc;te de dialogue Imprimer.</para>
<para>Pour imprimer la section actuelle &agrave; l'aide de la bo&icirc;te
de dialogue Imprimer:</para>
<orderedlist>
<listitem><para>Choisissez Imprimer... sur le menu Explorateur. Le Gestionnaire
des informations affiche la bo&icirc;te de dialogue Imprimer, la section que
vous lisez actuellement &eacute;tant s&eacute;lectionn&eacute;e.</para>
</listitem>
<listitem><para>Dans la zone A imprimer, assurez-vous que le bouton de radio
Sections est s&eacute;lectionn&eacute;.</para>
</listitem>
<listitem><para>Pour imprimer la section vers un fichier, cliquez sur le bouton
de radio Imprimer dans le fichier. Sp&eacute;cifiez le chemin d'acc&egrave;s
du fichier dans la zone de saisie ou cliquez sur le bouton S&eacute;lectionner
le fichier... pour parcourir &agrave; la recherche du chemin d'acc&egrave;s
et du nom de fichier.</para>
<para>Pour imprimer directement la section sur une imprimante, v&eacute;rifiez
que le bouton de radio Imprimer sur l'imprimante est s&eacute;lectionn&eacute;.
</para>
<para>Pour obtenir un compl&eacute;ment d'information, voir <xref role="JumpText"
linkend="INFOUG.Printing.mkr.8">.</para>
</listitem>
<listitem><para>Cliquez sur Imprimer pour imprimer la section s&eacute;lectionn&eacute;e.
</para>
</listitem>
</orderedlist>
</sect1>
<sect1 id="INFOUG.Printing.div.4">
<title id="INFOUG.Printing.mkr.4">Imprimer plusieurs sections<indexterm>
<primary>imprimer</primary><secondary>plusieurs sections</secondary></indexterm></title>
<para>Vous pouvez imprimer des sections multiples &agrave; partir de la fen&ecirc;tre
de lecture ou de la fen&ecirc;tre Liste des livres.</para>
<sect2 id="INFOUG.Printing.div.5">
<title id="INFOUG.Printing.mkr.5">Depuis la fen&ecirc;tre de lecture<indexterm>
<primary>imprimer</primary><secondary>depuis la fen&ecirc;tre de lecture</secondary>
</indexterm></title>
<para>Pour imprimer &agrave; partir de la fen&ecirc;tre de lecture:</para>
<orderedlist>
<listitem><para>Choisissez Imprimer... sur le menu Explorateur. Le Gestionnaire
des informations affiche la bo&icirc;te de dialogue Imprimer.</para>
</listitem>
<listitem><para>Dans la zone A imprimer de la bo&icirc;te de dialogue Imprimer,
cliquez sur le bouton de radio Hi&eacute;rarchie. Ce bouton indique au Gestionnaire
des informations d'imprimer la section actuelle et toutes ses sections subalternes.
</para>
<para>Pour obtenir un compl&eacute;ment d'information, voir <xref role="JumpText"
linkend="INFOUG.Printing.mkr.7">.</para>
</listitem>
<listitem><para>Pour imprimer les sections dans un fichier, cliquez sur le
bouton de radio Imprimer dans le fichier. Tapez le chemin d'acc&egrave;s du
fichier dans la zone de saisie ou cliquez sur le bouton S&eacute;lectionner
le fichier pour parcourir &agrave; la recherche du chemin d'acc&egrave;s et
du nom de fichier.</para>
<para>Pour imprimer les sections directement sur une imprimante, cliquez sur
le bouton de radio Imprimer sur l'imprimante.</para>
<para>Pour obtenir un compl&eacute;ment d'information, voir <xref role="JumpText"
linkend="INFOUG.Printing.mkr.8">.</para>
</listitem>
<listitem><para>Cliquez sur Imprimer pour imprimer les sections s&eacute;lectionn&eacute;es.
</para>
</listitem>
</orderedlist>
</sect2>
<sect2 id="INFOUG.Printing.div.6">
<title id="INFOUG.Printing.mkr.6">Depuis la fen&ecirc;tre Liste des livres<indexterm>
<primary>imprimer</primary><secondary>depuis la fen&ecirc;tre Liste de livres</secondary></indexterm></title>
<para>Pour imprimer &agrave; partir de la fen&ecirc;tre Liste de livres:
</para>
<orderedlist>
<listitem><para>Dans la fen&ecirc;tre Liste de livres, maintenez la touche
Contr&ocirc;le enfonc&eacute;e et cliquez sur les noms des sections &agrave;
imprimer.</para>
<para>Pour s&eacute;lectionner un ensemble de sections contigu&euml;s, maintenez
la touche Maj enfonc&eacute;e tout en faisant glisser le pointeur sur les
noms de section.</para>
<para>Pour d&eacute;s&eacute;lectionner une section, maintenez la touche Contr&ocirc;le
enfonc&eacute;e et cliquez sur le nom de la section.</para>
</listitem>
<listitem><para>Choisissez Imprimer... sur le menu Fichier. Le Gestionnaire
des informations affiche la bo&icirc;te de dialogue Imprimer.</para>
</listitem>
<listitem><para>Dans la zone A imprimer de la bo&icirc;te de dialogue Imprimer,
cliquez sur le bouton de radio Sections.</para>
<note>
<para>Vous ne pouvez cliquer sur le bouton de radio Hi&eacute;rarchie si plusieurs
sections sont s&eacute;lectionn&eacute;es dans la Liste des livres.</para>
</note>
<para>Pour obtenir un compl&eacute;ment d'information, voir <xref role="JumpText"
linkend="INFOUG.Printing.mkr.7">.</para>
</listitem>
<listitem><para>Pour imprimer les sections dans un fichier, cliquez sur le
bouton de radio Imprimer dans le fichier. Tapez le chemin d'acc&egrave;s du
fichier dans la zone de saisie ou cliquez sur le bouton S&eacute;lectionner
le fichier... pour parcourir &agrave; la recherche du chemin d'acc&egrave;s
et du nom de fichier.</para>
<para>Pour imprimer directement les sections sur une imprimante, cliquez sur
le bouton de radio Imprimer sur l'imprimante.</para>
<para>Pour obtenir un compl&eacute;ment d'information, voir <xref role="JumpText"
linkend="INFOUG.Printing.mkr.8">.</para>
</listitem>
<listitem><para>Cliquez sur Imprimer pour imprimer les sections s&eacute;lectionn&eacute;es.
</para>
</listitem>
</orderedlist>
<para>Pour imprimer rapidement plusieurs sections &agrave; partir de la fen&ecirc;tre
Liste des livres (c'est-&agrave;-dire sans utiliser la bo&icirc;te de dialogue
Imprimer):</para>
<orderedlist>
<listitem><para>S&eacute;lectionnez les sections &agrave; imprimer, de la
mani&egrave;re d&eacute;crite ci-dessus.</para>
</listitem>
<listitem><para>Cliquez sur le bouton Imprimer ou choisissez Imprimer sur
le menu Fichier. Le Gestionnaire des informations imprime la section sans
afficher la bo&icirc;te de dialogue Imprimer.</para>
</listitem>
</orderedlist>
</sect2>
</sect1>
<sect1 id="INFOUG.Printing.div.7">
<title id="INFOUG.Printing.mkr.7">Sp&eacute;cifier la ou les sections &agrave;
imprimer</title>
<para>Le Gestionnaire des informations permet de sp&eacute;cifier si vous
souhaitez imprimer une seule section, un nombre de sections non contigu&euml;s,
un groupe de sections ou des sections connexes. Pour ce faire, utilisez la
zone A imprimer de la bo&icirc;te de dialogue Imprimer.</para>
<para>Pour sp&eacute;cifier que vous souhaitez imprimer une seule section
ou plusieurs sections non contigu&euml;s (option disponible lorsque vous invoquez
la fonction d'impression &agrave; partir de la Liste de livres), cliquez sur
le bouton de radio Sections.</para>
<para>Pour imprimer une section et ses sections subalternes, cliquez sur le
bouton de radio Hi&eacute;rarchie.</para>
<note>
<para>Lorsque vous cliquez sur Hi&eacute;rarchie, la zone Nombre de sections
de la bo&icirc;te de dialogue Imprimer est actualis&eacute;e de mani&egrave;re
&agrave; indiquer le nombre de sections incluses dans cette hi&eacute;rarchie.
</para>
</note>
</sect1>
<sect1 id="INFOUG.Printing.div.8">
<title id="INFOUG.Printing.mkr.8">Sp&eacute;cifier la destination de l'impression<indexterm>
<primary>imprimer</primary><secondary>dans un fichier</secondary></indexterm></title>
<para>Vous pouvez envoyer directement des sections ou des livres s&eacute;lectionn&eacute;s
&agrave; une imprimante, ou enregistrer les sections dans un fichier PostScript
&agrave; imprimer ult&eacute;rieurement.</para>
<sect2 id="INFOUG.Printing.div.9">
<title id="INFOUG.Printing.mkr.9">Imprimer directement sur une imprimante</title>
<para>Pour imprimer directement sur une imprimante:</para>
<orderedlist>
<listitem><para>Cliquez sur le bouton de radio Imprimante.</para>
<para>La zone de saisie Imprimante sontient le <comment>V&eacute;rifier comment
cela appara&icirc;t dans l'interface...</comment>X Printer Specifier de l'imprimante
&agrave; utiliser pour la t&acirc;che d'impression. Le <comment>V&eacute;rifier
comment cela appara&icirc;t dans l'interface...</comment>X Printer Specifier
est un identificateur qui d&eacute;signe une et une seule imprimante <comment>
V&eacute;rifier comment cela appara&icirc;t dans l'interface...</comment>X
Printer. Le format de cet identificateur est le suivant:</para>
<programlisting><emphasis>printerName</emphasis>@<emphasis>host</emphasis>: <emphasis>display</emphasis>.<emphasis>screen</emphasis></programlisting>
<para>La partie .<emphasis>screen</emphasis> de cette syntaxe est facultative.
</para>
</listitem>
<listitem><para>Utilisez l'imprimante dont le nom est affich&eacute;, ou s&eacute;lectionnez
une autre imprimante en cliquant sur le bouton S&eacute;lectionner l'imprimante...
et en utilisant la bo&icirc;te de dialogue de s&eacute;lection d'imprimante.
</para>
</listitem>
</orderedlist>
</sect2>
<sect2 id="INFOUG.Printing.div.10">
<title id="INFOUG.Printing.mkr.10">Imprimer dans un fichier</title>
<para>Pour imprimer dans un fichier:</para>
<orderedlist>
<listitem><para>Cliquez sur le bouton de radio Imprimer dans le fichier.</para>
</listitem>
<listitem><para>Tapez le nom du fichier destin&eacute; &agrave; recevoir la
sortie PostScript. Vous pouvez &eacute;galement s&eacute;lectionner les r&eacute;pertoire
et fichier en cliquant sur le bouton <comment>Traduire/v&eacute;rifier dans
l'interface...</comment>S&eacute;lectionner le fichier<?Pub Caret>... et en
utilisant la bo&icirc;te de dialogue de s&eacute;lection de fichier.</para>
</listitem>
</orderedlist>
</sect2>
</sect1>
</chapter>
<?Pub *0000016827>
