<!-- $XConsortium: glossary.sgm /main/2 1996/12/17 15:37:05 rws $ -->
<!-- (c) Copyright 1996 Digital Equipment Corporation. -->
<!-- (c) Copyright 1996 Hewlett-Packard Company. -->
<!-- (c) Copyright 1996 International Business Machines Corp. -->
<!-- (c) Copyright 1996 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1996 Novell, Inc. -->
<!-- (c) Copyright 1996 FUJITSU LIMITED. -->
<!-- (c) Copyright 1996 Hitachi. -->
<glossary id="INFOUG.Gloss.div.1">
<title>Glossaire</title>
<comment>J'ai remis le Glossaire dans l'ordre alphab&eacute;tique fran&ccedil;ais.
Certains de ces termes figurent d&eacute;j&agrave; dans les glossaires du
User Guide et du System Manager Guide, et doivent donc correspondre. Attention
surtout &agrave; &ldquo;infolib&rdquo;. Dans les autres manuels nous avons
laiss&eacute; &ldquo;infolib&rdquo; (et pas &ldquo;biblinfo&rdquo;).</comment>
<glossentry><glossterm>Aller<comment>et pas &ldquo;Go&rdquo;</comment></glossterm>
<glossdef>
<para>Fen&ecirc;tre de lecture: menu Aller. Utilisez ce menu pour naviguer
dans l'ordre des sections d'une biblioth&egrave;que d'informations ou pour
revenir aux sections d&eacute;j&agrave; lues.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>biblioth&egrave;que d'informations</glossterm>
<glossdef>
<para>Une collection de rayons, dans laquelle chaque rayon contient une collection
de livres, et chaque livre contient des sections.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Bo&icirc;te &agrave; outils du d&eacute;veloppeur du
syst&egrave;me d'information</glossterm>
<glossdef>
<para>La panoplie d'outils et d'interfaces de programmation d'applications
(API) qui permettent aux auteurs du syst&egrave;me d'information de r&eacute;diger,
de traiter et de consulter les biblioth&egrave;ques d'informations.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>carte graphique</glossterm>
<glossdef>
<para>Repr&eacute;sentation visuelle de la structure interne d'un livre, selon
laquelle les titres de section du livre sont affich&eacute;s sous forme d'une
"arborescence" graphique.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>case panoramique</glossterm>
<glossdef>
<para>Zone d'affichage panoramique bi-dimensionnelle dans une carte graphique
du Gestionnaire des informations. Cette zone vous permet de faire d&eacute;filer
la partie visible de la carte dans la fen&ecirc;tre invisible (et, ce faisant,
de r&eacute;v&eacute;ler la partie pr&eacute;alablement masqu&eacute;e).</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Configuration de l'impression</glossterm>
<glossdef>
<para>Bo&icirc;te de dialogue qui permet de sp&eacute;cifier des param&egrave;tres
d'impression pour l'imprimante actuellement s&eacute;lectionn&eacute;e, tels
que l'orientation de la page (portrait ou paysage), l'impression recto ou
rectoverso, le bac &agrave; papier &agrave; utiliser. Cette bo&icirc;te de
dialogue s'affiche &agrave; partir de l'Agenda, du Gestionnaire des informations,
de la Bo&icirc;te aux lettres<comment>Mailer</comment> et de l'Editeur de
texte lorsque vous cliquez deux fois sur le bouton Configurer de leurs bo&icirc;tes
de dialogue d'impression respectives.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>connexion, bouton de</glossterm>
<glossdef>
<para>Editeur de requ&ecirc;tes. Utilisez ce bouton pour inclure un autre
terme dans une recherche.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Cr&eacute;er une note</glossterm>
<glossdef>
<para>Fen&ecirc;tre de lecture: menu Rep&egrave;res. Utilisez cette option
pour cr&eacute;er un signet annot&eacute; au sein d'une section dans une fen&ecirc;tre
de lecture active.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Cr&eacute;er un signet</glossterm>
<glossdef>
<para>Fen&ecirc;tre de lecture: menu Rep&egrave;res. Utilisez cette option
pour cr&eacute;er un signet vierge au sein d'une section dans une fen&ecirc;tre
de lecture active.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>D&eacute;tacher le graphique</glossterm>
<glossdef>
<para>Utilisez cet &eacute;l&eacute;ment de menu pour copier une image graphique
s&eacute;lectionn&eacute;e dans une fen&ecirc;tre s&eacute;par&eacute;e nomm&eacute;e <emphasis>fen&ecirc;tre Graphique d&eacute;tach&eacute;</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Editeur d'&eacute;tendues de recherche</glossterm>
<glossdef>
<para>La bo&icirc;te de dialogue qui vous permet de cr&eacute;er des &eacute;tendues
de recherche personnalis&eacute;es.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Editeur de requ&ecirc;tes</glossterm>
<glossdef>
<para>La bo&icirc;te de dialogue qui vous permet de d&eacute;finir des recherches
d&eacute;taill&eacute;es dans une biblioth&egrave;que d'informations.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Editeur de signets</glossterm>
<glossdef>
<para>La bo&icirc;te de dialogue qui appara&icirc;t lorsque vous cliquez deux
fois sur une ic&ocirc;ne de signet dans une fen&ecirc;tre de lecture. Utilisez
cet &eacute;diteur pour afficher et modifier des notes et des signets existants.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>&eacute;tendue de la recherche</glossterm>
<glossdef>
<para>L'&eacute;tendue des livres et des types d'information &agrave; laquelle
s'appliquera une recherche du Gestionnaire des informations.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>explorer<comment>ou &ldquo;parcourir&rdquo;, mais vous
avez mis Explorateur pour Browser</comment></glossterm>
<glossdef>
<para>1) Parcourir une collection, telle qu'une base de donn&eacute;es, une
vue du Gestionnaire de fichiers, une zone de liste ou un fichier texte, &agrave;
la recherche soit d'un &eacute;l&eacute;ment sp&eacute;cifique, soit d'un
&eacute;l&eacute;ment int&eacute;ressant quelconque. Implique g&eacute;n&eacute;ralement
que vous observez les informations sans n&eacute;cessairement les changer.
</para>
<para>2) Rechercher en parcourant et en faisant d&eacute;filer des &eacute;crans
ou fen&ecirc;tres de donn&eacute;es.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>fen&ecirc;tre ancr&eacute;e</glossterm>
<glossdef>
<para>Une fen&ecirc;tre de lecture configur&eacute;e de mani&egrave;re &agrave;
ce que le texte affich&eacute; dans la fen&ecirc;tre soit conserv&eacute;
lorsque vous suivez un lien et ouvrez une fen&ecirc;tre pour le nouveau texte.
Si la fen&ecirc;tre n'est pas ancr&eacute;e, le Gestionnaire des informations
actualise le texte de la fen&ecirc;tre de lecture en cours chaque fois que
vous suivez un lien.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>fen&ecirc;tre de lecture</glossterm>
<glossdef>
<para>Fen&ecirc;tre du Gestionnaire des informations qui affiche le texte,
les tables et les graphiques d'une section sp&eacute;cifique dans un livre.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Gestionnaire des informations</glossterm>
<glossdef>
<para>L'application logicielle qui vous permet de parcourir et de faire des
recherches dans des collections de documentation en ligne appel&eacute;es
des <emphasis>biblioth&egrave;ques d'informations</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Graphique d&eacute;tach&eacute;, ic&ocirc;ne</glossterm>
<glossdef>
<para>Une ic&ocirc;ne indiquant l'endroit d'o&ugrave; un graphique a &eacute;t&eacute;
d&eacute;tach&eacute;.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Graphique d&eacute;tach&eacute;, fen&ecirc;tre</glossterm>
<glossdef>
<para>La fen&ecirc;tre de bo&icirc;te de dialogue qui appara&icirc;t lorsque
vous d&eacute;tachez un graphique.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Historique automatique</glossterm>
<glossdef>
<para>Fen&ecirc;tre Liste de livres: menu Options. Utilisez cette fonctionnalit&eacute;
pour d&eacute;terminer si le Gestionnaire des informations indique ou non
o&ugrave; vous trouvez dans la hi&eacute;rarchie de la biblioth&egrave;que
d'informations.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>infolib<comment>et pas &ldquo;biblinfo&rdquo;. Attention
aussi &agrave; l'option &ldquo;Load infolib&rdquo; &mdash; Je ne sais pas
ce que vous avez mis dans l'interface.</comment></glossterm>
<glossdef>
<para>L'ensemble des fichiers, y compris les instances SGML, les graphiques
et les index, qui constituent une biblioth&egrave;que d'informations. Voir <emphasis>information library</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>information</glossterm>
<glossdef>
<para>Voir <emphasis>Gestionnaire des informations</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>lien</glossterm>
<glossdef>
<para>Une r&eacute;f&eacute;rence hypertexte &agrave; un point d'implantation.
Le contenu d'un lien repr&eacute;sente une zone active du Gestionnaire des
informations. Voir <emphasis>point d'implantation</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>liste de livres</glossterm>
<glossdef>
<para>La liste de rayons de biblioth&egrave;que et de livres disponibles aupr&egrave;s
du Gestionnaire des informations.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Liste de livres, fen&ecirc;tre</glossterm>
<glossdef>
<para>La bo&icirc;te de dialogue du Gestionnaire des informations qui permet
d'acc&eacute;der aux informations m&eacute;moris&eacute;es dans une biblioth&egrave;que
d'informations afin de les afficher en ligne ou de les imprimer.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Lister les rep&egrave;res</glossterm>
<glossdef>
<para>Fen&ecirc;tre de lecture: menu Rep&egrave;res<comment>&ldquo;Marks&rdquo;
menu</comment>. Utilisez ce menu pour lister tous vos signets vierges et annot&eacute;s.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>livre</glossterm>
<glossdef>
<para>Un livre &eacute;lectronique. Voir aussi <emphasis>rayon</emphasis>
et <emphasis>biblioth&egrave;que d'informations</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>objet de commande du Tableau de bord</glossterm>
<glossdef>
<para>Objet du Tableau de bord utilis&eacute; comme interface avec les services
syst&egrave;me de base et les t&acirc;ches et op&eacute;rations fr&eacute;quemment
effectu&eacute;es. Utilisez le nom sp&eacute;cifique de l'objet de commande
dans les cas appropri&eacute;s. Les objets de commande dans le Tableau de
bord distribu&eacute; par d&eacute;faut sont les suivants: Horloge, Agenda,
Gestionnaire de fichiers, Editeur de texte, Bo&icirc;te aux lettres, Imprimante,
Gestionnaire de styles, Gestionnaire d'applications, Gestionnaire des informations
et Corbeille.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>point d'implantation</glossterm>
<glossdef>
<para>Dans un document, point d'ancrage auquel les liens hypertexte peuvent
faire r&eacute;f&eacute;rence. Chaque point d'implantation est associ&eacute;
&agrave; un identificateur unique dans toute la biblioth&egrave;que d'informations.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>rayon</glossterm>
<glossdef>
<para>Groupe de livres &eacute;lectroniques sur des sujets connexes, regroup&eacute;s
dans un &ldquo;rayon&rdquo;<comment>bookcase</comment>. Un ensemble logique
d'informations (le cas &eacute;ch&eacute;ant, plusieurs livres connexes) accompagn&eacute;
d'un seul index avec capacit&eacute;s de recherche textuelle. Un rayon (de
biblioth&egrave;que) et les feuilles de style repr&eacute;sentent la collection
minimale de donn&eacute;es pouvant &ecirc;tre &eacute;labor&eacute;e sous
forme de biblioth&egrave;que d'informations. Voir aussi <emphasis>biblioth&egrave;que
d'informations</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>rayon, DTD de</glossterm>
<glossdef>
<para>La d&eacute;finition de type de document (DTD) qui d&eacute;termine
la structure des fichiers de sp&eacute;cifications utilis&eacute;s pour cr&eacute;er
des livres pour le Gestionnaire des informations. Voir aussi <emphasis>d&eacute;finition
de type de document</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>rayon, sp&eacute;cification de</glossterm>
<glossdef>
<para>Un document SGML,<?Pub Caret> qui contient ou sp&eacute;cifie les fichiers
de livre, les feuilles de style et autres entit&eacute;s SGML n&eacute;cessaires
&agrave; l'&eacute;laboration d'une biblioth&egrave;que d'informations.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Rep&egrave;res</glossterm>
<glossdef>
<para>Fen&ecirc;tre de lecture: menu Rep&egrave;res. Utilisez ce menu pour
cr&eacute;er, &eacute;diter et supprimer des signets.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>R&eacute;sultats de la recherche, fen&ecirc;tre</glossterm>
<glossdef>
<para>Fen&ecirc;tre qui affiche la liste des sections contenant des correspondances.
Le Gestionnaire des informations affiche une fen&ecirc;tre R&eacute;sultats
de la recherche d&egrave;s qu'une recherche s'ach&egrave;ve.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>section</glossterm>
<glossdef>
<para>Une unit&eacute; unique de documentation affich&eacute;e dans une fen&ecirc;tre
de lecture du Gestionnaire des informations.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>signet</glossterm>
<glossdef>
<para>Un rep&egrave;re du Gestionnaire des informations que les utilisateurs
peuvent cr&eacute;er pour annoter un passage de texte ou un &eacute;l&eacute;ment
graphique sp&eacute;cifique dans une biblioth&egrave;que d'informations. Le
Gestionnaire des informations repr&eacute;sente un signet par une ic&ocirc;ne
dans la marge gauche d'une fen&ecirc;tre de lecture.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>syst&egrave;me d'information</glossterm>
<glossdef>
<para>Constitu&eacute; des biblioth&egrave;ques d'informations (les donn&eacute;es),
du Gestionnaire des informations (l'afficheur) et de la Bo&icirc;te &agrave;
outils du d&eacute;veloppeur du syst&egrave;me d'information (les utilitaires
de d&eacute;veloppement).</para>
</glossdef>
</glossentry>
<glossentry><glossterm>table des mati&egrave;res hypertexte</glossterm>
<glossdef>
<para>Une liste hi&eacute;rarchique hypertexte des titres de section. Les
tables des mati&egrave;res hypertexte structurent les diverses sections des
livres en ligne au sein du syst&egrave;me d'information.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Visualiser</glossterm>
<glossdef>
<para>Ic&ocirc;ne et &eacute;l&eacute;ment de menu permettant d'ouvrir une
fen&ecirc;tre de lecture destin&eacute;e &agrave; une section s&eacute;lectionn&eacute;e.
</para>
</glossdef>
</glossentry>
</glossary>
<!--fickle 1.14 mif-to-docbook 1.7 01/02/96 10:57:19-->
<?Pub *0000018056>
