<!-- $XConsortium: glossary.sgm /main/5 1996/06/20 18:22:18 rws CHECKEDOUT
$ -->
<!-- (c) Copyright 1995 Digital Equipment Corporation. -->
<!-- (c) Copyright 1995 Hewlett-Packard Company. -->
<!-- (c) Copyright 1995 International Business Machines Corp. -->
<!-- (c) Copyright 1995 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1995 Novell, Inc. -->
<!-- (c) Copyright 1995 FUJITSU LIMITED. -->
<!-- (c) Copyright 1995 Hitachi. -->
<glossary id="UG.Gloss.div.1">
<title>Glossaire</title>
<glossentry><glossterm>actif</glossterm>
<glossdef>
<para>&Eacute;tat d'une fen&ecirc;tre, d'une ic&ocirc;ne ou d'un &eacute;l&eacute;ment
de fen&ecirc;tre sur lequel porte les commandes entr&eacute;es au clavier
ou &agrave; partir de la souris. Une fen&ecirc;tre active est identifi&eacute;e
par la couleur de sa barre de titre ou de son ombrage. Un &eacute;l&eacute;ment
actif dans une fen&ecirc;tre est mis en &eacute;vidence ou signal&eacute;
par un curseur de s&eacute;lection.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>action</glossterm> 
<glossdef>
<para>Structure CDE permettant d'ex&eacute;cuter des applications et des commandes,
et d'effectuer des op&eacute;rations telles que l'impression, la suppression
de fichiers et le changement de r&eacute;pertoire. Les actions sont d&eacute;finies
dans une base de donn&eacute;es de fichiers de configuration.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>adresse</glossterm>
<glossdef>
<para>Coordonn&eacute;es &eacute;lectroniques d'un utilisateur.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Afficheur d'aide</glossterm>
<glossdef>
<para>Application permettant d'afficher l'aide en ligne.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Agenda</glossterm>
<glossdef>
<para>Application permettant de planifier des rendez-vous et d'&eacute;tablir
des listes d'activit&eacute;s.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Agrandir</glossterm>
<glossdef>
<para>Option permettant d'augmenter au maximum les dimensions d'une fen&ecirc;tre.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Aide</glossterm>
<glossdef>
<para>Bouton ou option de menu permettant d'acc&eacute;der &agrave; des informations
sur les objets, les s&eacute;lections possibles, les t&acirc;ches et les
messages d'erreur.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>aide sur l'&eacute;l&eacute;ment</glossterm> 
<glossdef>
<para>Aide affich&eacute;e lorsque vous cliquez (&agrave; l'aide du pointeur
en point d'interrogation) sur une commande, une op&eacute;ration, une bo&icirc;te
de dialogue ou un objet de commande apr&egrave;s avoir s&eacute;lectionn&eacute;
l'option Sur l'&eacute;l&eacute;ment du menu Aide.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>alias</glossterm>
<glossdef>
<para>Autre(s) nom(s) affect&eacute;(s) &agrave; un programme ou &agrave;
une adresse &eacute;lectronique.</para>
<para>Dans le cas du courrier &eacute;lectronique, adresse d'un groupe d'utilisateurs,
plus ou moins nombreux.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Annuler</glossterm>
<glossdef>
<para>Bouton permettant de fermer une fen&ecirc;tre sans appliquer les modifications
apport&eacute;es.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Application</glossterm> 
<glossdef>
<para>Programme informatique qui met &agrave; la disposition de l'utilisateur
des outils de travail. Le Gestionnaire de configuration, l'Editeur de texte
et le Gestionnaire de fichiers constituent des exemples d'applications. Voir <emphasis>logiciel</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Appliquer</glossterm>
<glossdef>
<para>Option permettant de valider une ou plusieurs s&eacute;lections effectu&eacute;es
dans une bo&icirc;te de dialogue.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>arborescence des sujets</glossterm>
<glossdef>
<para>Dans une bo&icirc;te de dialogue d'aide g&eacute;n&eacute;rale, liste
de rubriques pouvant &ecirc;tre r&eacute;duite ou agrandie et permettant
d'afficher des informations d'aide.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>arri&egrave;re-plan</glossterm>
<glossdef>
<para>Zone sur laquelle sont affich&eacute;s les &eacute;l&eacute;ments d'une
fen&ecirc;tre, tels que les boutons et les listes.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>arri&egrave;re-plan de l'espace de travail</glossterm>
<glossdef>
<para>Partie de l'&eacute;cran ne contenant ni fen&ecirc;tres ni ic&ocirc;nes.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>autorisation</glossterm>
<glossdef>
<para>Param&egrave;tre indiquant le mode d'acc&egrave;s d'un utilisateur ou
d'un groupe d'utilisateurs &agrave; un fichier ou &agrave; un dossier (r&eacute;pertoire).
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>barre de d&eacute;filement</glossterm> 
<glossdef>
<para>Objet de commande situ&eacute; dans la partie droite ou inf&eacute;rieure
d'une fen&ecirc;tre et utilis&eacute; pour afficher les donn&eacute;es dont
la taille de la fen&ecirc;tre ne permet pas l'affichage.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>barre de menus</glossterm> 
<glossdef>
<para>Partie d'une fen&ecirc;tre d'application situ&eacute;e entre la barre
de titre et la zone de travail, dans laquelle les noms de menus sont affich&eacute;s.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>barre de titre</glossterm> 
<glossdef>
<para>Zone situ&eacute;e dans la partie sup&eacute;rieure d'une fen&ecirc;tre
; elle contient le nom de celle-ci, le bouton du menu Fen&ecirc;tre et les
boutons de r&eacute;duction et d'agrandissement.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Biblinfo</glossterm>
<glossdef>
<para>L'ensemble de fichiers qui constituent une biblioth&egrave;que d'informations.
Voir <emphasis>biblioth&egrave;que d'informations</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>biblioth&egrave;que d'informations</glossterm>
<glossdef>
<para>Une collection de rayons.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bitmap</glossterm> 
<glossdef>
<para>Image stock&eacute;e dans un format vectoriel. En principe, le terme
bitmap implique que l'image est limit&eacute;e &agrave; deux couleurs (une
couleur de premier plan et une couleur d'arri&egrave;re-plan). S'oppose &agrave; <symbol role="Variable">pixmap</symbol>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bo&icirc;te aux lettres en entr&eacute;e</glossterm>
<glossdef>
<para>Conteneur principal ou par d&eacute;faut du Programme courrier, dans
lequel les messages en entr&eacute;e sont stock&eacute;s. Vous pouvez ensuite
les transf&eacute;rer dans d'autres conteneurs.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bo&icirc;te de dialogue</glossterm>
<glossdef>
<para>Fen&ecirc;tre affich&eacute;e par une application et dans laquelle des
donn&eacute;es doivent &ecirc;tre entr&eacute;es par l'utilisateur.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bouton</glossterm> 
<glossdef>
<para>Terme g&eacute;n&eacute;rique utilis&eacute; pour les objets de commande
des fen&ecirc;tres. Voir <emphasis>bouton de fonction</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bouton (de fonction)</glossterm> 
<glossdef>
<para>Objet de commande dont l'action (ex&eacute;cution d'une commande, affichage
d'une fen&ecirc;tre ou d'un menu) est imm&eacute;diate; Appliquer est un
exemple de bouton de fonction.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bouton d'agrandissement</glossterm>
<glossdef>
<para>Bouton situ&eacute; dans la barre de titre d'une fen&ecirc;tre, permettant
d'augmenter ses dimensions au maximum.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bouton de r&eacute;duction</glossterm>
<glossdef>
<para>Bouton situ&eacute; dans la barre de titre d'une fen&ecirc;tre, permettant
de la r&eacute;duire &agrave; l'&eacute;tat d'ic&ocirc;ne.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bouton de verrouillage</glossterm>
<glossdef>
<para>Objet de commande du Tableau de bord qui permet de verrouiller l'&eacute;cran.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bouton du menu Fen&ecirc;tre</glossterm>
<glossdef>
<para>Objet de commande situ&eacute; dans l'angle sup&eacute;rieur gauche
d'une fen&ecirc;tre, pr&egrave;s de la barre de titre, et permettant d'afficher
le menu Fen&ecirc;tre.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bouton Exit</glossterm>
<glossdef>
<para>Objet de commande du Tableau de bord qui permet de mettre fin &agrave;
la session du Bureau.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bouton radio</glossterm> 
<glossdef>
<para>Objet de commande faisant g&eacute;n&eacute;ralement partie d'un groupe
dont l'&eacute;tat (activ&eacute; ou d&eacute;sactiv&eacute;) est indiqu&eacute;
par la pr&eacute;sence ou l'absence d'une marque.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bouton 1</glossterm>
<glossdef>
<para>Dans le cas d'une souris &agrave; trois boutons pour droitiers, bouton
de gauche; bouton de droite sur une souris pour gauchers. Ce bouton est
principalement utilis&eacute; pour la s&eacute;lection. Il s'agit du bouton
utilis&eacute; par d&eacute;faut pour cliquer.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bouton 2</glossterm>
<glossdef>
<para>Sur une souris &agrave; trois boutons, bouton du milieu. Dans le cas
d'une souris &agrave; deux boutons, bouton de droite (configuration pour
droitiers) ou bouton de gauche (configuration pour gauchers). Ce bouton peut
avoir une fonction de transfert ou de s&eacute;lection.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>bouton 3</glossterm>
<glossdef>
<para>Dans le cas d'une souris pour droitiers, bouton de droite; bouton de
gauche sur une souris pour gauchers. Ce bouton permet d'afficher les menus
instantan&eacute;s.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Bureau</glossterm>
<glossdef>
<para>Voir <emphasis>espace de travail</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>cadre de fen&ecirc;tre</glossterm> 
<glossdef>
<para>Partie visible d'une fen&ecirc;tre qui d&eacute;limite une application.
Un cadre de fen&ecirc;tre peut contenir jusqu'&agrave; cinq objets de commande
: barre de titre, contours de redimensionnement, boutons d'agrandissement
et de r&eacute;duction, et bouton du menu Fen&ecirc;tre.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Calculatrice</glossterm>
<glossdef>
<para>Application ex&eacute;cutant les m&ecirc;mes fonctions qu'une calculatrice
manuelle.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Caract&eacute;ristiques</glossterm>
<glossdef>
<para>Option de menu permettant de d&eacute;finir les propri&eacute;t&eacute;s
d'un &eacute;l&eacute;ment (sa date ou son nom, par exemple) ou d'en afficher
les signes distinctifs (polices).</para>
</glossdef>
</glossentry>
<glossentry><glossterm>caract&egrave;re d'interligne</glossterm> 
<glossdef>
<para>Caract&egrave;re invisible qui, dans un document, marque la fin d'une
ligne de texte. Il signifie &agrave; l'imprimante ou &agrave; l'&eacute;cran
une rupture de ligne et le d&eacute;but d'une nouvelle.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>case &agrave; cocher</glossterm>
<glossdef>
<para>Objet de commande pouvant &ecirc;tre activ&eacute; (marque affich&eacute;e)
ou d&eacute;sactiv&eacute; (pas de marque).</para>
</glossdef>
</glossentry>
<glossentry><glossterm>chemin d'acc&egrave;s</glossterm>
<glossdef>
<para>Cha&icirc;ne de caract&egrave;res indiquant l'emplacement hi&eacute;rarchique
d'un dossier (r&eacute;pertoire).</para>
</glossdef>
</glossentry>
<glossentry><glossterm>choisir</glossterm>
<glossdef>
<para>&Agrave; l'aide de la souris ou du clavier, activer une option de menu,
un bouton ou une ic&ocirc;ne afin de lancer une commande ou une action. S'oppose
&agrave; <emphasis>s&eacute;lectionner</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>cible de pose</glossterm>
<glossdef>
<para>Rectangle permettant d'identifier une zone de pose dans une application.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>client</glossterm> 
<glossdef>
<para>Syst&egrave;me ou application qui re&ccedil;oit les services d'une autre
application, g&eacute;n&eacute;ralement par l'interm&eacute;diaire du r&eacute;seau.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>cliquer</glossterm> 
<glossdef>
<para>Appuyer sur un bouton de la souris sans la d&eacute;placer, puis le
rel&acirc;cher; le bouton 1 est pris en compte par d&eacute;faut.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>cliquer deux fois</glossterm>
<glossdef>
<para>Appuyer sur un bouton de la souris (par d&eacute;faut, le bouton 1)
et le rel&acirc;cher &agrave; deux reprises, de fa&ccedil;on rapproch&eacute;e.
Cette op&eacute;ration permet g&eacute;n&eacute;ralement de s&eacute;lectionner
une option.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Common Desktop Environment (CDE)</glossterm>
<glossdef>
<para>Interface utilisateur graphique pour UNIX.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Configuration de l'impression</glossterm>
<glossdef>
<para>La bo&icirc;te de dialogue qui vous permet de sp&eacute;cifier des param&egrave;tres
d'impression pour l'imprimante actuellement s&eacute;lectionn&eacute;e, tels
que l'orientation de la page (mode Portrait ou Paysage), l'impression recto-verso
ou recto uniquement, ou la source de papier &agrave; utiliser. L'Agenda, le
Gestionnaire des informations, le Programme courrier et l'Editeur de texte
affichent tous cette bo&icirc;te de dialogue lorsque vous cliquez deux fois
sur le bouton Configurer dans leurs bo&icirc;tes de dialogue d'impression
respectives.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Configurer</glossterm>
<glossdef>
<para>Un bouton figurant dans les bo&icirc;tes de dialogue d'impression de
l'Agenda, du Gestionnaire d'informations, du Programme courrier et de l'Editeur
de texte; il affiche la bo&icirc;te de dialogue Configuration de l'impression.
Voir <emphasis>Configuration de l'impression</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>connexion</glossterm>
<glossdef>
<para>Ouverture d'une session du syst&egrave;me d'exploitation ou du Bureau,
&agrave; l'aide d'un nom d'utilisateur et d'un mot de passe.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>conteneur</glossterm>
<glossdef>
<para>Objet de commande dans lequel sont stock&eacute;s des objets ou des
donn&eacute;es (par exemple, un dossier ou un bloc-notes).</para>
<para>Dans le Programme courrier, bo&icirc;te aux lettres et syst&egrave;me
d'archivage contenant les messages &eacute;lectroniques. Vous pouvez afficher,
modifier, supprimer, imprimer, inclure, faire suivre les messages d'un bloc-notes,
et y r&eacute;pondre.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>conteneur de courrier</glossterm>
<glossdef>
<para>Bo&icirc;te aux lettres et syst&egrave;me d'archivage contenant les
messages &eacute;lectroniques. Vous pouvez afficher, modifier, supprimer,
imprimer, inclure, faire suivre les messages d'un conteneur, et y r&eacute;pondre.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>contour de redimensionnement</glossterm>
<glossdef>
<para>Objet de commande permettant de modifier la taille d'une fen&ecirc;tre
ou d'une sous-fen&ecirc;tre.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Corbeille</glossterm>
<glossdef>
<para>Conteneur de fichiers ou de dossiers supprim&eacute;s.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>courrier</glossterm>
<glossdef>
<para>Abr&eacute;viation de &ldquo;courrier &eacute;lectronique&rdquo;. Il
s'agit g&eacute;n&eacute;ralement de messages envoy&eacute;s &agrave; une
adresse &eacute;lectronique par l'interm&eacute;diaire d'un r&eacute;seau
et re&ccedil;us dans une bo&icirc;te aux lettres &eacute;lectronique.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Cr&eacute;ateur d'applications</glossterm>
<glossdef>
<para>Programme permettant de cr&eacute;er une interface utilisateur graphique.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Cr&eacute;er action</glossterm>
<glossdef>
<para>Application permettant d'associer une ic&ocirc;ne &agrave; une commande,
de fa&ccedil;on &agrave; lancer cette derni&egrave;re en cliquant sur l'ic&ocirc;ne
correspondante. Elle permet &eacute;galement de d&eacute;finir des types
de donn&eacute;es sp&eacute;cifiques pour les fichiers de donn&eacute;es
d'une applications, et de leur associer des ic&ocirc;nes.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>curseur</glossterm>
<glossdef>
<para>&Eacute;l&eacute;ment graphique d&eacute;signant la zone qui re&ccedil;oit
les commandes entr&eacute;es &agrave; partir du clavier ou de la souris.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>curseur de d&eacute;filement</glossterm>
<glossdef>
<para>&Eacute;l&eacute;ment d'une barre de d&eacute;filement indiquant l'emplacement
des informations affich&eacute;es, par rapport &agrave; la totalit&eacute;
des informations disponibles. Cliquez dessus pour afficher les informations
masqu&eacute;es.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>curseur de texte</glossterm>
<glossdef>
<para>Curseur indiquant l'emplacement o&ugrave; seront ins&eacute;r&eacute;es
les donn&eacute;es de type texte. Il se pr&eacute;sente g&eacute;n&eacute;ralement
sous la forme d'un I majuscule. S'oppose &agrave; <emphasis>curseur d'insertion</emphasis> et <emphasis>pointeur</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>d&eacute;connexion</glossterm>
<glossdef>
<para>Interruption d'une session du syst&egrave;me d'exploitation ou du Bureau.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>D&eacute;placer</glossterm>
<glossdef>
<para>Option du menu Fen&ecirc;tre, permettant d'amener une fen&ecirc;tre
&agrave; un emplacement diff&eacute;rent de l'&eacute;cran.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>dossier</glossterm>
<glossdef>
<para>Ic&ocirc;ne repr&eacute;sentant un <emphasis>r&eacute;pertoire</emphasis>.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>dossier en cours</glossterm>
<glossdef>
<para>Dossier ouvert dans une vue active du Gestionnaire de fichiers.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>dossier personnel</glossterm>
<glossdef>
<para>Dossier dans lequel sont conserv&eacute;s les fichiers et les r&eacute;pertoires
qui vous appartiennent. Par d&eacute;faut, ce r&eacute;pertoire est utilis&eacute;
lors de la premi&egrave;re ouverture des fen&ecirc;tres du Gestionnaire de
fichiers et de l'Emulateur de terminal. Dans le cas des commandes, ce dossier
peut &ecirc;tre appel&eacute; <emphasis>r&eacute;pertoire personnel</emphasis>.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>dossier p&egrave;re</glossterm>
<glossdef>
<para>Dossier contenant des sous-dossiers et des fichiers. Dans le cas des
commandes, ce dossier peut &ecirc;tre appel&eacute; <emphasis>r&eacute;pertoire
p&egrave;re</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>droits d'acc&egrave;s</glossterm>
<glossdef>
<para>Permission accord&eacute;e &agrave; un utilisateur ou &agrave; un groupe
d'utilisateurs d'effectuer certaines op&eacute;rations sur un fichier ou
un dossier (r&eacute;pertoire). Voir <emphasis>autorisation</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>&Eacute;conomiseur d'&eacute;cran</glossterm>
<glossdef>
<para>Fonction permettant de prolonger la dur&eacute;e de vie d'un &eacute;cran,
en le vidant ou en modifiant l'affichage au terme d'un d&eacute;lai donn&eacute;.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>&eacute;criture</glossterm>
<glossdef>
<para>Autorisation de modifier le contenu d'un fichier ou d'un dossier.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Editeur d'ic&ocirc;nes</glossterm>
<glossdef>
<para>Application permettant de cr&eacute;er et de modifier des ic&ocirc;nes.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Editeur de rendez-vous</glossterm>
<glossdef>
<para>Dans l'Agenda, fen&ecirc;tre &agrave; partir de laquelle les rendez-vous
peuvent &ecirc;tre planifi&eacute;s, modifi&eacute;s ou annul&eacute;s.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Editeur de texte</glossterm> 
<glossdef>
<para>Application servant &agrave; cr&eacute;er et &agrave; &eacute;diter
des documents.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>&eacute;l&eacute;ment</glossterm>
<glossdef>
<para>Terme g&eacute;n&eacute;rique d&eacute;signant une entit&eacute; autonome
faisant partie d'un ensemble (par exemple, une entr&eacute;e dans une liste
ou un objet de commande dans une fen&ecirc;tre).</para>
</glossdef>
</glossentry>
<glossentry><glossterm>&eacute;l&eacute;ment en cours, s&eacute;lection en
cours</glossterm>
<glossdef>
<para>&Eacute;l&eacute;ment mis en &eacute;vidence dans une liste.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>&eacute;mulateur de terminal</glossterm> 
<glossdef>
<para>Fen&ecirc;tre &eacute;mulant un type de terminal sp&eacute;cifique pour
l'ex&eacute;cution de programmes en environnement sans fen&ecirc;tres. L'utilisation
la plus courante des &eacute;mulateurs de terminal est l'interaction avec
le syst&egrave;me d'exploitation de votre ordinateur, au moyen de l'entr&eacute;e
de commandes.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>en-t&ecirc;te</glossterm>
<glossdef>
<para>Dans le Programme courrier, informations essentielles relatives &agrave;
un message (nom de l'exp&eacute;diteur, objet, date et heure de r&eacute;ception,
taille).</para>
</glossdef>
</glossentry>
<glossentry><glossterm>espace de travail</glossterm>
<glossdef>
<para>&Eacute;cran en cours, les ic&ocirc;nes et les fen&ecirc;tres qu'il
contient, et la zone vide sur laquelle les ic&ocirc;nes peuvent &ecirc;tre
pos&eacute;es.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ex&eacute;cuter</glossterm>
<glossdef>
<para>Lancer une application ou une action.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ex&eacute;cution</glossterm>
<glossdef>
<para>Droit d'acc&egrave;s &agrave; un fichier ou &agrave; un dossier (r&eacute;pertoire).
Dans le cas des fichiers (programmes ou scripts shells), cette permission
autorise l'utilisateur &agrave; les ex&eacute;cuter. Dans le cas des dossiers,
elle permet d'acc&eacute;der &agrave; leur contenu.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>extension</glossterm>
<glossdef>
<para>Partie finale d'un nom de fichier, s&eacute;par&eacute;e des autres
extensions ou du nom de base du fichier par un signe de ponctuation, tel
qu'un point.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>extension de fichier</glossterm>
<glossdef>
<para>Suffixe ajout&eacute; aux noms de fichiers, permettant d'identifier
leur type et de les classifier.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>faire d&eacute;filer</glossterm>
<glossdef>
<para>Visualiser le contenu d'une fen&ecirc;tre &eacute;cran par &eacute;cran,
g&eacute;n&eacute;ralement &agrave; l'aide de la barre de d&eacute;filement.
</para>
<para>D&eacute;placer le curseur de fa&ccedil;on incr&eacute;mentielle. Lors
du d&eacute;filement, la position du curseur est indiqu&eacute;e par le d&eacute;placement
des donn&eacute;es dans la fen&ecirc;tre.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>faire glisser</glossterm>
<glossdef>
<para>Appuyer sur un bouton de la souris et le maintenir enfonc&eacute; tout
en d&eacute;pla&ccedil;ant le pointeur &mdash; et l'objet qu'il d&eacute;signe
&mdash; &agrave; un emplacement diff&eacute;rent de l'&eacute;cran.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>faire glisser et poser</glossterm>
<glossdef>
<para>Manipuler directement une ic&ocirc;ne &agrave; l'aide d'un p&eacute;riph&eacute;rique
de pointage, pour l'amener &agrave; un autre emplacement.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>famille d'aide</glossterm>
<glossdef>
<para>Ensemble de <emphasis>volumes d'aide</emphasis> en ligne contenant des
informations sur des applications associ&eacute;es.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>fen&ecirc;tre</glossterm>
<glossdef>
<para>R&eacute;gion rectangulaire am&eacute;nag&eacute;e &agrave; l'&eacute;cran.
La plupart des applications comportent une fen&ecirc;tre principale qui donne
acc&egrave;s &agrave; des fen&ecirc;tres secondaires, appel&eacute;es <emphasis>bo&icirc;tes de dialogue</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>fen&ecirc;tre active</glossterm>
<glossdef>
<para>Fen&ecirc;tre sur laquelle est dirig&eacute;e l'entr&eacute;e clavier.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>fen&ecirc;tre d'aide</glossterm>
<glossdef>
<para>Fen&ecirc;tre secondaire contenant des informations d'aide.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>fen&ecirc;tre de composition</glossterm>
<glossdef>
<para>Dans le Programme courrier, fen&ecirc;tre permettant de cr&eacute;er
des messages &eacute;lectroniques et de les mettre en forme &agrave; l'aide
des nombreuses options de la barre de menus.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>fen&ecirc;tre de lecture</glossterm>
<glossdef>
<para>La fen&ecirc;tre du Gestionnaire d'informations qui affichent le texte,
les tables et les &eacute;l&eacute;ments graphiques d'un livre.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Fermer</glossterm>
<glossdef>
<para>Option de menu permettant de fermer une fen&ecirc;tre et les fen&ecirc;tres
qui lui sont associ&eacute;es, et de les supprimer de tous les espaces de
travail.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>fichier</glossterm>
<glossdef>
<para>Unit&eacute; de donn&eacute;es (texte, programme, image, etc.) stock&eacute;e
dans un dossier (r&eacute;pertoire).</para>
</glossdef>
</glossentry>
<glossentry><glossterm>fichier de configuration</glossterm>
<glossdef>
<para>Fichier permettant de personnaliser les caract&eacute;ristiques d'une
application.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>file d'attente</glossterm>
<glossdef>
<para>Liste ordonn&eacute;e de t&acirc;ches en attente de traitement.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>filtrer</glossterm>
<glossdef>
<para>Afficher les objets r&eacute;pondant &agrave; certains crit&egrave;res
(une cha&icirc;ne de caract&egrave;res dans un nom de fichier, par exemple)
et masquer ceux qui n'y correspondent pas.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>fl&egrave;che de d&eacute;filement</glossterm>
<glossdef>
<para>&Eacute;l&eacute;ment d'une barre de d&eacute;filement utilis&eacute;
pour faire d&eacute;filer petit &agrave; petit le contenu d'une fen&ecirc;tre
ou objet de commande du Tableau de bord permettant d'afficher ou de supprimer
les panneaux secondaires.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>fl&egrave;ches de d&eacute;placement</glossterm>
<glossdef>
<para>Les quatre touches directionnelles du curseur. Voir <emphasis>touches
de navigation</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>fond</glossterm>
<glossdef>
<para>Motif affich&eacute; &agrave; l'<emphasis>arri&egrave;re-plan de l'espace
de travail</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>fond de l'espace de travail</glossterm>
<glossdef>
<para>Voir <emphasis>fond.</emphasis></para>
</glossdef>
</glossentry>
<glossentry><glossterm>Gestionnaire d'aide</glossterm>
<glossdef>
<para>Volume d'aide particulier, qui r&eacute;pertorie tous les sujets d'aide
install&eacute;s sur le syst&egrave;me.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Gestionnaire d'applications</glossterm>
<glossdef>
<para>Fen&ecirc;tre contenant des objets qui repr&eacute;sentent les actions
disponibles sur le syst&egrave;me.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Gestionnaire d'impression</glossterm>
<glossdef>
<para>Application permettant d'afficher les imprimantes disponibles sur le
syst&egrave;me.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Gestionnaire de configuration</glossterm> 
<glossdef>
<para>Application permettant de personnaliser certains &eacute;l&eacute;ments
visuels et le comportement des unit&eacute;s syst&egrave;me de votre environnement
(couleurs et polices, comportement du clavier, de la souris, des fen&ecirc;tres,
lancement des sessions, etc.).</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Gestionnaire de fen&ecirc;tres</glossterm>
<glossdef>
<para>Application permettant aux utilisateurs de manipuler (ouvrir, redimensionner,
d&eacute;placer et fermer) les fen&ecirc;tres de l'espace de travail.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Gestionnaire de fichiers</glossterm>
<glossdef>
<para>Application charg&eacute;e de l'organisation des fichiers et des r&eacute;pertoires
du syst&egrave;me.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Gestionnaire de l'espace de travail</glossterm>
<glossdef>
<para>Application qui d&eacute;termine la taille, la position et le fonctionnement
des fen&ecirc;tres dans des espaces de travail multiples.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Gestionnaire de sessions</glossterm>
<glossdef>
<para>Application qui g&egrave;re la sauvegarde et la restauration des sessions,
le verrouillage et le d&eacute;verrouillage de l'&eacute;cran et l'utilisation
des &eacute;conomiseurs d'&eacute;cran. Lorsque vous sauvegardez une session,
l'environnement CDE (emplacement des ic&ocirc;nes, taille et position des
fen&ecirc;tres ouvertes, &eacute;tat des applications, palette de couleurs
en vigueur, etc.) est sauvegard&eacute;. Ainsi, ces param&egrave;tres peuvent
&ecirc;tre restaur&eacute;s lors de la connexion suivante.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Gestionnaire des informations</glossterm>
<glossdef>
<para>L'application qui vous permet de parcourir et de proc&eacute;der &agrave;
des recherches dans des collections de documents en ligne que l'on appelle <emphasis>biblioth&egrave;ques d'information<?Pub Caret>s</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>gris&eacute;</glossterm>
<glossdef>
<para>Couleur au contraste r&eacute;duit appliqu&eacute;e &agrave; une option,
par exemple, pour indiquer qu'elle n'est pas disponible.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>groupe</glossterm>
<glossdef>
<para>Ensemble d'utilisateurs regroup&eacute;s sous un m&ecirc;me nom.</para>
<para>Ensemble d'utilisateurs b&eacute;n&eacute;ficiant d'autorisations d'acc&egrave;s
communes.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>groupe d'applications</glossterm>
<glossdef>
<para>Dossier du Gestionnaire d'applications dans lequel sont stock&eacute;es
une ou plusieurs applications logicielles.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>historique</glossterm>
<glossdef>
<para>Liste des commandes, fichiers, dossiers ou sujets d'aide auxquels vous
avez acc&eacute;d&eacute; r&eacute;cemment.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Horloge</glossterm>
<glossdef>
<para>Objet de commande du Tableau de bord qui indique l'heure locale.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>hyperlien</glossterm> 
<glossdef>
<para>Dans un sujet d'aide, cha&icirc;ne de caract&egrave;res ou graphique
sur lequel vous pouvez cliquer pour afficher un autre sujet d'aide.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ic&ocirc;ne</glossterm>
<glossdef>
<para>Repr&eacute;sentation graphique d'un objet, constitu&eacute;e d'un dessin,
d'une image arri&egrave;re-plan et d'un libell&eacute;. Les ic&ocirc;nes
peuvent &ecirc;tre manipul&eacute;es directement.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ic&ocirc;ne Aide sur l'&eacute;l&eacute;ment</glossterm>
<glossdef>
<para>Objet de commande du Tableau de bord permettant de d'afficher l'aide
sur ce dernier.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ic&ocirc;ne d'action</glossterm> 
<glossdef>
<para>Ic&ocirc;ne du Gestionnaire de fichiers ou d'applications, ou de l'espace
de travail &agrave; laquelle correspond une action. Pour cr&eacute;er ce
type d'ic&ocirc;ne, cr&eacute;ez un fichier ex&eacute;cutable vide et attribuez-lui
le m&ecirc;me nom que l'action &agrave; laquelle il fait r&eacute;f&eacute;rence.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ic&ocirc;ne d'application</glossterm>
<glossdef>
<para>Voir <emphasis>ic&ocirc;ne d'action</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ic&ocirc;ne de fen&ecirc;tre</glossterm> 
<glossdef>
<para>Fen&ecirc;tre r&eacute;duite.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ic&ocirc;ne de l'espace de travail</glossterm>
<glossdef>
<para>Ic&ocirc;ne copi&eacute;e &agrave; partir du Gestionnaire de fichiers
sur l'espace de travail.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ic&ocirc;ne du Programme courrier</glossterm>
<glossdef>
<para>Objet de commande du Tableau de bord permettant de lancer le Programme
courrier. Lorsque vous posez un fichier dessus, celui-ci est charg&eacute;
dans la fen&ecirc;tre de composition du Programme courrier.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ic&ocirc;ne Imprimante</glossterm>
<glossdef>
<para>Objet de commande du Tableau de bord permettant de lancer l'application
Travaux d'impression. Lorsque vous posez un fichier sur cette ic&ocirc;ne,
une bo&icirc;te de dialogue s'affiche, &agrave; partir de laquelle vous pouvez
lancer l'impression du fichier sur l'imprimante par d&eacute;faut.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Index</glossterm>
<glossdef>
<para>Dans un volume d'aide, liste alphab&eacute;tique de mots ou d'expressions
dans laquelle vous pouvez rechercher l'aide sur un sujet donn&eacute;; elle
s'affiche lorsque vous s&eacute;lectionnez le bouton Index dans une bo&icirc;te
de dialogue d'aide.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Installer une ic&ocirc;ne</glossterm>
<glossdef>
<para>Option d'un panneau secondaire permettant d'installer des ic&ocirc;nes
sur le Tableau de bord, en utilisant la m&eacute;thode <emphasis>&ldquo;glisser-poser&rdquo;</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>interrompre</glossterm>
<glossdef>
<para>Suspendre momentan&eacute;ment un processus, sans y mettre fin.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>inverser</glossterm>
<glossdef>
<para>Activer ou d&eacute;sactiver un objet de commande tel qu'un bouton radio
ou une case &agrave; cocher, &agrave; l'aide de la souris ou du clavier.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>invite de ligne de commande</glossterm> 
<glossdef>
<para>Signe, g&eacute;n&eacute;ralement <command>%</command>, <filename>></filename> ou <filename>$</filename>, indiquant que l'ordinateur est pr&ecirc;t
&agrave; recevoir des commandes. Dans une fen&ecirc;tre d'&eacute;mulation
de terminal, appuyez sur Entr&eacute;e pour afficher l'invite de ligne de
commande.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ITE</glossterm> 
<glossdef>
<para>Emulateur interne de terminal (EIT). Il permet d'utiliser un &eacute;cran
en mode point comme terminal (par l'interm&eacute;diaire de l'option Connexion
&agrave; partir de la ligne de commande de l'&eacute;cran de connexion).
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>lecture</glossterm>
<glossdef>
<para>Autorisation de visualiser un fichier ou d'afficher le contenu d'un
dossier (r&eacute;pertoire).</para>
</glossdef>
</glossentry>
<glossentry><glossterm>libell&eacute;</glossterm>
<glossdef>
<para>Cha&icirc;ne de caract&egrave;res associ&eacute;e &agrave; une ic&ocirc;ne
ou &agrave; un objet de commande et indiquant son nom.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>libell&eacute; d'action</glossterm>
<glossdef>
<para>Nom apparaissant sous une ic&ocirc;ne d'action. Voir <emphasis>nom d'action</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>lien</glossterm>
<glossdef>
<para>Synonyme de <emphasis>lien symbolique</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>lien symbolique</glossterm>
<glossdef>
<para>Type de lien qui pointe vers un fichier ou un r&eacute;pertoire r&eacute;sidant
sur une autre unit&eacute; de stockage physique ou sur une autre partition.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>liste</glossterm> 
<glossdef>
<para>Objet de commande, &eacute;galement appel&eacute; liste de s&eacute;lection,
contenant des options que vous pouvez s&eacute;lectionner.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>liste de livres</glossterm>
<glossdef>
<para>La liste de rayons de biblioth&egrave;que et de livres disponibles aupr&egrave;s
du Gestionnaire des informations.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Liste de livres, fen&ecirc;tre</glossterm>
<glossdef>
<para>La bo&icirc;te de dialogue Gestionnaire des informations qui permet
l'acc&egrave;s aux informations stock&eacute;es dans une biblioth&egrave;que
d'informations, &agrave; des fins d'affichage ou d'impression.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Liste de rendez-vous</glossterm>
<glossdef>
<para>Liste r&eacute;pertoriant les rendez-vous de l'Agenda, dans l'ordre
chronologique.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>livre</glossterm>
<glossdef>
<para>Livre &eacute;lectronique. Voir aussi <emphasis>rayon</emphasis> et <emphasis>biblioth&egrave;que d'informations</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>manette de r&eacute;glage</glossterm>
<glossdef>
<para>Sur une barre de partage, &eacute;l&eacute;ment permettant de d'augmenter
ou de r&eacute;duire la taille d'une sous-fen&ecirc;tre &agrave; l'aide de
la souris. Vous pouvez y acc&eacute;der &agrave; l'aide du clavier.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>mappage</glossterm> 
<glossdef>
<para>Utilisation d'une action pour en lancer une autre, ou mise en correspondance
des &eacute;l&eacute;ments d'un ensemble avec ceux d'un autre ensemble.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>menu</glossterm> 
<glossdef>
<para>Liste d'options permettant d'effectuer des op&eacute;rations dans le
cadre d'une application. Voir <emphasis>sous-menu</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>menu d&eacute;roulant</glossterm>
<glossdef>
<para>Menu contenant des options associ&eacute;es, affich&eacute; lorsque
vous cliquez sur une option de barre de menus ou sur le bouton du menu Fen&ecirc;tre
&agrave; l'aide du bouton 1 de la souris.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>menu de l'espace de travail</glossterm> 
<glossdef>
<para>Menu qui s'affiche lorsque vous cliquez sur le bouton 3 de la souris
lorsque le pointeur se trouve sur une zone vide de l'espace de travail.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>menu Fen&ecirc;tre</glossterm> 
<glossdef>
<para>Menu qui s'affiche lorsque vous s&eacute;lectionnez le bouton du menu
Fen&ecirc;tre. Il contient des options permettant de modifier l'emplacement
ou la taille d'une fen&ecirc;tre (D&eacute;placer, Dimensionner, R&eacute;duire
et Agrandir).</para>
</glossdef>
</glossentry>
<glossentry><glossterm>menu instantan&eacute;</glossterm>
<glossdef>
<para>Menu associ&eacute; &agrave; un objet, qui s'affiche lorsque vous cliquez
sur le bouton 3 ou que vous appuyez sur Maj+F10.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>message d'erreur</glossterm>
<glossdef>
<para>Message dont l'utilisateur doit prendre connaissance de mani&egrave;re
urgente, d&eacute;crivant g&eacute;n&eacute;ralement un incident utilisateur.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>mise en &eacute;vidence</glossterm>
<glossdef>
<para>Op&eacute;ration consistant &agrave; distinguer un &eacute;l&eacute;ment,
en le s&eacute;lectionnant ou en le choisissant. Indicateur visuel d&eacute;signant
un &eacute;l&eacute;ment s&eacute;lectionn&eacute;.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>mn&eacute;monique</glossterm>
<glossdef>
<para>Caract&egrave;re unique soulign&eacute; dans une commande. Lorsque vous
tapez cette lettre, la commande correspondante est s&eacute;lectionn&eacute;e.
Si les mn&eacute;moniques sont g&eacute;n&eacute;ralement utilis&eacute;es
dans les options de menus, elles peuvent &eacute;galement &ecirc;tre associ&eacute;es
&agrave; des boutons.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>mod&egrave;le</glossterm>
<glossdef>
<para>Dans le Programme courrier, fichier ASCII permettant d'ins&eacute;rer
des informations fr&eacute;quemment utilis&eacute;es (votre nom et votre
adresse &eacute;lectronique, par exemple) dans vos messages.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>mot de passe</glossterm>
<glossdef>
<para>Cha&icirc;ne de caract&egrave;res permettant au syst&egrave;me d'identifier
un utilisateur.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>nom d'action</glossterm>
<glossdef>
<para>Nom associ&eacute; &agrave; une action, affich&eacute; par d&eacute;faut
sous l'ic&ocirc;ne correspondante. Voir <emphasis>libell&eacute; d'action</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>nom d'utilisateur</glossterm>
<glossdef>
<para>Identificateur d'un utilisateur sur le syst&egrave;me (parfois appel&eacute;
nom de connexion). Par exemple, le nom d'utilisateur de Jean Martin peut
&ecirc;tre jmartin. Ce nom doit &ecirc;tre indiqu&eacute; sur l'&eacute;cran
de connexion.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>nom de base</glossterm>
<glossdef>
<para>Nom d'un fichier d'ic&ocirc;ne, sans les extensions indiquant sa taille
(<filename>.l</filename>, <filename>.m</filename>, <filename>.s</filename>
et <filename>.t</filename>) et son type (<filename>.bm</filename> ou <filename>.pm</filename>). Par exemple, le nom de base du fichier <filename>ic&ocirc;ne.m.pm</filename> est <filename>ic&ocirc;ne</filename>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>nom de fichier</glossterm>
<glossdef>
<para>Identificateur d'un fichier dans un dossier ou sur une unit&eacute;
de stockage; il se compose g&eacute;n&eacute;ralement d'un nom de base et
d'une ou plusieurs extensions. Les noms de fichiers complets comprennent
&eacute;galement le chemin d'acc&egrave;s au fichier.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>objet</glossterm>
<glossdef>
<para>Donn&eacute;e logique associ&eacute;e &agrave; un comportement sp&eacute;cifique.
Ainsi, dans le Gestionnaire de fichiers, l'ensemble des fichiers, r&eacute;pertoires,
actions et applications sont consid&eacute;r&eacute;s comme des objets. A
chaque type d'objet est associ&eacute;e une action sp&eacute;cifique; le
plus souvent, un objet est repr&eacute;sent&eacute; par une ic&ocirc;ne.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>objet de commande</glossterm> 
<glossdef>
<para>Terme g&eacute;n&eacute;rique utilis&eacute; pour tous les &eacute;l&eacute;ments
(boutons, cases &agrave; cocher, barres de d&eacute;filement, etc.) permettant
d'ex&eacute;cuter une action ou de d&eacute;finir un param&egrave;tre. Voir <emphasis>objet de commande du Tableau de bord</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>objet de commande du Tableau de bord</glossterm>
<glossdef>
<para>Objet servant d'interface avec les fonctions de base du syst&egrave;me
et les op&eacute;rations courantes. Les objets par d&eacute;faut du Tableau
de bord sont l'Horloge, l'Agenda, le Programme courrier, l'Editeur de texte,
l'Afficheur d'aide, le Gestionnaire de fichiers, l'Imprimante, le Gestionnaire
de configuration, le Gestionnaire d'applications et la Corbeille.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>objet de l'espace de travail</glossterm>
<glossdef>
<para>Objet appartenant &agrave; un espace de travail, et non &agrave; un
afficheur ou une fen&ecirc;tre. Il peut s'agir d'une fen&ecirc;tre, d'une
ic&ocirc;ne (fen&ecirc;tre r&eacute;duite) ou d'un objet du Gestionnaire
de fichiers ou d'applications pos&eacute; sur l'espace de travail.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>OK</glossterm>
<glossdef>
<para>Option permettant de valider les donn&eacute;es entr&eacute;es dans
une fen&ecirc;tre et de la fermer. Si des modifications ont &eacute;t&eacute;
apport&eacute;es, elles sont appliqu&eacute;es avant la fermeture de la fen&ecirc;tre.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>option de menu</glossterm>
<glossdef>
<para>&Eacute;l&eacute;ment d'un menu pouvant &ecirc;tre s&eacute;lectionn&eacute;
(par exemple, l'option Copier du menu Editer).</para>
</glossdef>
</glossentry>
<glossentry><glossterm>palette</glossterm>
<glossdef>
<para>Ensemble d'options (couleurs ou outils) affich&eacute;es sous forme
graphique, parmi lesquelles vous pouvez effectuer une s&eacute;lection.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>panneau secondaire</glossterm>
<glossdef>
<para>&Eacute;l&eacute;ment du Tableau de bord qui vous d&eacute;roulez vers
le haut, comportant des commandes suppl&eacute;mentaires. Ils contiennent
g&eacute;n&eacute;ralement des groupes d'objets de commande associ&eacute;s.
Synonyme de panneau secondaire.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>par d&eacute;faut</glossterm>
<glossdef>
<para>Se dit d'une valeur d&eacute;finie automatiquement par une application.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>personnalisation</glossterm>
<glossdef>
<para>Modification des param&egrave;tres affectant l'aspect et le comportement
du Bureau et des applications qui s'y ex&eacute;cutent.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>pi&egrave;ce jointe</glossterm>
<glossdef>
<para>Dans le Programme courrier, fichier de donn&eacute;es (texte, audio
ou graphiques) associ&eacute; &agrave; un message et affich&eacute; sous
forme d'ic&ocirc;ne dans la liste des pi&egrave;ces jointes. De nombreux
messages peuvent &ecirc;tre joints &agrave; un message &eacute;lectronique.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>pixmap</glossterm> 
<glossdef>
<para>Image stock&eacute;e dans un format vectoriel. G&eacute;n&eacute;ralement,
le terme pixmap sous- entend que l'image peut utiliser plus de deux couleurs.
S'oppose &agrave; <symbol role="Variable">bitmap</symbol>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>poign&eacute;es</glossterm>
<glossdef>
<para>Petits carr&eacute;s apparaissant dans les angles et au centre d'un
&eacute;l&eacute;ment graphique s&eacute;lectionn&eacute;.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>poign&eacute;es de d&eacute;placement</glossterm>
<glossdef>
<para>Zones situ&eacute;es de part et d'autre du Tableau de bord, permettant
de le d&eacute;placer et de l'amener au premier plan de l'espace de travail.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>point d'insertion</glossterm>
<glossdef>
<para>Emplacement de l'&eacute;cran o&ugrave; s'affichent les donn&eacute;es
entr&eacute;es au clavier ou coll&eacute;es &agrave; partir du presse-papiers
ou d'un fichier. Dans un texte, cet &eacute;l&eacute;ment est appel&eacute;
<emphasis>curseur</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>pointer</glossterm>
<glossdef>
<para>D&eacute;placer le pointeur de la souris jusqu'&agrave; un emplacement
donn&eacute; de l'&eacute;cran.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>pointeur</glossterm>
<glossdef>
<para>Curseur d&eacute;signant la zone de l'&eacute;cran vers laquelle sont
dirig&eacute;es les commandes entr&eacute;es &agrave; partir d'un p&eacute;riph&eacute;rique
de pointage. Il peut avoir la forme d'une fl&egrave;che, d'un I, d'une croix,
etc. Voir <emphasis>curseur</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>police</glossterm>
<glossdef>
<para>Assortiment complet de caract&egrave;res (lettres, chiffres et caract&egrave;res
sp&eacute;ciaux) dans un corps et un type de police sp&eacute;cifiques (par
exemple, Helvetica dix points, gras).</para>
</glossdef>
</glossentry>
<glossentry><glossterm>poser</glossterm>
<glossdef>
<para>Rel&acirc;cher le bouton de la souris apr&egrave;s avoir fait glisser
un objet. Si celui-ci est pos&eacute; sur une zone appropri&eacute;e, une
action est ex&eacute;cut&eacute;e.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>premier plan</glossterm>
<glossdef>
<para>Contenu d'une fen&ecirc;tre et couleur ou ombrage permettant de la distinguer
de l'arri&egrave;re-plan.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Presse-papiers</glossterm>
<glossdef>
<para>M&eacute;moire tampon destin&eacute;e au stockage provisoire des derni&egrave;res
donn&eacute;es supprim&eacute;es, copi&eacute;es ou coll&eacute;es.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>programme</glossterm>
<glossdef>
<para>S&eacute;quence d'instructions pouvant &ecirc;tre interpr&eacute;t&eacute;es
et ex&eacute;cut&eacute;es par un ordinateur.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Programme courrier</glossterm>
<glossdef>
<para>Application permettant d'envoyer, de recevoir et de composer des messages
de courrier &eacute;lectronique.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>raccourci</glossterm>
<glossdef>
<para>Terme g&eacute;n&eacute;rique utilis&eacute; pour les actions de la
souris destin&eacute;es &agrave; faciliter l'utilisation des bo&icirc;tes
de dialogue. Par exemple, pour s&eacute;lectionner un &eacute;l&eacute;ment
de la liste de fichiers et valider votre choix, cliquez deux fois sur le
fichier voulu.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>rayon</glossterm>
<glossdef>
<para>Groupe de livres &eacute;lectoniques sur des sujets connexes, regroup&eacute;s
dans un &ldquo;rayon&rdquo; de biblioth&egrave;que. Un ensemble logique d'informations
(le cas &eacute;ch&eacute;ant, plusieurs livres connexes) accompagn&eacute;
par un seul index avec capacit&eacute;s de recherche textuelle. Un rayon (de
biblioth&egrave;que) et les feuilles de style repr&eacute;sentent la collection
minimale de donn&eacute;es pouvant &ecirc;tre &eacute;labor&eacute;e sous
forme de biblioth&egrave;que d'informations. Voir aussi <emphasis>biblioth&egrave;que
d'informations</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>R&eacute;duire</glossterm>
<glossdef>
<para>Transformer une fen&ecirc;tre en ic&ocirc;ne. Le bouton permettant d'effectuer
cette op&eacute;ration est situ&eacute; dans l'angle sup&eacute;rieur droit
du cadre de la fen&ecirc;tre.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>R&eacute;initialiser</glossterm>
<glossdef>
<para>Bouton ou option de menu permettant de r&eacute;tablir l'&eacute;tat
pr&eacute;c&eacute;dent d'un &eacute;l&eacute;ment (celui en vigueur lors
de son ouverture ou avant sa derni&egrave;re modification).</para>
</glossdef>
</glossentry>
<glossentry><glossterm><symbol role="Variable">R&eacute;p_personnel</symbol></glossterm> 
<glossdef>
<para>Repr&eacute;sente votre r&eacute;pertoire personnel. Par exemple, s'il
s'agit de <filename>/u/anna</filename>, <filename>/</filename><symbol role="Variable">R&eacute;p_personnel</symbol><filename>/bitmaps/smile.bm</filename> correspond
&agrave; <filename>/u/anna/bitmaps/smile.bm</filename>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Renvoi &agrave; la ligne</glossterm>
<glossdef>
<para>1) Programme courrier: fen&ecirc;tre de composition: menu Format:
utilisez cette option pour obliger le renvoi automatique &agrave; la ligne
suivante du texte que vous saisissez dans la fen&ecirc;tre de composition,
sans qu'il soit n&eacute;cessaire d'appuyer sur Retour.</para>
<para>2) Programme courrier: bo&icirc;te de dialogue Imprimer: utilisez
cette option pour emp&ecirc;cher la troncature des lignes trop longues pour
tenir sur une page imprim&eacute;e.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>r&eacute;pertoire</glossterm>
<glossdef>
<para>Ensemble de fichiers et de sous-r&eacute;pertoires. Dans les applications
&agrave; interface graphique, ce type de conteneur peut &ecirc;tre appel&eacute; <emphasis>dossier</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>r&eacute;pertoire personnel</glossterm>
<glossdef>
<para>R&eacute;pertoire dans lequel sont conserv&eacute;s les fichiers et
d'autres sous-r&eacute;pertoires qui vous appartiennent. Dans les applications
&agrave; interface graphique, ce type de conteneur peut &ecirc;tre appel&eacute; <emphasis>dossier personnel</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>r&eacute;pertoire p&egrave;re</glossterm>
<glossdef>
<para>R&eacute;pertoire contenant des sous-r&eacute;pertoires et des fichiers.
Dans les applications &agrave; interface utilisateur graphique, ce conteneur
peut &ecirc;tre appel&eacute; <emphasis>dossier p&egrave;re</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>r&eacute;pertoire root</glossterm>
<glossdef>
<para>Dans un syst&egrave;me de fichiers hi&eacute;rarchique, r&eacute;pertoire
qui contient tous les autres sous-r&eacute;pertoires et fichiers; repr&eacute;sent&eacute;
par une barre oblique (/) dans les syst&egrave;mes UNIX.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>r&eacute;union</glossterm>
<glossdef>
<para>Dans l'Agenda, rendez-vous concernant plusieurs utilisateurs, planifi&eacute;
&agrave; l'aide de l'&eacute;diteur appropri&eacute;.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>relancer</glossterm>
<glossdef>
<para>Arr&ecirc;ter un processus et le red&eacute;marrer.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>ressource</glossterm>
<glossdef>
<para>Dans le syst&egrave;me X Window <superscript>TM</superscript>, m&eacute;canisme
de d&eacute;finition d'un attribut (aspect ou comportement) de fen&ecirc;tre
ou d'application. En g&eacute;n&eacute;ral, les ressources portent le m&ecirc;me
nom que les &eacute;l&eacute;ments auxquels elles se rapportent.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Restaurer</glossterm>
<glossdef>
<para>Option de menu permettant de r&eacute;tablir la taille et l'emplacement
pr&eacute;c&eacute;dents d'une fen&ecirc;tre (avant que vous l'agrandissiez
ou la r&eacute;duisiez).</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Revenir</glossterm>
<glossdef>
<para>Dans le Gestionnaire d'aide, bouton et option du menu Naviguer permettant
de r&eacute;afficher le sujet pr&eacute;c&eacute;dent.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>r&egrave;gle</glossterm>
<glossdef>
<para>Objet de commande comprenant une coulisse et un curseur permettant de
s&eacute;lectionner une valeur dans une plage. La position du curseur indique
la valeur en cours.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>root</glossterm>
<glossdef>
<para>Voir <emphasis>utilisateur root</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>section</glossterm>
<glossdef>
<para>Une unit&eacute; individuelle de documentation qui est affich&eacute;e
dans une fen&ecirc;tre de lecture de l'utilitaire de consultation Gestionnaire
d'informations.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>s&eacute;lecteur d'espace de travail</glossterm>
<glossdef>
<para>Objet de commande permettant d'afficher un autre espace de travail.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>s&eacute;lection &eacute;tendue</glossterm>
<glossdef>
<para>Action d'ajouter plusieurs &eacute;l&eacute;ments &agrave; une s&eacute;lection,
en amenant le pointeur sur les &eacute;l&eacute;ments voulus et en appuyant
simultan&eacute;ment sur la touche Ctrl et sur le bouton de s&eacute;lection
de la souris.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>s&eacute;lectionner</glossterm>
<glossdef>
<para>Mettre en &eacute;vidence un &eacute;l&eacute;ment de sorte qu'il puisse
&ecirc;tre trait&eacute; ou activ&eacute;. Cette op&eacute;ration ne d&eacute;clenche
aucune action; elle modifie l'&eacute;tat de l'&eacute;l&eacute;ment (elle
permet par exemple d'activer une case &agrave; cocher).</para>
</glossdef>
</glossentry>
<glossentry><glossterm>S&eacute;lectionner l'imprimante</glossterm>
<glossdef>
<para>Dans le Gestionnaire d'impression: utilisez cette option pour obtenir
des informations sur les imprimantes disponibles et s&eacute;lectionner l'imprimante
&agrave; utiliser.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>serveur</glossterm>
<glossdef>
<para>Syst&egrave;me qui fournit des services &agrave; un client.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>serveur d'applications</glossterm> 
<glossdef>
<para>Ordinateur h&ocirc;te permettant d'acc&eacute;der &agrave; une application.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>serveur de fichiers</glossterm>
<glossdef>
<para>Ordinateur h&ocirc;te sur lequel sont stock&eacute;s les fichiers de
donn&eacute;es utilis&eacute;s par des applications.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>serveur de sessions</glossterm> 
<glossdef>
<para>Syst&egrave;me permettant d'ouvrir des sessions en r&eacute;seau. Il
contient les fichiers de sessions, utilis&eacute;s lors de chaque connexion
&agrave; un syst&egrave;me du r&eacute;seau.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>session</glossterm>
<glossdef>
<para>D&eacute;lai &eacute;coul&eacute; entre la <emphasis>connexion</emphasis>
et la <emphasis>d&eacute;connexion</emphasis> d'un utilisateur. Il s'agit
&eacute;galement d'une configuration de l'espace de travail, comprenant les
param&egrave;tres du Gestionnaire de configuration, les applications ouvertes
et la taille et l'emplacement des objets.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>session en cours</glossterm>
<glossdef>
<para>Session sauvegard&eacute;e par le Gestionnaire de sessions lorsque vous
vous d&eacute;connectez. &Agrave; la prochaine connexion (sauf indication
contraire), c'est cette session qui sera ouverte, vous permettant de reprendre
votre travail l&agrave; o&ugrave; vous l'avez interrompu. S'oppose &agrave; <emphasis>session initiale</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>session initiale</glossterm>
<glossdef>
<para>Session (diff&eacute;rente de la session en cours) sauvegard&eacute;e
lors de la d&eacute;connexion, qui sera automatiquement ouverte &agrave;
la prochaine connexion.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>souris</glossterm>
<glossdef>
<para>P&eacute;riph&eacute;rique permettant de d&eacute;placer le pointeur
et d'effectuer des s&eacute;lections.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>sous-dossier</glossterm>
<glossdef>
<para>Dossier cr&eacute;&eacute; dans un autre dossier (parfois appel&eacute; <emphasis>dossier p&egrave;re</emphasis>). Dans le cas des commandes, ce dossier peut
&ecirc;tre appel&eacute; <emphasis>sous-r&eacute;pertoire</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>sous-menu</glossterm>
<glossdef>
<para>Menu qui s'affiche lorsque vous s&eacute;lectionnez une option dans
un menu.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>sous-r&eacute;pertoire</glossterm>
<glossdef>
<para>R&eacute;pertoire cr&eacute;&eacute; dans un autre r&eacute;pertoire
(parfois appel&eacute; <emphasis>r&eacute;pertoire p&egrave;re</emphasis>).
Dans les applications &agrave; interface utilisateur graphique, ce conteneur
peut &ecirc;tre appel&eacute; <emphasis>sous-dossier</emphasis>.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>syst&egrave;me de fichiers hi&eacute;rarchique</glossterm>
<glossdef>
<para>M&eacute;thode d'organisation des donn&eacute;es, utilisant des conteneurs
(dossiers) et des fichiers. Les dossiers peuvent contenir d'autres dossiers
et des fichiers. L'imbrication des dossiers cr&eacute;e les niveaux d'organisation
(hi&eacute;rarchie).</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Tableau de bord</glossterm>
<glossdef>
<para>Fen&ecirc;tre centrale contenant divers objets de commande qui permettent
d'acc&eacute;der &agrave; des applications et &agrave; des utilitaires. Le
tableau de bord contient le <emphasis>s&eacute;lecteur d'espace de travail</emphasis> (zone de commutation); il occupe l'ensemble des espaces de travail.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Tableau principal</glossterm>
<glossdef>
<para>Partie du Tableau de bord excluant les panneaux secondaires.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>t&eacute;moin d'activit&eacute;</glossterm>
<glossdef>
<para>Objet de commande qui clignote lorsqu'une action est lanc&eacute;e &agrave;
partir du Tableau de bord, avant l'affichage d'une fen&ecirc;tre ou le rechargement
des actions.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Terminal</glossterm>
<glossdef>
<para>Sur le Tableau de bord, option du panneau secondaire Applications personnelles
qui permet d'ouvrir une fen&ecirc;tre d'&eacute;mulation de terminal.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>touche d'aide</glossterm>
<glossdef>
<para>Touche (g&eacute;n&eacute;ralement, F1) permettant d'afficher l'aide
en ligne relative &agrave; l'&eacute;l&eacute;ment d&eacute;sign&eacute;
par le curseur.</para>
<para>Certains claviers sont dot&eacute;s d'une touche d'aide sp&eacute;cifique,
qui remplace la touche F1.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>touche de modification</glossterm> 
<glossdef>
<para>Dans une combinaison de touches ou d'une touche avec un bouton de souris,
touche qui modifie la signification de la seconde touche ou du bouton de
la souris (Ctrl, Alt et Maj, par exemple).</para>
</glossdef>
</glossentry>
<glossentry><glossterm>touches de navigation</glossterm>
<glossdef>
<para>Touches permettant de modifier la position du curseur: fl&egrave;ches
de d&eacute;placement (associ&eacute;es ou non &agrave; la touche Ctrl),
touche de tabulation (avec ou sans les touches Ctrl ou Maj), touches Pos1
et Fin (avec ou sans la touche Ctrl) et touches PgAv et PgAr.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>touches de raccourci</glossterm>
<glossdef>
<para>S&eacute;quences de touches permettant d'activer une option de menu,
g&eacute;n&eacute;ralement &agrave; l'aide d'une touche acc&eacute;l&eacute;ratrice.
Par exemple, pour s&eacute;lectionner l'option Imprimer du menu Fichier,
appuyez sur Alt+F.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>Travaux d'impression</glossterm>
<glossdef>
<para>Application permettant d'obtenir des informations sur les travaux en
cours sur une imprimante.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>type d'objet</glossterm> 
<glossdef>
<para>M&eacute;canisme logique du Bureau permettant d'associer des fichiers
de donn&eacute;es sp&eacute;cifiques aux applications et actions appropri&eacute;es.
Il d&eacute;finit les crit&egrave;res d'association du fichier (nom ou contenu,
par exemple), aspect (ic&ocirc;ne utilis&eacute;e dans le Gestionnaire de
fichiers) et comportement de l'objet (lorsque l'utilisateur clique deux fois
dessus, par exemple).</para>
</glossdef>
</glossentry>
<glossentry><glossterm>type de donn&eacute;es</glossterm>
<glossdef>
<para>M&eacute;canisme permettant d'associer des fichiers de donn&eacute;es
sp&eacute;cifiques aux applications et actions appropri&eacute;es. Les types
de donn&eacute;es indiquent le type d'un fichier en fonction de son contenu
ou des conventions d'appellation utilis&eacute;es (son extension, par exemple).
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>type de fichier</glossterm>
<glossdef>
<para>Caract&eacute;ristiques d'un fichier d&eacute;terminant la fa&ccedil;on
dont il est utilis&eacute;. Le type d'un fichier peut &ecirc;tre d&eacute;fini
par une partie de son nom (son extension, par exemple) ou par son contenu.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>utilisateur root</glossterm> 
<glossdef>
<para>Mode de connexion qui accorde &agrave; l'utilisateur l'autorisation
de modifier des fichiers syst&egrave;me. L'utilisateur root est &eacute;galement
appel&eacute; &ldquo;superutilisateur&rdquo; ou simplement &ldquo;root&ldquo;,
puisque son ID utilisateur est <command>root</command>. Sur la plupart des
syst&egrave;mes, seul un nombre restreint d'utilisateurs est habilit&eacute;
&agrave; recevoir le statut d'utilisateur root.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>variables d'environnement</glossterm>
<glossdef>
<para>Variables UNIX standard utilis&eacute;es par le shell et les applications.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>verrouillage d'&eacute;cran</glossterm>
<glossdef>
<para>Fonction permettant d'emp&ecirc;cher l'acc&egrave;s &agrave; un &eacute;cran,
jusqu'&agrave; ce que le mot de passe appropri&eacute; soit entr&eacute;.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>volume d'aide</glossterm>
<glossdef>
<para>Ensemble des informations d'aide relative &agrave; un sujet.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>vue de l'Agenda</glossterm>
<glossdef>
<para>Jour, semaine, mois ou ann&eacute;e affich&eacute;s dans la fen&ecirc;tre
principale de l'Agenda.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>vue en arborescence</glossterm>
<glossdef>
<para>Vue d'un dossier ou de fichiers, comprenant tous les dossiers de niveau
inf&eacute;rieur du chemin de recherche.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>zone d'&eacute;tat</glossterm>
<glossdef>
<para>Partie d'une fen&ecirc;tre contenant des informations relatives &agrave;
l'&eacute;tat d'un objet ou d'une vue donn&eacute;e d'un objet.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>zone d'entr&eacute;e</glossterm>
<glossdef>
<para>R&eacute;gion mise en &eacute;vidence vers laquelle sont dirig&eacute;es
les commandes entr&eacute;es &agrave; partir du clavier.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>zone de commutation de l'espace de travail</glossterm>
<glossdef>
<para>R&eacute;gion rectangulaire situ&eacute;e dans la partie centrale du
Tableau de bord, contenant le s&eacute;lecteur d'espace de travail, les ic&ocirc;nes
de verrouillage et de sortie, ainsi que le t&eacute;moin d'activit&eacute;.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>zone de pose</glossterm> 
<glossdef>
<para>R&eacute;gion de l'espace de travail, telle que les ic&ocirc;nes Corbeille,
Gestionnaire d'impression et Programme courrier du Tableau de bord, sur laquelle
une ic&ocirc;ne peut &ecirc;tre pos&eacute;e. Pour faciliter l'acc&egrave;s
aux ic&ocirc;nes, vous pouvez les poser directement sur l'espace de travail.
</para>
</glossdef>
</glossentry>
<glossentry><glossterm>zone de texte</glossterm> 
<glossdef>
<para>R&eacute;gion rectangulaire d'une fen&ecirc;tre r&eacute;serv&eacute;e
&agrave; la frappe de donn&eacute;es. Les zones dans lesquelles vous pouvez
entrer du texte &agrave; partir du clavier comportent un curseur d'insertion
de texte clignotant.</para>
</glossdef>
</glossentry>
<glossentry><glossterm>zone de travail</glossterm>
<glossdef>
<para>Partie d'une fen&ecirc;tre contenant des objets de commande et du texte.
</para>
</glossdef>
</glossentry>
</glossary>
<!--fickle 1.14 mif-to-docbook 1.7 01/02/96 15:44:23-->
<?Pub *0000093289>
