<!-- $XConsortium: ch06.sgm /main/11 1996/12/21 16:07:59 rws $ -->
<!-- (c) Copyright 1995 Digital Equipment Corporation. -->
<!-- (c) Copyright 1995 Hewlett-Packard Company. -->
<!-- (c) Copyright 1995 International Business Machines Corp. -->
<!-- (c) Copyright 1995 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1995 Novell, Inc. -->
<!-- (c) Copyright 1995 FUJITSU LIMITED. -->
<!-- (c) Copyright 1995 Hitachi. -->
<chapter id="SAG.PrCnf.div.1">
<title id="SAG.PrCnf.mkr.1">Configuraci&oacute;n y administraci&oacute;n de
la impresi&oacute;n desde el escritorio</title>
<para id="SAG.PrCnf.mkr.2"><indexterm><primary>impresi&oacute;n</primary>
<secondary>administraci&oacute;n</secondary></indexterm>Existen diversos procedimientos
que un usuario de escritorio puede utilizar para imprimir archivos. Se clasifican
en dos categor&iacute;as principales: impresi&oacute;n desde el escritorio
e impresi&oacute;n desde una aplicaci&oacute;n.</para>
<para>Los procedimientos para imprimir desde el escritorio incluyen:</para>
<itemizedlist remap="Bullet1">
<listitem><para>Seleccionar un archivo en el Gestor de archivos y elegir Imprimir
en el men&uacute; Seleccionado o en el men&uacute; emergente del icono</para>
</listitem>
<listitem><para>Arrastrar un archivo del Gestor de archivos al control de
Impresora del Panel Frontal o al subpanel Impresoras personales</para>
</listitem>
<listitem><para>Arrastrar un archivo del Gestor de archivos a una impresora
de la ventana principal del Gestor de Impresi&oacute;n</para>
<para>Para imprimir una aplicaci&oacute;n, utilice el mandato Imprimir, al
que se accede generalmente desde un men&uacute; o desde otro control de la
ventana de la aplicaci&oacute;n.</para>
<informaltable id="SAG.PrCnf.itbl.1" frame="All">
<tgroup cols="1" colsep="1" rowsep="1">
<colspec colwidth="4.00in">
<tbody>
<row>
<entry align="left" valign="top"><para><!--Original XRef content: 'Adding
and Deleting Printers108'--><xref role="JumpText" linkend="SAG.PrCnf.div.2"></para></entry>
</row>
<row>
<entry align="left" valign="top"><para><!--Original XRef content: 'Printer
Icon Images109'--><xref role="JumpText" linkend="SAG.PrCnf.div.6"></para></entry>
</row>
<row>
<entry align="left" valign="top"><para><!--Original XRef content: 'Configuring
the Default Printer110'--><xref role="JumpText" linkend="SAG.PrCnf.div.9"></para></entry>
</row>
<row>
<entry align="left" valign="top"><para><!--Original XRef content: 'Printing
Concepts112'--><xref role="JumpText" linkend="SAG.PrCnf.div.11"></para></entry>
</row>
</tbody>
</tgroup>
</informaltable>
</listitem>
</itemizedlist>
<sect1 id="SAG.PrCnf.div.2">
<title id="SAG.PrCnf.mkr.3">Adici&oacute;n y supresi&oacute;n de impresoras</title>
<para>Esta secci&oacute;n contiene los procedimientos para a&ntilde;adir y
suprimir impresoras en el escritorio.</para>
<sect2 id="SAG.PrCnf.div.3" role="Procedure">
<title>A&ntilde;adir una impresora al escritorio<indexterm><primary>impresoras</primary><secondary>a&ntilde;adir</secondary></indexterm></title>
<orderedlist>
<listitem><para>A&ntilde;ada una impresora a la configuraci&oacute;n del sistema.
</para>
<para>Siga las instrucciones de la documentaci&oacute;n de administraci&oacute;n
del sistema operativo.</para>
</listitem>
<listitem><para>Ejecute el comando:</para>
<programlisting>env LANG=<replaceable remap="Emphasis">idioma</replaceable> /usr/dt/bin/dtprintinfo -populate
</programlisting>
<para>Note que deber&aacute; contar con permiso de superusuario para ejecutar
este comando.</para>
</listitem>
<listitem><para>Reinicie el Gestor de Impresi&oacute;n o pulse dos veces Recargar
acciones desde el grupo de aplicaciones Herramientas_Escritorio del Gestor
de aplicaciones. Verifique si aparece la impresora.</para>
</listitem>
<listitem><para>Env&iacute;e correo a los usuarios para informarles que tambi&eacute;n
deben reiniciar el Gestor de Impresi&oacute;n o ejecutar Recargar acciones.
</para>
</listitem>
</orderedlist>
<para>Cada vez que se invoca,<indexterm><primary>Gestor de Impresi&oacute;n</primary></indexterm> el Gestor de Impresi&oacute;n lee la lista de configuraciones
de impresoras del sistema. Si detecta una nueva impresora, crea autom&aacute;ticamente
una nueva acci&oacute;n de impresora de escritorio y el icono para dicha impresora.
No es necesario realizar ninguna otra acci&oacute;n para que la impresora
aparezca en el escritorio.</para>
</sect2>
<sect2 id="SAG.PrCnf.div.4" role="Procedure">
<title id="SAG.PrCnf.mkr.4">Suprimir una impresora del escritorio<indexterm>
<primary>impresoras</primary><secondary>suprimir</secondary></indexterm></title>
<orderedlist>
<listitem><para>Elimine la impresora de la configuraci&oacute;n del sistema.
</para>
<para>Siga las instrucciones de la documentaci&oacute;n de administraci&oacute;n
del sistema operativo.</para>
</listitem>
<listitem><para>Reinicie el Gestor de Impresi&oacute;n o pulse dos veces Recargar
acciones desde el grupo de aplicaciones <structname>Herramientas_Escritorio</structname> del Gestor de aplicaciones. Verifique si la impresora ha desaparecido.
</para>
</listitem>
<listitem><para>Env&iacute;e correo a los usuarios para informarles que tambi&eacute;n
deben reiniciar el Gestor de Impresi&oacute;n o ejecutar Recargar acciones.
</para>
</listitem>
</orderedlist>
<para>Cada vez que se invoca, el Gestor de Impresi&oacute;n lee la lista de
configuraciones de impresoras del sistema. Si comprueba que se ha eliminado
una impresora de la lista, elimina autom&aacute;ticamente la acci&oacute;n
y el icono de dicha impresora del Gestor de Impresi&oacute;n y del Gestor
de archivos. No es necesario realizar ninguna otra acci&oacute;n para suprimir
la impresora del escritorio.</para>
<note>
<para>El Gestor de impresi&oacute;n no puede eliminar impresoras del Panel
Frontal. Por consiguiente, siempre que elimine una impresora de la configuraci&oacute;n,
deber&aacute; enviar correo a todos los usuarios del sistema inform&aacute;ndoles
que deben eliminar los iconos de la impresora suprimida del Panel Frontal.
</para>
</note>
</sect2>
<sect2 id="SAG.PrCnf.div.5">
<title>Modificaci&oacute;n del intervalo de actualizaci&oacute;n de trabajos<indexterm>
<primary>impresoras</primary><secondary>intervalo de actualizaci&oacute;n
de trabajos</secondary></indexterm><indexterm><primary>intervalo de actualizaci&oacute;n
de trabajos de impresi&oacute;n</primary></indexterm></title>
<para>Para cambiar la frecuencia con que se actualiza la informaci&oacute;n
mostrada en<indexterm><primary>Gestor de Impresi&oacute;n</primary><secondary>intervalo de actualizaci&oacute;n de trabajos</secondary></indexterm> el Gestor
de Impresi&oacute;n, modifique el intervalo de actualizaci&oacute;n de trabajos.
Como valor predeterminado, el Gestor de Impresi&oacute;n consulta las impresoras
cada treinta segundos para obtener informaci&oacute;n sobre los trabajos de
impresi&oacute;n. Se puede cambiar la frecuencia con que el Gestor de Impresi&oacute;n
consulta las impresoras utilizando el control deslizante Intervalo de actualizaci&oacute;n
en el cuadro de di&aacute;logo Establecer opciones (que se muestra eligiendo
Establecer opciones en el men&uacute; Vista).</para>
</sect2>
</sect1>
<sect1 id="SAG.PrCnf.div.6">
<title id="SAG.PrCnf.mkr.5">Im&aacute;genes de iconos de impresoras<indexterm>
<primary>impresoras</primary><secondary>im&aacute;genes de iconos</secondary>
</indexterm><indexterm><primary>iconos</primary><secondary>im&aacute;genes
de impresoras</secondary></indexterm></title>
<para>Cuando a&ntilde;ada una impresora, se le asignar&aacute; autom&aacute;ticamente
un icono de impresora predeterminado. Si dispone de otro icono que se desea
que est&eacute; disponible para dicha impresora, ponga los archivos de iconos
en <filename>/etc/dt/appconfig/icons/</filename><symbol role="Variable">idioma</symbol> o en alg&uacute;n otro directorio de la ruta de b&uacute;squeda
de iconos. Los usuarios pueden seleccionar este icono para sustituir el icono
predeterminado de la impresora.</para>
<para><emphasis>Deber&aacute;</emphasis> crear un conjunto completo (grande,
mediano y peque&ntilde;o) de iconos o &eacute;stos no aparecer&aacute;n en
el selector de iconos del Gestor de Impresi&oacute;n.</para>
<para>Para obtener m&aacute;s informaci&oacute;n sobre la ruta de b&uacute;squeda
de iconos, consulte la secci&oacute;n <!--Original XRef content: '&rdquo;Icon
Search Path&rdquo; on page&numsp;122'--><xref role="SecTitleAndPageNum" linkend="SAG.Datab.mkr.13">.
</para>
<sect2 id="SAG.PrCnf.div.7">
<title>Nombres y tama&ntilde;os de los archivos de iconos</title>
<para>Los requisitos de denominaci&oacute;n de los archivos de iconos son:
</para>
<programlisting><symbol role="Variable">nombre_base.tama&ntilde;o</symbol>.<symbol role="Variable">tipo</symbol></programlisting>
<para>donde:</para>
<informaltable>
<tgroup cols="2" colsep="0" rowsep="0">
<colspec colwidth="104*">
<colspec colwidth="424*">
<tbody>
<row>
<entry align="left" valign="top"><para><symbol role="Variable">tama&ntilde;o</symbol></para></entry>
<entry align="left" valign="top"><para><command>l</command> (grande), <command>m</command> (mediano), <command>t</command> (peque&ntilde;o). Para obtener
m&aacute;s informaci&oacute;n sobre los tama&ntilde;os de los iconos, consulte
la secci&oacute;n <!--Original XRef content: '&rdquo;Icon Size Conventions&rdquo;
on page&numsp;203'--><xref role="SecTitleAndPageNum" linkend="SAG.CrIcn.mkr.4">.
</para></entry>
</row>
<row>
<entry align="left" valign="top"><para><symbol role="Variable">tipo</symbol></para></entry>
<entry align="left" valign="top"><para><command>pm</command> (mapa de pixels
de color), <command>bm</command> (mapa de bits).</para></entry>
</row>
</tbody>
</tgroup>
</informaltable>
<para>Por ejemplo, los nombres de archivo de iconos para los iconos de mapa
de pixels mediano y peque&ntilde;o para una impresora de color pueden ser
<filename>ImpresoraColor.m.pm</filename> y <filename>ImpresoraColor.t.pm</filename>.</para>
<para>Consulte el <!--Original XRef content: 'Chapter&numsp;12, &rdquo;Creating
Icons for the Desktop'--><xref role="ChapNumAndTitle" linkend="SAG.CrIcn.mkr.1">
para obtener m&aacute;s informaci&oacute;n sobre c&oacute;mo crear iconos.
</para>
</sect2>
<sect2 id="SAG.PrCnf.div.8" role="Procedure">
<title>Cambiar globalmente el icono, la etiqueta de impresora o la descripci&oacute;n
de una impresora</title>
<para>Tan pronto como a&ntilde;ada la impresora, deber&aacute; cambiar las
propiedades globales de la misma antes de que los usuarios la hayan modificado
utilizando el Gestor de Impresi&oacute;n. Una vez que un usuario haya modificado
las propiedades de la impresora utilizando el Gestor de Impresi&oacute;n,
los cambios que usted efect&uacute;e no se ver&aacute;n reflejados en dichas
propiedades.</para>
<para>Edite el archivo <filename>/etc/dt/appconfig/types/<symbol role="Variable">idioma</symbol>/<symbol role="Variable">nombre_cola_impresora</symbol>.dt</filename> con la informaci&oacute;n deseada para el icono, la etiqueta de
impresora o la descripci&oacute;n:</para>
<orderedlist>
<listitem><para>En el campo <command>ICON</command>, actualice <symbol role="Variable">nombrebase</symbol> con el nuevo nombre base del icono.</para>
</listitem>
<listitem><para><indexterm><primary>impresoras</primary><secondary>etiquetas</secondary></indexterm>En el campo <command>LABEL</command>, actualice <symbol role="Variable">nombreetiqueta</symbol> con la nueva etiqueta de la impresora.
</para>
<itemizedlist>
<listitem><para><indexterm><primary>impresoras</primary><secondary>Ayuda sobre
el tema</secondary></indexterm><indexterm><primary>ayuda</primary><secondary>en iconos de impresoras</secondary></indexterm>Actualice el texto del campo <command>DESCRIPTION</command>.</para>
<para>&Eacute;ste es un lugar adecuado para poner la ubicaci&oacute;n de la
impresora, el tipo de impresora y el contacto de impresora. Para a&ntilde;adir
m&aacute;s de una l&iacute;nea, ponga un \ al final de la l&iacute;nea. Por
ejemplo:</para>
</listitem>
</itemizedlist>
</listitem>
</orderedlist>
<programlisting> DESCRIPTION &Eacute;sta es una impresora PostScript del Edificio 1\
       Sala 123. Llame al tel&eacute;fono 555-5555 en caso de\
       tener problemas.</programlisting>
</sect2>
</sect1>
<sect1 id="SAG.PrCnf.div.9">
<title id="SAG.PrCnf.mkr.6">Configuraci&oacute;n de la impresora predeterminada<indexterm>
<primary>impresoras</primary><secondary>predeterminadas</secondary></indexterm></title>
<para>Se accede a la impresora predeterminada cuando el usuario:</para>
<itemizedlist remap="Bullet1">
<listitem><para>Suelta un objeto en el control de Impresora del Panel Frontal
</para>
</listitem>
<listitem><para>Selecciona un objeto en el Gestor de archivos y elige Imprimir
en el men&uacute; Seleccionado o en el men&uacute; emergente del icono</para>
</listitem>
<listitem><para>Imprime desde aplicaciones que utilizan la impresora predeterminada
</para>
</listitem>
</itemizedlist>
<sect2 id="SAG.PrCnf.div.10" role="Procedure">
<title>Cambiar el destino de la impresi&oacute;n predeterminada<indexterm>
<primary>impresi&oacute;n</primary><secondary>destino predeterminado</secondary>
</indexterm></title>
<para>Para cambiar la impresora predeterminada para todos los usuarios:</para>
<orderedlist>
<listitem><para>Abra el archivo <filename>/etc/dt/config/Xsession.d/0010.dtpaths</filename>.</para>
<para>Si <filename>/etc/dt/config/Xsession.d/0010.dtpaths</filename> no existe,
c&oacute;pielo de <filename>/usr/dt/config/Xsession.d/0010.dtpaths</filename></para>
</listitem>
<listitem><para>En la l&iacute;nea<command role="Variable">LPDEST=<symbol role="Variable">impresora</symbol></command>, actualice <symbol role="Variable">impresora</symbol> con el nuevo destino de la impresi&oacute;n predeterminada.<indexterm>
<primary>LPDEST, variable</primary></indexterm></para>
<para>Si la l&iacute;nea no existe, a&ntilde;ada una l&iacute;nea <command>LPDEST=<symbol role="Variable">impresora</symbol></command>, donde <symbol role="Variable">impresora</symbol> es el nombre de la impresora que desea
que se convierta en impresora predeterminada.</para>
</listitem>
<listitem><para>Es necesario que los usuarios finalicen la sesi&oacute;n y
la vuelvan a iniciar.</para>
</listitem>
</orderedlist>
<para>Para cambiar la impresora predeterminada para un usuario individual,
dicho usuario debe:</para>
<itemizedlist>
<listitem><para>Copiar otra impresora del subpanel Impresoras personales en
el Panel Frontal.</para>
</listitem>
</itemizedlist>
<para>Para designar como impresora predeterminada una impresora diferente:
</para>
<orderedlist>
<listitem><para>Vaya a la carpeta de inicio y abra el archivo <filename>.dtprofile</filename>.</para>
</listitem>
<listitem><para>A&ntilde;ada o edite una l&iacute;nea que establezca un valor
para la variable de entorno <systemitem>LPDEST</systemitem>:</para>
<programlisting remap="CodeIndent1">LPDEST=<symbol role="Variable">dispositivo_impresora;</symbol> export LPDEST</programlisting>
<para>Si est&aacute; utilizando <command>csh</command>, la sintaxis es:</para>
<para><command>setenv LPDEST <symbol role="Variable">dispositivo_impresora</symbol> </command></para>
<para>Por ejemplo, la l&iacute;nea siguiente cambiar&iacute;a la impresora
predeterminada por la impresora cuyo nombre de dispositivo es <command>laser3d</command>.</para>
<para remap="CodeIndent1"><programlisting>LPDEST=laser3d; export LPDEST</programlisting></para>
<para>Si est&aacute; utilizando <command>csh</command>, la sintaxis es:</para>
<para remap="CodeIndent1"><command>setenv LPDEST laser3d</command></para>
</listitem>
</orderedlist>
</sect2>
</sect1>
<sect1 id="SAG.PrCnf.div.11">
<title id="SAG.PrCnf.mkr.7">Conceptos de impresi&oacute;n<indexterm><primary>impresi&oacute;n</primary><secondary>conceptos</secondary></indexterm></title>
<para>Los usuarios pueden invocar la funci&oacute;n de impresi&oacute;n arrastrando
un objeto, ya sea un icono o texto seleccionado, hacia el icono de la impresora
y solt&aacute;ndolo en dicho icono. Otra manera de invocar la funci&oacute;n
de impresi&oacute;n es seleccionar un comando de impresi&oacute;n en una aplicaci&oacute;n.
En ambos casos, la impresi&oacute;n se efect&uacute;a de manera diferente.
</para>
<sect2 id="SAG.PrCnf.div.12">
<title id="SAG.PrCnf.mkr.8">Impresi&oacute;n invocada arrastrando y soltando<indexterm>
<primary>impresi&oacute;n</primary><secondary>arrastrando y soltando</secondary>
</indexterm></title>
<para>Cuando se inicia una solicitud de impresi&oacute;n soltando un archivo
o texto seleccionado en un control de impresora, el sistema efect&uacute;a
las siguientes operaciones:</para>
<orderedlist>
<listitem><para>Busca la definici&oacute;n del objeto soltado en la base de
datos de tipos de datos.</para>
</listitem>
<listitem><para>Si existe una operaci&oacute;n de impresi&oacute;n &uacute;nica
para el tipo de datos (especificada mediante el campo ARG_TYPE de la operaci&oacute;n
de impresi&oacute;n), se utiliza. Si no se encuentra una operaci&oacute;n
de impresi&oacute;n espec&iacute;fica para el tipo de datos, la operaci&oacute;n
de impresi&oacute;n predeterminada utiliza <command>dtlp</command> para imprimir
el objeto. Por ejemplo, si el archivo es de tipo PostScript, el sistema utiliza
la operaci&oacute;n de impresi&oacute;n para archivos PostScript. (Esta operaci&oacute;n
est&aacute; definida en <filename>/usr/dt/appconfig/types/&lt;idioma>/dt.dt</filename>.) Si ha utilizado la herramienta Crear Acci&oacute;n para este
tipo de datos, el comando de impresi&oacute;n que ha introducido es la operaci&oacute;n
de impresi&oacute;n &uacute;nica que se utilizar&aacute; para imprimir archivos
de este tipo de datos.</para>
</listitem>
<listitem><para>Este archivo se env&iacute;a a la impresora mediante el subsistema
de impresi&oacute;n normal de UNIX <command>lp</command>.</para>
</listitem>
</orderedlist>
</sect2>
<sect2 id="SAG.PrCnf.div.13">
<title id="SAG.PrCnf.mkr.9">Impresi&oacute;n desde aplicaciones CDE<indexterm>
<primary>impresi&oacute;n</primary><secondary>desde aplicaciones CDE</secondary>
</indexterm></title>
<para>Varias aplicaciones, incluyendo el Gestor de calendario (<command>dtcm</command>), Gestor de Ayuda (<command>dthelp</command>), Aplicaci&oacute;n
de Correo (<command>dtmail</command>) y Editor de textos (<command>dtpad</command>)
cuentan con soporte de impresi&oacute;n incorporado. Estas aplicaciones dependen
de los servicios del servidor de impresi&oacute;n X para imprimir. El servidor
de impresi&oacute;n X es simplemente un servidor X com&uacute;n (de video)
mejorado para producir salida de datos para varios tipos de impresoras incluyendo
raster, PCL y Post Script.</para>
<para>Cuando se inicia una solicitud de impresi&oacute;n desde una aplicaci&oacute;n
CDE (por ejemplo seleccionando el comando "Imprimir ..." del men&uacute; Archivo
del Editor de textos, se efect&uacute;an las siguientes operaciones:</para>
<orderedlist>
<listitem><para>La aplicaci&oacute;n pone en pantalla un cuadro de di&aacute;logo
que permite al usuario configurar opciones de impresi&oacute;n gen&eacute;ricas,
espec&iacute;ficas para la aplicaci&oacute;n o impresora.</para>
</listitem>
<listitem><para>La aplicaci&oacute;n env&iacute;a instrucciones al servidor
de impresi&oacute;n X que contienen solicitudes de dibujo X est&aacute;ndar
mejoradas mediante indicadores de p&aacute;gina y l&iacute;mites de tarea.
</para>
</listitem>
<listitem><para>El servidor de impresi&oacute;n X convierte las instrucciones
en datos de salida adecuados para la impresora de destino. La salida de datos
espec&iacute;fica depende de las funciones del servidor de impresi&oacute;n
X y de la impresora de destino seleccionada.</para>
</listitem>
<listitem><para>El servidor de impresi&oacute;n X env&iacute;a los datos de
salida de la impresora mediante el subsistema de impresi&oacute;n com&uacute;n
de UNIX <command>lp</command>.</para>
</listitem>
</orderedlist>
<sect3 id="SAG.PrCnf.div.14">
<title id="SAG.PrCnf.mkr.10">Soporte de impresi&oacute;n desde aplicaciones
CDE<indexterm><primary>impresi&oacute;n</primary><secondary>soporte para
aplicaciones CDE</secondary></indexterm></title>
<para>Adem&aacute;s de la aplicaci&oacute;n y del servidor de impresi&oacute;n
X, se requieren dos programas para soportar operaciones de impresi&oacute;n
desde aplicaciones CDE: Print Dialog Manager (PDM) y el demonio PDM.</para>
<para>Programas especiales llamados Print Dialog Managers (gestores de di&aacute;logo
de impresi&oacute;n o PDM) controlan la visualizaci&oacute;n y configuraci&oacute;n
de opciones de impresi&oacute;n para impresoras especificas. Cada clase de
impresora cuenta con su propio PDM que conoce las funciones y conjuntos de
opciones espec&iacute;ficas que ofrece.</para>
<para>Una segunda clase de programas llamados demonios PDM, controlan operaciones
para detectar cuando una aplicaci&oacute;n desea poner en pantalla o configurar
opciones de impresi&oacute;n para una impresora espec&iacute;fica y activan
el PDM correspondiente a la impresora seleccionada.</para>
<para>Resumiendo, para imprimir correctamente desde aplicaciones CDE, deber&aacute;:
</para>
<orderedlist>
<listitem><para>Asegurarse de que las impresoras se hayan agregado correctamente
a la configuraci&oacute;n del sistema.</para>
</listitem>
<listitem><para>Asegurarse de que los servidores de impresi&oacute;n X correctamente
configurados necesarios para soportar la configuraci&oacute;n de impresoras
est&eacute;n funcionando. El servidor de impresi&oacute;n X predeterminado
para CDE es <literal>Xprt</literal>.</para>
</listitem>
<listitem><para>Asegurarse de que los demonios Print Dialog Manager (PDM)
correctamente configurados necesarios para soportar la configuraci&oacute;n
de impresoras est&eacute;n funcionado. El demonio PDM predeterminado para
CDE es <command>dtpdmd</command>.</para>
</listitem>
<listitem><para>Asegurarse de que los Print Dialog Managers (PDM) correctamente
configurados necesarios para soportar la configuraci&oacute;n de impresoras
est&eacute;n disponibles. El PDM predeterminado para CDE<?Pub Caret> es <command>dtpdm</command>.</para>
</listitem>
</orderedlist>
</sect3>
</sect2>
</sect1>
</chapter>
<!--fickle 1.14 mif-to-docbook 1.7 01/02/96 14:35:19-->
<?Pub *0000026091>
